[
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0x4471620d",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0xddfcfe64",
            "title": "Background",
            "text": "On March 12, the CERT-UA published an alert on a threat about phishing emails sent on behalf of state bodies of Ukraine that urged the recievers to update the system by using a link provided in the email. Once the user opens the link two files are downloaded, one is Cobalt Strike Beacon the other is a dropper that will download and execute two additional files. These additional files are base64 encoded, the files saved as: microsoft-cortana.exe (classified as GraphSteel) and oracle-java.exe (GrimPlant backdoor). The attack used Discord as a hosting server for the additional payload that was downloaded.\nOn March 15, SentinelOne found two more samples of the GraphSteel and GrimPlant malware families. These samples written in Go were dropped by an executable that was disguised as a translation application. The new samples are similar to those published by the CERT-UA, both in the naming and the functionality.\nOn March 28, CERT-UA published another alert about phishing emails with an attached xls file. The subject of the email and the file name are both Wage arrear. The attached file had macros that, once executed, created a file called Base-Update.exe a malware that downloads and executes two other files classified as GraphSteel and GrimPlant by the CERT."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0x3199147f",
            "title": "Phishing Email",
            "text": "The subject of the email: (arrears in wages).\nThe email was sent from zam@mdfi.gov.ua to ilenko@gng.com.ua.\nThe sender domain mdfi.gov.ua belongs to the Mykolayiv Regional Phytosanitary Laboratory.\nThe receiver is the Head of Department of Technical Supply in OKKO Group, one of the largest filling stations in Ukraine, this person is in charge of the gas stations chain.\nBased on the headers of the email: the email was sent from 87.249.139.161 (hosting web server located in Turkey).\nWhile reviewing the emails transport path, we noticed that the domain mdfi.gov.ua did not have a configured SPF record to prevent email spoofing. An SPF record is used to restrict which IP addresses are allowed to send emails for a specific domain. If this record is not set, any IP address is technically allowed to send emails using that domain name. Some email providers do warn when they receive an email from an address that doesnt have an SPF record. The screenshot below shows the warning message displayed in GMail when reading such email.\nOur theory is that the threat actor exploited this vulnerability to send spoofed phishing emails to their targets. We reported the issue to CERT-UA.\nWe followed the sender IP address and found three other emails: two emails submitted on March 29 from Ukraine targeting ICTV, a Ukrainian TV channel and the third email was submitted in February from Romania. The emails that target UA have the same subject and use the same attached xls file that delivers the first malicious payload."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0xb9865a95",
            "title": "The Elephant Framework",
            "text": "The malware that is dropped by the phishing lure is the dropper component of what we call the Elephant Framework. The framework consists of four components that work in unison. The code snippet below shows a reconstruction of the source code tree, bold indicating folders, showing how the different components have been organized. The location of the implants entrypoint is unknown and has been guessed to be in the root folder. As there are also server components to the framework, we hypothesize that there are more folders for the two servers used by the framework."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0xb95c31e9",
            "title": "Dropper Component",
            "text": "While called the dropper in the framework, this component does not have an embedded payload. Instead it is technically a downloader that fetches the next stage called the downloader. The next stage is downloaded from the URL hxxp://194.31.98.124:443/i and saved to the users home directory (%HOME%/.java-sdk/java-sdk.exe). The next stage is executed with the command line flag -a 0CyCcrhI/6B5wKE8XLOd+w==, base64 and AES encrypted information about the C2 server."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0xec40763a",
            "title": "Downloader Component",
            "text": "The downloader acts as an orchestrator for the other components. In addition to downloading the client and the implant components, it also sets up persistence and can perform updates. Like all the other components, before any malicious activity is taken it performs some evasion techniques. The difference between this component and the others is that this one is using code from the ColdFire project on GitHub. The screenshot below shows the malware using the Wait function to sleep for 10 seconds before allocating 200 mb of garbage data.\nPersistence is established by adding a new key entry with the name Java-3DK to the registry key Software\\Microsoft\\Windows\\CurrentVersion\\Run. After this, the malware checks if a new binary exists by comparing its MD5 hash with a hash from the server. If no update is needed, it downloads the other two components.\nThe downloader has some 3rd party libraries, whose metadata are listed in the binary, that are not used. All the 3rd party libraries are listed in the code snippet below. In the list for example port-scanner, gopacket, and gateway packages are not being used. These are all libraries to facilitate lateral movement. It is not clear if these are left-overs from an older version of the malware or hints of future functionality.\nAnalysis of the Elephant downloader"
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0xd58d54d3",
            "title": "Implant Component (GrimPlant)",
            "text": "GrimPlant is a backdoor that allows the operator to execute arbitrary PowerShell scripts on the infected machine. The backdoor has a relatively small set of functionality, for example it doesnt have any persistence functionality on its own. When the malware first is executed, it allocates 200 mb and sleeps for 10 seconds, the function shown in the screenshot below. This is an anti-emulation technique that has been found in other malware written in Go.\nThe Command and Control (C2) address is not included in the binary. Instead it is passed in to the malware via the command line flag -addr. The address is not provided as a plain string. Instead it has been encrypted with AES in Cipher-Block Chaining (CBC) mode. The malware decrypts the string with the embedded key (f1d21960d8eb2fddf2538d29a5fd50b5f64a3f9bf06f2a3c4c950438c9a7f78e) and a null IV. The port used by the C2 server is hardcoded to port 80.\nGrimPlant communicates with the C2 server over gRPC. The communication is encrypted with TLS. The malware has an embedded root certificate that it uses to verify that it talks to a trusted server. The code snippet shows parts of the root certificate information. The certificate used by the C2 server has been signed by this root certificate which allows the threat actor to rotate the certificate without redeploying a new malware.\nThere are only a handful of gRPC methods supported by the malware. A reconstructed protobuf specification is shown in the code snippet below. To identify which instance of the malware is sending the request to the C2 server, the malware uses its machine ID as an unique identifier in the messages. When the malware first connects to the C2 server, it authenticates itself with the password sdrunlygvhwbcaeiuklgunvre.\nAfter a successful authentication, it sends a heartbeat message every 10 seconds. This message includes information about the infected machine: public IP address, hostname, username, etc. In addition to the heartbeat message, the malware starts the command loop that checks for new commands to execute every 3 seconds. If a command is received it executes it by spawning a PowerShell instance by executing %windir%\\SysWOW64\\WindowsPowerShell\\v1.0\\powershell.exe and returns the result to the C2 server."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0xd9b5d6e6",
            "title": "Client Component (GraphSteel)",
            "text": "The client component is a credential and file stealer. It communicates with the C2 server over WebSockets to a GraphQL endpoint. All the messages are encrypted with AES. The key is received from the C2 server. The malware author has written their own RSA implementation for the key exchange that is used to receive the shared secret. All messages prior to the key exchange, including the key exchange itself, are encrypted with AES using a hardcoded key.\nThe credentials on the machine are stolen using code lifted from goLazagne. In addition to stealing credentials, the malware will look in the users Documents, Downloads, Pictures, and Desktop folder for files with the file-extensions listed in the snippet below.\nIf it finds a file with a matching file extension, it generates the MD5 hash for the file and checks with the C2 server if the file has already been uploaded. If it hasnt, the file is uploaded to the C2 server."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0x3f0c2aca",
            "title": "Infrastructure",
            "text": "Using the embedded CA certificate in the malware, we uncovered older service certificates and IP addresses. The oldest certificate we discovered had a validity date of not before December 9th, 2021. The IP address of the server where this certificate was served from is owned by the Russian hosting provider Zservers and still returned Elephant components as of April 2022. The components retrieved from the server are very similar to the samples used at the end of March. The other hosting providers used by the threat actor are PQ Hosting and Serverion.\nThe threat actor has chosen to sprinkle some French connections within their infrastructure. The certificates use French location information and the domain name forkscenter[.]fr. We dont know if the decision to name it Elephant is a nod to Babar, an espionage software attributed to a French intelligence agency, or intended as a false flag."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0x6f030116",
            "title": "Conclusion",
            "text": "UAC-0056 (TA471, SaintBear, UNC2589) started using a new malware framework called Elephant back in December 2021. The malware has been delivered in targeted spear phishing campaigns using spoofed Ukrainian governmental email addresses. The malware consists of at least four different components that are used for stealing credentials, documents, and to provide remote access to the infected machine. The threat actor has opted to use multiple protocols for C2 communication, gRPC and GraphQL over websockets. This is an interesting choice as it complicates the development of the framework with more code to maintain."
        }
    },
    {
        "report": {
            "id": "report_0x177043fb",
            "date": "20220404",
            "title": "Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations",
            "url": "https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs"
        },
        "chapter": {
            "id": "chapter_0xb0d431a7",
            "title": "Indicators of Compromise",
            "text": "Joakim Kennedy\nDr. Joakim Kennedy is a Security Researcher analyzing malware and tracking threat actors on a daily basis. For the last few years, Joakim has been researching malware written in Go. To make the analysis easier he has written the Go Reverse Engineering Toolkit (github.com/goretk), an open-source toolkit for analysis of Go binaries.\nNicole Fishbein\nNicole is a malware analyst and reverse engineer. Prior to Intezer she was an embedded researcher in the Israel Defense Forces (IDF) Intelligence Corps.\nelephant\nGolang\nIoCs\nPhishing\nResearch\nUkraine"
        }
    }
]