[
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xa51d2858",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xf5201488",
            "title": "Infostealers Ecosystem",
            "text": "As Sophos explains, information stealers are used for a wide variety of identity theft. They enable attackers to harvest personally identifiable information (PII), including login data such as stored credentials and browser cookies that control access to web-based services. These credentials are then sold on criminal marketplaces.\nInfostealers offer an accessible entry point to criminal activity. For example, only $160 gets you a lifetime subscription to Mars Stealer. You can purchase infostealers on Dark Web forums without any vetting, unlike more sophisticated tools such as ransomware, which require you to have a reputation amongst other cybercriminals. Infostealers empower novice cybercriminals to build a reputation they can leverage to acquire more powerful malware from more sophisticated actors."
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xeea8c75f",
            "title": "Mars Stealer Statistics",
            "text": "With cryptocurrency use rising, more people will likely possess hot wallets in an unsecured environment. The crypto wallet MetaMask is the plugin most stolen using Mars Stealer.\nFigure 3: Top 5 stolen plugins\nThe Morphisec Labs Team compiled the below statistics while evaluating a single actors campaign last month. It includes targets by country, total stolen passwords, and so on. In addition, we found more than infected 50 domain users, compromising companies' domain passwords. The vast majority of victims are students, faculty members, and content makers looking for legitimate applications who end up with malicious ones instead. Aside from the listed credential types, Morphisec identified credentials which led to the full compromise of a leading healthcare infrastructure provider in Canada, and a number of high profile Canadian service companies. We have contacted and notified the companies and the authorities.\nFigure 4: Mars admin panel"
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0x28cff467",
            "title": "Operation Mars",
            "text": "Spam email is the most common distribution method for Mars Stealer, as a compressed executable, download link, or document payload. Creating a malicious website masquerading as pirated software is another common method for spreading this infostealer."
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xce21ab2c",
            "title": "Initial access vector",
            "text": "In this campaign, the actor distributed Mars Stealer via cloned websites offering well-known software. They used the Google Ads advertising platform to trick victims searching for the original software into visiting a malicious site instead. The actor is paying for these Google Ads campaigns using stolen information (see figure 15). The example below is one of many demonstrating how the actor targets Canadians by using geographically targeted Google Ads.\nFigure 5: OpenOffice Google search yields an actor's malicious website.\nBelow is a fully cloned website masquerading as the official openoffice.org website to lure victims to download the Mars Stealer.\nFigure 6: Cloned OpenOffice website leads to the Mars stealer.\nThe downloaded payload is an executable file, with a corresponding icon and name, packed with the Babadeda crypter or Autoit loader. We wont cover the Mars Stealers technical details, which were thoroughly covered by 3xp0rt. During our investigation and research, we identified a C2tommytshop[.]comwhere the Mars admin panel is stored, which was still up and running at the time of publication.\nFigure 7: C2 open directory\nAs mentioned earlier, surprisingly, the stolen information directory was improperly configured and left open. We immediately identified that the vast majority of compromised victims are from Canada (files that start with CA_).\nFigure 8: Stolen Information\nBelow is an example of stolen information extracted from one of the folders. Its quite self-explanatory:\nAutofill - Stores browser autofill data\nCC - Stores credit card information\nPlugins - Stores browser extension data: Metamask, Coinbase wallet, Binance, etc.\nSystem.txt - Stores infected system information such as IP, country code, timezone, etc.\nFigure 9: Stolen information content"
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xea80a574",
            "title": "Mapping the Attack Infrastructure",
            "text": "Fortunately, the actor compromised his own computer with the Mars Stealer while debugging. This allowed us a rare peek into an operation by looking at his own stolen informationscreenshots, passwords, history, system information, etc. Below is an image we generated to summarize the actors most relevant activity details.\nFigure 10: Recon diagram\nWe looked at the actors screenshots and discovered they were debugging their Mars Stealer builds using HTTP Analyzer. This revealed their second Mars Stealer C2 - http://5.45.84[.]214 which was improperly configured, similar to the first C2.\nFigure 11: Actors screenshot revealing additional C2\nAn additional screenshot led us to the actors GitLab account, which was continuously updated with the latest Mars Stealer builds under the name of Tony Mont, which has been active since late November 2021. We are assuming they do this for automation purposes.\nFigure 12: Actors GitLab account\nAnother interesting screenshot revealed this actor stores their passwords in a plain text document for almost every service theyre using.\nFigure 13: Actors plain text passwords\nThe actor is also using Keitaro, a universal tracker for affiliate marketing. And the images below show the actor is a Russian speaker.\nFigure 14: Keitaro panel\nThe actors Google Ads platform page, paid for with stolen credentials.\nFigure 15: Actors Google Ads campaign"
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0x7fa7c789",
            "title": "Attribution",
            "text": "We can safely attribute this actor as a Russian national by looking at the screenshots and keyboard details from the extracted system.txt."
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xeed87e07",
            "title": "Protect Yourself From Infostealers like Mars Stealer",
            "text": "Morphisec Labs will keep monitoring the Mars Stealer and provide updates when appropriate. Infostealers are used by a wide variety of cybercriminals, from novices to state-sponsored actors. Theyre easy to acquireand they work. Mars is currently being promoted in over 47 different underground forums, Darknet onion sites, and Telegram channels, and even has an official Telegram channel for purchasing through.\nMorphisec protects against advanced attack chains such as those used in the Mars stealer. We do this with our patented Moving Target Defense (MTD) technology, which blocks advanced and zero-day attacks. MTD uses system polymorphism to hide application assets, operating system assets, and other critical assets from adversaries. This leads to unpredictable and dramatically reduced attack surfaces.\nGartner analysts call Moving Target Defense a game-changer. Learn more about Moving Target Defense and why Gartner cited this technology in its report: Emerging Trends and Technologies Impact Radar for Security."
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0x27eef117",
            "title": "Indicators of Compromise (IOCs)",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xb63ebada",
            "title": "Services",
            "text": "",
            "table": "0;1\nIP/URL;Service\n91.92.128[.]35;Keitaro panel\nhttps://gitlab.com/corpsoft;GitLab account\nserver315.web-hosting.com:2083;cPanel file manager\n"
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0x373ba2a5",
            "title": "Mars C2",
            "text": "",
            "table": "0\ntommytshop[.]com 5.45.84[.]214 193.56.146[.]66 185.212.130[.]47 tonyshop312[.]com 66.29.142[.]232 telemeetrydata[.]cn\n"
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xf161c9bc",
            "title": "Samples (SHA256)",
            "text": "",
            "table": "0\nc48e5a61fd89ac5e950a37e1d81d2f733c16983d369dbedbb3a0c3e8c97f7b14 38807bc99d0f9a78480d3b12cfc96cdbfdb83bc277758595e77808b9b22ac087 bb48381955c8676b866760129db84ffce2e0b9c1fdd6a0179ab022dbf6fea708 cf1d4bf6b4a831d9664bbf0f40a609152a699f8d535c21e41ada406c47f63bfa 10731eea825c6bbcd5c543b2c98f4de384b36279cabba22fa247cda865c59093 af023cd8d2dcbeccfaf197094721768593154fc35019534a399563b011862a91 c26e405d1f07a9090e83454a7a978d5a89ef4764b00e7b354e6b2bb653e49378 9ed18a0b5e15bd4ecb73c5428e208b5d1b162274cfb0d6c62f7b5c3a04ec4d56 ab7e7d8594befb5a7137ec323db87a4aacfa64260327d61eee30626a760c3d5b d5ee3a86821e452c33f178dc080aff7ca5054518a719ef74320909cbb55bb6c5 36613d674b4737da2b2986d9a49b48d06f1233cc7ea6aa7386bdb6d4bec90301 b15cb7537c9da026144ce35c70b21f72f81c8855b537c6ae987e785447e90f42 c3c1549bdd5613e9dbc3f09963cd1bd0f303b6f33bb4df62d9260590869cadec 8f925aa659cdab2466d2860dfc06d14d1c384c7a449683813db8d9219ed333c9 6929dae4d2bf6d2086bca0389e967f2c43bfb940da09b175b39df5fa1684a027\n"
        }
    },
    {
        "report": {
            "id": "report_0x1ae7c838",
            "date": "20220329",
            "title": "Exclusive Threat Research: Mars (Stealer) Attacks!",
            "url": "https://blog.morphisec.com/threat-research-mars-stealer"
        },
        "chapter": {
            "id": "chapter_0xcbecb3e",
            "title": "Search Our Site",
            "text": ""
        }
    }
]