[
    {
        "report": {
            "id": "report_0xd773910c",
            "date": "20220321",
            "title": "BitRAT Disguised as Windows Product Key Verification Tool Being Distributed",
            "url": "https://asec.ahnlab.com/en/32781"
        },
        "chapter": {
            "id": "chapter_0xb2838cd0",
            "title": "BitRAT Disguised as Windows Product Key Verification Tool Being Distributed",
            "text": "The ASEC analysis team has recently discovered BitRAT which is being distributed via webhards. Because the attacker disguised the malware as Windows 10 license verification tool from the development stage, users who download illegal crack tools from webhard and install it to verify Windows license are at risk of having BitRAT installed into their PC.\nThe following shows a post that was uploaded to webhard, one that harbors the malware. The title is [New][Quick Install]Windows License Verification[One-click].\nFigure 1. Post disguised as download of Windows license verification tool 1\nFigure 2. Post disguised as download of Windows license verification tool 2\nA compressed file named Program.zip is downloaded, and it is compressed and locked with a password 1234. It contains a Windows 10 license verification tool named W10DigitalActivation.exe.\nFigure 3. Files included in compressed file\nW10DigitalActivation.exe is a 7z SFX file that carries an actual verification tool called W10DigitalActivation.msi and the malware named W10DigitalActivation_Temp.msi. When the user double-clicks the file, it installs both files concurrently. As both the malware and the verification tool are run at the same time, the user is tricked into thinking that the tool is running properly as shown below.\nFigure 4. Malware inside 7z SFX file\nUnlike its name, W10DigitalActivation_Temp.msi is a downloader with exe extension that downloads additional malware. When run, it connects to following C&C servers it harbors internally, exchanging encrypted strings. Afterward, it decrypts the strings to ultimately acquire a download URL for the additional payload.\nFigure 5. C&C URL of downloader malware\nThe downloader installs the malware into the Windows startup program folder and deletes itself. Normally, the first file that is installed is a downloader of the same kind, and the downloader run this way ultimately installs BitRAT into the path %TEMP% as Software_Reporter_Tool.exe.\nFigure 6. Downloading downloader and BitRAT\nNote that this downloader is equipped with additional features and is not a simple program by any means. As shown in the figure below, one of its features uses a powershell command to add the Windows startup program folderwhere the downloader will be installedas an exclusion path for Windows Defender, and adding the BitRAT process name Software_Reporter_Tool.exe as an exclusion process for Windows Defender.\nFigure 7. Adding as Windows Defender exclusion path\nSeeing how this malware uses webhard which is considered as the most-used file-sharing platform in Korea and includes Korean characters in its code as shown in the figure below, it appears that the attacker is a Korean speaker.\nFigure 8. Code that contains Korean characters\nThe malware that is ultimately installed is a RAT (Remote Access Trojan) malware called BitRAT. BitRAT has been in sale via a hacking forum since 2020 and is being continuously used by attackers.\nFigure 9. Image of BitRAT introduction 1\nFigure 10. Image of BitRAT introduction 2\nBecause BitRAT is a RAT malware, its attacker can gain control of the system infected with it. BitRAT not only provides basic control features such as running process tasks, service tasks, file tasks, and remote commands, but also provides extra options such as various info-stealing features, HVNC, remote desktop, coin mining, and proxies.\nFigure 11. BitRAT C&C panel\nThe following is the list of the features that BitRAT provides.\n1. Network Communication Method\n Encrypted communication using TLS 1.2\n Communication using Tor\n2. Basic Control\n Process manager\n Service manager\n File manager\n Windows manager\n Software manager\n3. Information Theft\n Keylogging\n Clipboard logging\n Webcam logging\n Audio logging\n Application (e.g. Web browsers) account credential theft\n4. Remote Control\n Remote desktop\n hVNC (Hidden Desktop)\n5. Proxy\n SOCKS5 Proxy: port forwarding feature using UPnP\n Reverse Proxy: SOCKS4 Proxy\n6. Coin Mining\n XMRig CoinMiner\n7. etc.\n DDoS attack\n UAC Bypass\n Windows Defender deactivation\nNote that BitRAT uses the revealed TinyNukes code, just like AveMaria. The following is a comparison of TinyNukes hVNC (routine related to Hidden Desktop) and BitRATs code.\nFigure 12. TinyNuke and BitRATs hVNC routine\nTinyNuke verifies and uses a signature string called AVE_MARIA in Reverse SOCKS4 Proxy and Hidden Desktop feature. AveMaria, on the other hand, adopted Reverse SOCKS4 Proxy feature from TinyNuke, and the name was given based on the string. BitRAT used Hidden Desktop feature, and the signature string is the same.\nNote that TinyNuke was used by the Kimsuky group in the past. Among myriad of features, only the Hidden Desktop feature was adopted and used.\n[ASEC Blog] VNC Malware (TinyNuke, TightVNC) Used by Kimsuky Group\n[ASEC Blog] AveMaria malware being distributed as spam mail\nAs shown in the examples above, the malware is being distributed actively via file-sharing websites such as Korean webhards. As such, caution is advised when running executables downloaded from a file-sharing website. It is recommended for the users to download products from the official websites of developers.\nAhnLabs anti-malware software, V3, detects and blocks the malware above using the aliases below.\n[File Detection]\n Trojan/Win.MalPacked.C5007707 (2022.03.12.04)\n Dropper/Win.BitRAT.C5012624 (2022.03.16.02)\n Downloader/Win.Generic.C5012582 (2022.03.16.01)\n Downloader/Win.Generic.C5012594 (2022.03.16.01)\n Backdoor/Win.BitRAT.C5012593 (2022.03.16.01)\n Backdoor/Win.BitRAT.C5012748 (2022.03.16.02)\n[Behavior Detection]\n Malware/MDP.AutoRun.M1288\n[IOC]\nDropper MD5\n6befd2bd3005a0390153f643ba248e25\nDownloader malware MD5\n60ee7740c4b7542701180928ef6f0d53\nc4740d6a8fb6e17e8d2b21822c45863b\nBitRAT MD5\nb8c39c252aeb7c264607a053f368f6eb\ne03a79366acb221fd5206ab4987406f2\nea1b987a7fdfc2996d5f314a20fd4d99\n54ef1804c22f6b24a930552cd51a4ae2\nDownloader malwares C&C Server\n hxxp://cothdesigns[.]com:443/1480313\n hxxp://cothdesigns[.]com:443/4411259\n hxxp://jmuquwk.duckdns[.]org:443/1480313\n hxxp://nnmmdlc.duckdns[.]org:443/1480313\nAdditional Payload Download URL Downloader\n hxxp://kx3nz98.duckdns[.]org:443/v/V_1267705.exe\n hxxp://108.61.207[.]100:443/v/V_5248849.exe\nAdditional Payload Download URL BitRAT\n hxxp://kx3nz98.duckdns[.]org:443/v/A_1992262.exe\n hxxp://108.61.207[.]100:443/result/A_1146246.exe\nBitRAT C&C\n z59okz.duckdns[.]org:5223\n cothdesigns[.]com:80\nSubscribe to AhnLabs next-generation threat intelligence platform AhnLab TIP to check related IOC and detailed analysis information.\nCategories:Malware Information\nTagged as:BitRAT, rat, TinyNuke, webhard"
        }
    },
    {
        "report": {
            "id": "report_0xd773910c",
            "date": "20220321",
            "title": "BitRAT Disguised as Windows Product Key Verification Tool Being Distributed",
            "url": "https://asec.ahnlab.com/en/32781"
        },
        "chapter": {
            "id": "chapter_0x1d394e72",
            "title": "BitRAT Disguised as Windows Product Key Verification Tool Being Distributed",
            "text": "Posted on\nMarch 21, 2022"
        }
    }
]