{
    "title": "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS",
    "url": "https://www.volexity.com/blog/2022/03/22/storm-cloud-on-the-horizon-gimmick-malware-strikes-at-macos",
    "threats": {
        "Threat": [
            {
                "token": {
                    "id": "<THREAT_0x3b3279ab>",
                    "type": "Threat",
                    "value": "gimmick"
                },
                "references": {
                    "sentences": [
                        "Post initialization, the operation of the GIMMICK malware is highly asynchronous. Prior variants of the malware written for Windows have managed this using thread pool techniques internal to the program, provided by Delphis System.Threading.TThreadPool and .NETs System.Thread and System.Action. The macOS variant, however, manages the protocol using Apple's Grand Central Dispatch (GCD) technology. This feature allows developers to distribute tasks to a system-managed pool of threads for later processing. These tasks are encapsulated into self-contained objects called blocks which are scheduled on dispatch queues for processing. The precise structures and implementation details of GCD are fairly complicated and beyond the scope of this document; several resources are provided in the Appendix.",
                        "FileManager manages a local directory hierarchy containing C2 information and command tasks in various stages of completion. Older variants of GIMMICK used slightly different names for directories, but they have remained consistent across several recent variants. The macOS implant stores this hierarchy in the root directory of the applications main bundle in a directory named MGD. Each folder within the directory structure is designated for holding a single type of file as it moves through the C2 process. A summary all directories and their purpose are given in the table below.",
                        "Not all variants of GIMMICK use all directories. For instance, the macOS implant does not use the \"df\" directory, and it creates, but does not access, the \"lf\" and \"p\" directories.",
                        "Volexity worked closely with Apple to add protections for the GIMMICK malware across their userbase. On March 17, 2022, Apple pushed new signatures to XProtect and MRT to block and remove GIMMICK. Though on by default, users can confirm they are automatically protected by verifying the \"Install system data files and security updates box is checked in their Settings (instructions can be found here).",
                        "On macOS, GIMMICK was found to support being launched as a daemon on the system or by a user. Should GIMMICK be launched directly by a user, rather than a daemon, it will install itself as a launch agent by dropping a PLIST file with contents, similar to that shown below, to /Users/<username>/Library/LaunchAgents. The name of the binary, PLIST, and agent will vary per sample. In the case observed by Volexity, the implant was customized to imitate an application commonly launched by the targeted user. It is worth noting that the Windows versions of GIMMICK Volexity has observed have no concept of setting their own persistence.",
                        "Irrespective of platform, samples of the GIMMICK malware family are fairly large and complex, which is partly due to the complexity of their asynchronous design, such as the threading and locking mechanisms required. The work involved in porting this malware and adapting its systems to a new operating system (macOS) is no light undertaking and suggests the threat actor behind it is well resourced, adept, and versatile. It is worth noting that Volexity has only ever observed GIMMICK (macOS and Windows) in use by Storm Cloud. However, it is unknown if this malware implant is developed or otherwise used by them exclusively.",
                        "This blog post provides an in-depth analysis of the macOS variant of GIMMICK, but also demonstrates the features and characteristics of the Windows variant. Volexity discovered this sample through memory analysis of the compromised system and was able to recover the implant from both memory and disk. The file name and install path were unique to the victim system and had been configured in a manner designed to blend in with job functions of the user. Additionally, GIMMICK was configured to only communicate with its Google Drive-based C2 server on working days in order to further blend in with network traffic in the target environment.",
                        "GIMMICK is used in targeted attacks by Storm Cloud, a Chinese espionage threat actor known to attack organizations across Asia. It is a feature-rich, multi-platform malware family that uses public cloud hosting services (such as Google Drive) for command-and-control (C2) channels. The newly identified macOS variant is written primarily in Objective C, with Windows versions written in both .NET and Delphi. Despite core differences in programming languages used and operating systems targeted, Volexity tracks the malware under the same name due to shared C2 architecture, file paths, and behavioral patterns used by all variants.",
                        "In late 2021, Volexity discovered an intrusion in an environment monitored as part of its Network Security Monitoring service. Volexity detected a system running frp, otherwise known as fast reverse proxy, and subsequently detected internal port scanning shortly afterward. This traffic was determined to be unauthorized and the system, a MacBook Pro running macOS 11.6 (Big Sur), was isolated for further forensic analysis. Volexity was able to run Surge Collect to acquire system memory (RAM) and select files of interest from the machine for analysis. This led to the discovery of a macOS variant of a malware implant Volexity calls GIMMICK. Volexity has encountered Windows versions of the malware family on several previous occasions."
                    ],
                    "titles": [
                        "Startup and Initialization",
                        "Conclusion",
                        "C2 Protocol",
                        "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<GEO_0x6c08516a>",
                            "type": "Geo",
                            "value": "chinese"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0xa7d71219>",
                            "type": "Geo",
                            "value": "asia"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<SHA1_0x75aa70e8>",
                            "type": "Hash",
                            "hash_type": "SHA1",
                            "value": "fe3a3e65b86d2b07654f9a6104c8cb392c88b7e8"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0xd1588496>",
                            "type": "File",
                            "value": "system.thread"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<MD5_0xa462e4a1>",
                            "type": "Hash",
                            "hash_type": "MD5",
                            "value": "943c3743f72f06e58e60fa147481db83"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0x35716857>",
                            "type": "File",
                            "value": "system.threading.tthreadpool"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0x6c08516a>",
                            "type": "Geo",
                            "value": "chinese"
                        },
                        "relation": "use_geo",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0xa7d71219>",
                            "type": "Geo",
                            "value": "asia"
                        },
                        "relation": "use_geo",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0xa4660f54>",
                            "type": "File",
                            "value": "system.action"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0x6a35444b>",
                            "type": "Category",
                            "value": "proxy"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0xb68aa214>",
                            "type": "Category",
                            "value": "rat"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    }
                ]
            }
        ]
    },
    "ttps": {},
    "meanings": {
        "Category": [
            {
                "token": {
                    "id": "<CATEGORY_0xf1a480bb>",
                    "type": "Category",
                    "value": "malware"
                },
                "references": {
                    "sentences": [
                        "malware",
                        "Post initialization, the operation of the GIMMICK malware is highly asynchronous. Prior variants of the malware written for Windows have managed this using thread pool techniques internal to the program, provided by Delphis System.Threading.TThreadPool and .NETs System.Thread and System.Action. The macOS variant, however, manages the protocol using Apple's Grand Central Dispatch (GCD) technology. This feature allows developers to distribute tasks to a system-managed pool of threads for later processing. These tasks are encapsulated into self-contained objects called blocks which are scheduled on dispatch queues for processing. The precise structures and implementation details of GCD are fairly complicated and beyond the scope of this document; several resources are provided in the Appendix.",
                        "During initialization, the sample decodes several pieces of data critical to the malware operation using a rotating addition algorithm.",
                        "Due to the asynchronous nature of the malware operation, command execution requires a staged approach. Though the individual steps occur asynchronously, every command follows the same steps:",
                        "There are three custom ObjectiveC classes in the malware that manage critical aspects of the C2 protocol: DriveManager, FileManager, and GCDTimerManager.",
                        "Volexity worked closely with Apple to add protections for the GIMMICK malware across their userbase. On March 17, 2022, Apple pushed new signatures to XProtect and MRT to block and remove GIMMICK. Though on by default, users can confirm they are automatically protected by verifying the \"Install system data files and security updates box is checked in their Settings (instructions can be found here).",
                        "Storm Cloud is an advanced and versatile threat actor, adapting its tool set to match different operating systems used by its targets. They make use of built-in operating system utilities, open-source tools, and custom malware implants to achieve their objectives. Leveraging cloud platforms for C2, such as using Google Drive, increases the likelihood of operating undetected by network monitoring solutions. This is especially true when coupled with the fact that the malware only beacons on victims' working days.",
                        "Outside of this data obfuscation, and the use of AES for certain external files, the malware makes little attempt to obfuscate its functionality or presence on the system.",
                        "Irrespective of platform, samples of the GIMMICK malware family are fairly large and complex, which is partly due to the complexity of their asynchronous design, such as the threading and locking mechanisms required. The work involved in porting this malware and adapting its systems to a new operating system (macOS) is no light undertaking and suggests the threat actor behind it is well resourced, adept, and versatile. It is worth noting that Volexity has only ever observed GIMMICK (macOS and Windows) in use by Storm Cloud. However, it is unknown if this malware implant is developed or otherwise used by them exclusively.",
                        "GIMMICK is used in targeted attacks by Storm Cloud, a Chinese espionage threat actor known to attack organizations across Asia. It is a feature-rich, multi-platform malware family that uses public cloud hosting services (such as Google Drive) for command-and-control (C2) channels. The newly identified macOS variant is written primarily in Objective C, with Windows versions written in both .NET and Delphi. Despite core differences in programming languages used and operating systems targeted, Volexity tracks the malware under the same name due to shared C2 architecture, file paths, and behavioral patterns used by all variants.",
                        "In addition, GCDTimerManager uses the static config information decoded during initialization to set a work period for the implant, limiting off-hour connections that might draw defender attention. It parses the work period from the string at the very start of the config data. This string starts with a set of single-digit numbers separated by hyphen characters, followed by two colon characters and two two-digit numbers separated again by a hyphen. The first set of numbers indicate the day number the malware will be active, with day 0 being Sunday. The second set of two-digit numbers indicate the range of active hours. Taking the initial value of 1-2-3-4-5::00-23, the implant will be active from 12AM to 11PM on weekdaysthis is the first data seen in the Configuration blob shown in Figure 4.",
                        "In late 2021, Volexity discovered an intrusion in an environment monitored as part of its Network Security Monitoring service. Volexity detected a system running frp, otherwise known as fast reverse proxy, and subsequently detected internal port scanning shortly afterward. This traffic was determined to be unauthorized and the system, a MacBook Pro running macOS 11.6 (Big Sur), was isolated for further forensic analysis. Volexity was able to run Surge Collect to acquire system memory (RAM) and select files of interest from the machine for analysis. This led to the discovery of a macOS variant of a malware implant Volexity calls GIMMICK. Volexity has encountered Windows versions of the malware family on several previous occasions.",
                        "Based on the way command files are enumerated by the malware, the Google Drive appears to be populated with a directory for each infected host. The name of this directory differs slightly by platform. Windows implants generate a unique GUID to operate as their ID, while the macOS implant uses Apple's own Hardware UUID for the task."
                    ],
                    "titles": [
                        "C2 Protocol",
                        "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS",
                        "Conclusion",
                        "Startup and Initialization",
                        "Appendix",
                        "Command Lifetime"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<FILE_0xa4660f54>",
                            "type": "File",
                            "value": "system.action"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0x6a35444b>",
                            "type": "Category",
                            "value": "proxy"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0xd1588496>",
                            "type": "File",
                            "value": "system.thread"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<SHA1_0x75aa70e8>",
                            "type": "Hash",
                            "hash_type": "SHA1",
                            "value": "fe3a3e65b86d2b07654f9a6104c8cb392c88b7e8"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0x35716857>",
                            "type": "File",
                            "value": "system.threading.tthreadpool"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0x6c08516a>",
                            "type": "Geo",
                            "value": "chinese"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0xa7d71219>",
                            "type": "Geo",
                            "value": "asia"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    }
                ]
            },
            {
                "token": {
                    "id": "<CATEGORY_0x6a35444b>",
                    "type": "Category",
                    "value": "proxy"
                },
                "references": {
                    "sentences": [
                        "Manage the Google Drive and proxy sessions.<crlf>Maintain a local map of the Google Drive directory hierarchy in memory.<crlf>Manage locks for synchronizing tasks on the Google Drive session.<crlf>Handle download and upload tasks to and from the Google Drive session.",
                        "In late 2021, Volexity discovered an intrusion in an environment monitored as part of its Network Security Monitoring service. Volexity detected a system running frp, otherwise known as fast reverse proxy, and subsequently detected internal port scanning shortly afterward. This traffic was determined to be unauthorized and the system, a MacBook Pro running macOS 11.6 (Big Sur), was isolated for further forensic analysis. Volexity was able to run Surge Collect to acquire system memory (RAM) and select files of interest from the machine for analysis. This led to the discovery of a macOS variant of a malware implant Volexity calls GIMMICK. Volexity has encountered Windows versions of the malware family on several previous occasions.",
                        "Regularly audit and monitor persistence locations, such as LaunchAgents and LaunchDaemons on endpoint macOS devices. This can be done through an EDR solution and/or with free tools such as BlockBlock and KnockKnock.<crlf>Monitor network traffic for anomalous proxy activity and internal scanning.<crlf>Ensure that XProtect and MRT from Apple are enabled and running on macOS systems."
                    ],
                    "titles": [
                        "Conclusion",
                        "C2 Protocol",
                        "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<CATEGORY_0x6a35444b>",
                            "type": "Category",
                            "value": "proxy"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<CATEGORY_0x6a35444b>",
                            "type": "Category",
                            "value": "proxy"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    }
                ]
            },
            {
                "token": {
                    "id": "<CATEGORY_0xc8ecca29>",
                    "type": "Category",
                    "value": "c2"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<CATEGORY_0xb68aa214>",
                    "type": "Category",
                    "value": "rat"
                },
                "references": {
                    "sentences": [
                        "On macOS, GIMMICK was found to support being launched as a daemon on the system or by a user. Should GIMMICK be launched directly by a user, rather than a daemon, it will install itself as a launch agent by dropping a PLIST file with contents, similar to that shown below, to /Users/<username>/Library/LaunchAgents. The name of the binary, PLIST, and agent will vary per sample. In the case observed by Volexity, the implant was customized to imitate an application commonly launched by the targeted user. It is worth noting that the Windows versions of GIMMICK Volexity has observed have no concept of setting their own persistence."
                    ],
                    "titles": [
                        "Startup and Initialization",
                        "Commands and Feedback"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<CATEGORY_0xb68aa214>",
                            "type": "Category",
                            "value": "rat"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    }
                ]
            }
        ],
        "Geo": [
            {
                "token": {
                    "id": "<GEO_0x6c08516a>",
                    "type": "Geo",
                    "value": "chinese"
                },
                "references": {
                    "sentences": [
                        "GIMMICK is used in targeted attacks by Storm Cloud, a Chinese espionage threat actor known to attack organizations across Asia. It is a feature-rich, multi-platform malware family that uses public cloud hosting services (such as Google Drive) for command-and-control (C2) channels. The newly identified macOS variant is written primarily in Objective C, with Windows versions written in both .NET and Delphi. Despite core differences in programming languages used and operating systems targeted, Volexity tracks the malware under the same name due to shared C2 architecture, file paths, and behavioral patterns used by all variants."
                    ],
                    "titles": [
                        "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<GEO_0x6c08516a>",
                            "type": "Geo",
                            "value": "chinese"
                        },
                        "relation": "use_geo",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0x6c08516a>",
                            "type": "Geo",
                            "value": "chinese"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0x6c08516a>",
                            "type": "Geo",
                            "value": "chinese"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    }
                ]
            },
            {
                "token": {
                    "id": "<GEO_0xa7d71219>",
                    "type": "Geo",
                    "value": "asia"
                },
                "references": {
                    "sentences": [
                        "GIMMICK is used in targeted attacks by Storm Cloud, a Chinese espionage threat actor known to attack organizations across Asia. It is a feature-rich, multi-platform malware family that uses public cloud hosting services (such as Google Drive) for command-and-control (C2) channels. The newly identified macOS variant is written primarily in Objective C, with Windows versions written in both .NET and Delphi. Despite core differences in programming languages used and operating systems targeted, Volexity tracks the malware under the same name due to shared C2 architecture, file paths, and behavioral patterns used by all variants."
                    ],
                    "titles": [
                        "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<GEO_0xa7d71219>",
                            "type": "Geo",
                            "value": "asia"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0xa7d71219>",
                            "type": "Geo",
                            "value": "asia"
                        },
                        "relation": "use_geo",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<GEO_0xa7d71219>",
                            "type": "Geo",
                            "value": "asia"
                        },
                        "relation": "related",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    }
                ]
            }
        ]
    },
    "iocs": {
        "Hash": [
            {
                "token": {
                    "id": "<SHA1_0x75aa70e8>",
                    "type": "Hash",
                    "hash_type": "SHA1",
                    "value": "fe3a3e65b86d2b07654f9a6104c8cb392c88b7e8"
                },
                "references": {
                    "sentences": [
                        "The SHA1 hash of the file Volexity was able to obtain from disk was fe3a3e65b86d2b07654f9a6104c8cb392c88b7e8."
                    ],
                    "titles": [
                        "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<SHA1_0x75aa70e8>",
                            "type": "Hash",
                            "hash_type": "SHA1",
                            "value": "fe3a3e65b86d2b07654f9a6104c8cb392c88b7e8"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<SHA1_0x75aa70e8>",
                            "type": "Hash",
                            "hash_type": "SHA1",
                            "value": "fe3a3e65b86d2b07654f9a6104c8cb392c88b7e8"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    }
                ]
            },
            {
                "token": {
                    "id": "<MD5_0xa462e4a1>",
                    "type": "Hash",
                    "hash_type": "MD5",
                    "value": "943c3743f72f06e58e60fa147481db83"
                },
                "references": {
                    "sentences": [
                        "The second loop decodes the 32-byte string 943c3743f72f06e58e60fa147481db83. This string is run through an additional conversion stage that converts two characters at a time into a numeric representation and writes the resulting byte to a buffer. This buffer is used as an AES key in several calls to CCCrypt() function."
                    ],
                    "titles": [
                        "Startup and Initialization"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<MD5_0xa462e4a1>",
                            "type": "Hash",
                            "hash_type": "MD5",
                            "value": "943c3743f72f06e58e60fa147481db83"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    }
                ]
            }
        ],
        "File": [
            {
                "token": {
                    "id": "<FILE_0x35716857>",
                    "type": "File",
                    "value": "system.threading.tthreadpool"
                },
                "references": {
                    "sentences": [
                        "Post initialization, the operation of the GIMMICK malware is highly asynchronous. Prior variants of the malware written for Windows have managed this using thread pool techniques internal to the program, provided by Delphis System.Threading.TThreadPool and .NETs System.Thread and System.Action. The macOS variant, however, manages the protocol using Apple's Grand Central Dispatch (GCD) technology. This feature allows developers to distribute tasks to a system-managed pool of threads for later processing. These tasks are encapsulated into self-contained objects called blocks which are scheduled on dispatch queues for processing. The precise structures and implementation details of GCD are fairly complicated and beyond the scope of this document; several resources are provided in the Appendix."
                    ],
                    "titles": [
                        "C2 Protocol"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<FILE_0x35716857>",
                            "type": "File",
                            "value": "system.threading.tthreadpool"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0x35716857>",
                            "type": "File",
                            "value": "system.threading.tthreadpool"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    }
                ]
            },
            {
                "token": {
                    "id": "<FILE_0xd1588496>",
                    "type": "File",
                    "value": "system.thread"
                },
                "references": {
                    "sentences": [
                        "Post initialization, the operation of the GIMMICK malware is highly asynchronous. Prior variants of the malware written for Windows have managed this using thread pool techniques internal to the program, provided by Delphis System.Threading.TThreadPool and .NETs System.Thread and System.Action. The macOS variant, however, manages the protocol using Apple's Grand Central Dispatch (GCD) technology. This feature allows developers to distribute tasks to a system-managed pool of threads for later processing. These tasks are encapsulated into self-contained objects called blocks which are scheduled on dispatch queues for processing. The precise structures and implementation details of GCD are fairly complicated and beyond the scope of this document; several resources are provided in the Appendix."
                    ],
                    "titles": [
                        "C2 Protocol"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<FILE_0xd1588496>",
                            "type": "File",
                            "value": "system.thread"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0xd1588496>",
                            "type": "File",
                            "value": "system.thread"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    }
                ]
            },
            {
                "token": {
                    "id": "<FILE_0xa4660f54>",
                    "type": "File",
                    "value": "system.action"
                },
                "references": {
                    "sentences": [
                        "Post initialization, the operation of the GIMMICK malware is highly asynchronous. Prior variants of the malware written for Windows have managed this using thread pool techniques internal to the program, provided by Delphis System.Threading.TThreadPool and .NETs System.Thread and System.Action. The macOS variant, however, manages the protocol using Apple's Grand Central Dispatch (GCD) technology. This feature allows developers to distribute tasks to a system-managed pool of threads for later processing. These tasks are encapsulated into self-contained objects called blocks which are scheduled on dispatch queues for processing. The precise structures and implementation details of GCD are fairly complicated and beyond the scope of this document; several resources are provided in the Appendix."
                    ],
                    "titles": [
                        "C2 Protocol"
                    ]
                },
                "links": [
                    {
                        "src": {
                            "id": "<FILE_0xa4660f54>",
                            "type": "File",
                            "value": "system.action"
                        },
                        "relation": "has_category",
                        "dst": {
                            "id": "<CATEGORY_0xf1a480bb>",
                            "type": "Category",
                            "value": "malware"
                        }
                    },
                    {
                        "src": {
                            "id": "<FILE_0xa4660f54>",
                            "type": "File",
                            "value": "system.action"
                        },
                        "relation": "use_threat",
                        "dst": {
                            "id": "<THREAT_0x3b3279ab>",
                            "type": "Threat",
                            "value": "gimmick"
                        }
                    }
                ]
            }
        ]
    },
    "unknownwords": {
        "UnknownWord": [
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x5798489b>",
                    "type": "UnknownWord",
                    "value": "macos"
                },
                "references": {
                    "sentences": [
                        "In late 2021, Volexity discovered an intrusion in an environment monitored as part of its Network Security Monitoring service. Volexity detected a system running frp, otherwise known as fast reverse proxy, and subsequently detected internal port scanning shortly afterward. This traffic was determined to be unauthorized and the system, a MacBook Pro running macOS 11.6 (Big Sur), was isolated for further forensic analysis. Volexity was able to run Surge Collect to acquire system memory (RAM) and select files of interest from the machine for analysis. This led to the discovery of a macOS variant of a malware implant Volexity calls GIMMICK. Volexity has encountered Windows versions of the malware family on several previous occasions.",
                        "Post initialization, the operation of the GIMMICK malware is highly asynchronous. Prior variants of the malware written for Windows have managed this using thread pool techniques internal to the program, provided by Delphis System.Threading.TThreadPool and .NETs System.Thread and System.Action. The macOS variant, however, manages the protocol using Apple's Grand Central Dispatch (GCD) technology. This feature allows developers to distribute tasks to a system-managed pool of threads for later processing. These tasks are encapsulated into self-contained objects called blocks which are scheduled on dispatch queues for processing. The precise structures and implementation details of GCD are fairly complicated and beyond the scope of this document; several resources are provided in the Appendix.",
                        "Regularly audit and monitor persistence locations, such as LaunchAgents and LaunchDaemons on endpoint macOS devices. This can be done through an EDR solution and/or with free tools such as BlockBlock and KnockKnock.<crlf>Monitor network traffic for anomalous proxy activity and internal scanning.<crlf>Ensure that XProtect and MRT from Apple are enabled and running on macOS systems.",
                        "FileManager manages a local directory hierarchy containing C2 information and command tasks in various stages of completion. Older variants of GIMMICK used slightly different names for directories, but they have remained consistent across several recent variants. The macOS implant stores this hierarchy in the root directory of the applications main bundle in a directory named MGD. Each folder within the directory structure is designated for holding a single type of file as it moves through the C2 process. A summary all directories and their purpose are given in the table below.",
                        "Irrespective of platform, samples of the GIMMICK malware family are fairly large and complex, which is partly due to the complexity of their asynchronous design, such as the threading and locking mechanisms required. The work involved in porting this malware and adapting its systems to a new operating system (macOS) is no light undertaking and suggests the threat actor behind it is well resourced, adept, and versatile. It is worth noting that Volexity has only ever observed GIMMICK (macOS and Windows) in use by Storm Cloud. However, it is unknown if this malware implant is developed or otherwise used by them exclusively.",
                        "On macOS, GIMMICK was found to support being launched as a daemon on the system or by a user. Should GIMMICK be launched directly by a user, rather than a daemon, it will install itself as a launch agent by dropping a PLIST file with contents, similar to that shown below, to /Users/<username>/Library/LaunchAgents. The name of the binary, PLIST, and agent will vary per sample. In the case observed by Volexity, the implant was customized to imitate an application commonly launched by the targeted user. It is worth noting that the Windows versions of GIMMICK Volexity has observed have no concept of setting their own persistence.",
                        "GIMMICK is used in targeted attacks by Storm Cloud, a Chinese espionage threat actor known to attack organizations across Asia. It is a feature-rich, multi-platform malware family that uses public cloud hosting services (such as Google Drive) for command-and-control (C2) channels. The newly identified macOS variant is written primarily in Objective C, with Windows versions written in both .NET and Delphi. Despite core differences in programming languages used and operating systems targeted, Volexity tracks the malware under the same name due to shared C2 architecture, file paths, and behavioral patterns used by all variants.",
                        "This blog post provides an in-depth analysis of the macOS variant of GIMMICK, but also demonstrates the features and characteristics of the Windows variant. Volexity discovered this sample through memory analysis of the compromised system and was able to recover the implant from both memory and disk. The file name and install path were unique to the victim system and had been configured in a manner designed to blend in with job functions of the user. Additionally, GIMMICK was configured to only communicate with its Google Drive-based C2 server on working days in order to further blend in with network traffic in the target environment."
                    ],
                    "titles": [
                        "Storm Cloud on the Horizon: GIMMICK Malware Strikes at macOS"
                    ]
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xeadbb356>",
                    "type": "UnknownWord",
                    "value": "<username>"
                },
                "references": {
                    "sentences": [
                        "On macOS, GIMMICK was found to support being launched as a daemon on the system or by a user. Should GIMMICK be launched directly by a user, rather than a daemon, it will install itself as a launch agent by dropping a PLIST file with contents, similar to that shown below, to /Users/<username>/Library/LaunchAgents. The name of the binary, PLIST, and agent will vary per sample. In the case observed by Volexity, the implant was customized to imitate an application commonly launched by the targeted user. It is worth noting that the Windows versions of GIMMICK Volexity has observed have no concept of setting their own persistence."
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x2f9fc753>",
                    "type": "UnknownWord",
                    "value": "<"
                },
                "references": {
                    "sentences": [
                        "</dict>",
                        "<string>/Users/#####/Library/Preferences/[pathto/binary]>/</string>",
                        "<?xml version=\"1.0\" encoding=\"UTF-8\"?>",
                        "</plist>",
                        "</array>",
                        "<!DOCTYPE plist PUBLIC \"-//Apple//DTD PLIST 1.0//EN\" \"http://www.apple.com/DTDs/PropertyList-1.0.dtd\">"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x688d632c>",
                    "type": "UnknownWord",
                    "value": ">"
                },
                "references": {
                    "sentences": [
                        "<true/>",
                        "<string>/Users/#####/Library/Preferences/[pathto/binary]>/</string>",
                        "<?xml version=\"1.0\" encoding=\"UTF-8\"?>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x976eab82>",
                    "type": "UnknownWord",
                    "value": "<plist"
                },
                "references": {
                    "sentences": [
                        "<plist version=\"1.0\">"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x14b9cbbc>",
                    "type": "UnknownWord",
                    "value": "<dict>"
                },
                "references": {
                    "sentences": [
                        "<dict>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x9a3b63f9>",
                    "type": "UnknownWord",
                    "value": "<key>label<"
                },
                "references": {
                    "sentences": [
                        "<key>Label</key>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xcb8e04c4>",
                    "type": "UnknownWord",
                    "value": "key>"
                },
                "references": {
                    "sentences": [
                        "<key>StartInterval</key>",
                        "<key>Label</key>",
                        "<key>ThrottleInterval</key>",
                        "<key>RunAtLoad</key>",
                        "<key>ProgramArguments</key>",
                        "<key>WorkingDirectory</key>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x2b0609d7>",
                    "type": "UnknownWord",
                    "value": "<string>com"
                },
                "references": {
                    "sentences": [
                        "<string>com. /[applicationname].va.plist</string>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x3565bd0a>",
                    "type": "UnknownWord",
                    "value": "applicationname"
                },
                "references": {
                    "sentences": [
                        "<string>com. /[applicationname].va.plist</string>",
                        "<string>/Users/<removed>/Library/Preferences/[applicationname]string>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x81aa2a68>",
                    "type": "UnknownWord",
                    "value": "plist<"
                },
                "references": {
                    "sentences": [
                        "<string>com. /[applicationname].va.plist</string>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xda07c987>",
                    "type": "UnknownWord",
                    "value": "string>"
                },
                "references": {
                    "sentences": [
                        "<string>com. /[applicationname].va.plist</string>",
                        "<string>/Users/#####/Library/Preferences/[pathto/binary]>/</string>",
                        "<string>/Users/<removed>/Library/Preferences/[applicationname]string>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x41d656e7>",
                    "type": "UnknownWord",
                    "value": "<key>programarguments<"
                },
                "references": {
                    "sentences": [
                        "<key>ProgramArguments</key>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x36440047>",
                    "type": "UnknownWord",
                    "value": "<array>"
                },
                "references": {
                    "sentences": [
                        "<array>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xd500a2d7>",
                    "type": "UnknownWord",
                    "value": "<string>"
                },
                "references": {
                    "sentences": [
                        "<string>/Users/#####/Library/Preferences/[pathto/binary]>/</string>",
                        "<string>/Users/<removed>/Library/Preferences/[applicationname]string>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x260a64c9>",
                    "type": "UnknownWord",
                    "value": "array>"
                },
                "references": {
                    "sentences": [
                        "</array>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x824d02>",
                    "type": "UnknownWord",
                    "value": "<key>runatload<"
                },
                "references": {
                    "sentences": [
                        "<key>RunAtLoad</key>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xce44709>",
                    "type": "UnknownWord",
                    "value": "<true"
                },
                "references": {
                    "sentences": [
                        "<true/>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x3d33a633>",
                    "type": "UnknownWord",
                    "value": "<key>startinterval<"
                },
                "references": {
                    "sentences": [
                        "<key>StartInterval</key>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x3135621d>",
                    "type": "UnknownWord",
                    "value": "<integer>30<"
                },
                "references": {
                    "sentences": [
                        "<integer>30</integer>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xb2e568f9>",
                    "type": "UnknownWord",
                    "value": "integer>"
                },
                "references": {
                    "sentences": [
                        "<integer>30</integer>",
                        "<integer>2</integer>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x4adfa87d>",
                    "type": "UnknownWord",
                    "value": "<key>throttleinterval<"
                },
                "references": {
                    "sentences": [
                        "<key>ThrottleInterval</key>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x77cf87d3>",
                    "type": "UnknownWord",
                    "value": "<integer>2<"
                },
                "references": {
                    "sentences": [
                        "<integer>2</integer>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xa00a183>",
                    "type": "UnknownWord",
                    "value": "<key>workingdirectory<"
                },
                "references": {
                    "sentences": [
                        "<key>WorkingDirectory</key>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x41152eb9>",
                    "type": "UnknownWord",
                    "value": "<removed>"
                },
                "references": {
                    "sentences": [
                        "<string>/Users/<removed>/Library/Preferences/[applicationname]string>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xcad85f29>",
                    "type": "UnknownWord",
                    "value": "dict>"
                },
                "references": {
                    "sentences": [
                        "</dict>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x8e02efa3>",
                    "type": "UnknownWord",
                    "value": "plist>"
                },
                "references": {
                    "sentences": [
                        "</plist>"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xa1b73b09>",
                    "type": "UnknownWord",
                    "value": "200-byte"
                },
                "references": {
                    "sentences": [
                        "The final decode is done in place and its result is a 200-byte binary blob of configuration data, with only a few seemingly visible data boundaries."
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xc262e766>",
                    "type": "UnknownWord",
                    "value": "objectivec"
                },
                "references": {
                    "sentences": [
                        "There are three custom ObjectiveC classes in the malware that manage critical aspects of the C2 protocol: DriveManager, FileManager, and GCDTimerManager."
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x2986eb8d>",
                    "type": "UnknownWord",
                    "value": "gcdtimermanager"
                },
                "references": {
                    "sentences": [
                        "In addition, GCDTimerManager uses the static config information decoded during initialization to set a work period for the implant, limiting off-hour connections that might draw defender attention. It parses the work period from the string at the very start of the config data. This string starts with a set of single-digit numbers separated by hyphen characters, followed by two colon characters and two two-digit numbers separated again by a hyphen. The first set of numbers indicate the day number the malware will be active, with day 0 being Sunday. The second set of two-digit numbers indicate the range of active hours. Taking the initial value of 1-2-3-4-5::00-23, the implant will be active from 12AM to 11PM on weekdaysthis is the first data seen in the Configuration blob shown in Figure 4.",
                        "There are three custom ObjectiveC classes in the malware that manage critical aspects of the C2 protocol: DriveManager, FileManager, and GCDTimerManager.",
                        "GCDTimerManager manages the various GCD objects that ensure the regular dispatching of work for the implant and holds collections of the dispatch timers along with their corresponding blocks. The malware creates several named dispatch queues for managing specific C2-related tasks:"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x103ff33>",
                    "type": "UnknownWord",
                    "value": "aes-"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xc7e6d04d>",
                    "type": "UnknownWord",
                    "value": "sendbaseinfoqueue"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x5bfc057>",
                    "type": "UnknownWord",
                    "value": "list_request_queue"
                },
                "references": {
                    "sentences": [
                        "An encrypted payload is uploaded by the attacker to the Google Drive.<crlf>The dispatch timer on list_request_queue triggers. New request file to be written to the \"l\" directory<crlf>The dispatch timer on te fileListQueue triggers. Reads the list request from the \"l\" directory Updates the DriveManager state from the Google Drive session Drops a listing file to the \"ls\" directory<crlf>The dispatch timer on ls_cmd_queue triggers. Parses the listing files from the \"ls\" directory Drops download command files for each remote file in the \"d\" directory Deletes listing files from the \"ls\" directory<crlf>The dispatch timer on DriveDownloadQueue triggers. Enumerates the files in the \"d\" directory Queues the download of command files to the \"ds\" directory Queues deletion of remote Google Drive file and local download command file after download is complete<crlf>The dispatch timer on ReadCmdQueue triggers. Reads and decrypts command files from \"ds\" directory Handles command execution Deletes local command file Writes encrypted feedback files to \"u\" directory<crlf>The dispatch timer on DriveUploadQueue triggers. Enumerates the files in the \"u\" directory Queues the upload of the result files Queues the deletion of local result files once upload is completed"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x14d31da0>",
                    "type": "UnknownWord",
                    "value": "<hardwareuuid>"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x65cef2b4>",
                    "type": "UnknownWord",
                    "value": "ls_cmd_queue"
                },
                "references": {
                    "sentences": [
                        "An encrypted payload is uploaded by the attacker to the Google Drive.<crlf>The dispatch timer on list_request_queue triggers. New request file to be written to the \"l\" directory<crlf>The dispatch timer on te fileListQueue triggers. Reads the list request from the \"l\" directory Updates the DriveManager state from the Google Drive session Drops a listing file to the \"ls\" directory<crlf>The dispatch timer on ls_cmd_queue triggers. Parses the listing files from the \"ls\" directory Drops download command files for each remote file in the \"d\" directory Deletes listing files from the \"ls\" directory<crlf>The dispatch timer on DriveDownloadQueue triggers. Enumerates the files in the \"d\" directory Queues the download of command files to the \"ds\" directory Queues deletion of remote Google Drive file and local download command file after download is complete<crlf>The dispatch timer on ReadCmdQueue triggers. Reads and decrypts command files from \"ds\" directory Handles command execution Deletes local command file Writes encrypted feedback files to \"u\" directory<crlf>The dispatch timer on DriveUploadQueue triggers. Enumerates the files in the \"u\" directory Queues the upload of the result files Queues the deletion of local result files once upload is completed"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x2797f07a>",
                    "type": "UnknownWord",
                    "value": "readcmdqueue"
                },
                "references": {
                    "sentences": [
                        "An encrypted payload is uploaded by the attacker to the Google Drive.<crlf>The dispatch timer on list_request_queue triggers. New request file to be written to the \"l\" directory<crlf>The dispatch timer on te fileListQueue triggers. Reads the list request from the \"l\" directory Updates the DriveManager state from the Google Drive session Drops a listing file to the \"ls\" directory<crlf>The dispatch timer on ls_cmd_queue triggers. Parses the listing files from the \"ls\" directory Drops download command files for each remote file in the \"d\" directory Deletes listing files from the \"ls\" directory<crlf>The dispatch timer on DriveDownloadQueue triggers. Enumerates the files in the \"d\" directory Queues the download of command files to the \"ds\" directory Queues deletion of remote Google Drive file and local download command file after download is complete<crlf>The dispatch timer on ReadCmdQueue triggers. Reads and decrypts command files from \"ds\" directory Handles command execution Deletes local command file Writes encrypted feedback files to \"u\" directory<crlf>The dispatch timer on DriveUploadQueue triggers. Enumerates the files in the \"u\" directory Queues the upload of the result files Queues the deletion of local result files once upload is completed"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xbfbb3489>",
                    "type": "UnknownWord",
                    "value": "credscheck"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xb53a5d1a>",
                    "type": "UnknownWord",
                    "value": "drivecleartrashqueue"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xf0e78f1b>",
                    "type": "UnknownWord",
                    "value": "drivedownqueue"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xc717a909>",
                    "type": "UnknownWord",
                    "value": "driveuploadqueue"
                },
                "references": {
                    "sentences": [
                        "An encrypted payload is uploaded by the attacker to the Google Drive.<crlf>The dispatch timer on list_request_queue triggers. New request file to be written to the \"l\" directory<crlf>The dispatch timer on te fileListQueue triggers. Reads the list request from the \"l\" directory Updates the DriveManager state from the Google Drive session Drops a listing file to the \"ls\" directory<crlf>The dispatch timer on ls_cmd_queue triggers. Parses the listing files from the \"ls\" directory Drops download command files for each remote file in the \"d\" directory Deletes listing files from the \"ls\" directory<crlf>The dispatch timer on DriveDownloadQueue triggers. Enumerates the files in the \"d\" directory Queues the download of command files to the \"ds\" directory Queues deletion of remote Google Drive file and local download command file after download is complete<crlf>The dispatch timer on ReadCmdQueue triggers. Reads and decrypts command files from \"ds\" directory Handles command execution Deletes local command file Writes encrypted feedback files to \"u\" directory<crlf>The dispatch timer on DriveUploadQueue triggers. Enumerates the files in the \"u\" directory Queues the upload of the result files Queues the deletion of local result files once upload is completed"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x950f52d0>",
                    "type": "UnknownWord",
                    "value": "drivefailuploadqueue"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x1c93063a>",
                    "type": "UnknownWord",
                    "value": "filelistqueue"
                },
                "references": {
                    "sentences": [
                        "An encrypted payload is uploaded by the attacker to the Google Drive.<crlf>The dispatch timer on list_request_queue triggers. New request file to be written to the \"l\" directory<crlf>The dispatch timer on te fileListQueue triggers. Reads the list request from the \"l\" directory Updates the DriveManager state from the Google Drive session Drops a listing file to the \"ls\" directory<crlf>The dispatch timer on ls_cmd_queue triggers. Parses the listing files from the \"ls\" directory Drops download command files for each remote file in the \"d\" directory Deletes listing files from the \"ls\" directory<crlf>The dispatch timer on DriveDownloadQueue triggers. Enumerates the files in the \"d\" directory Queues the download of command files to the \"ds\" directory Queues deletion of remote Google Drive file and local download command file after download is complete<crlf>The dispatch timer on ReadCmdQueue triggers. Reads and decrypts command files from \"ds\" directory Handles command execution Deletes local command file Writes encrypted feedback files to \"u\" directory<crlf>The dispatch timer on DriveUploadQueue triggers. Enumerates the files in the \"u\" directory Queues the upload of the result files Queues the deletion of local result files once upload is completed"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x1f31027>",
                    "type": "UnknownWord",
                    "value": "drivedownloadqueue"
                },
                "references": {
                    "sentences": [
                        "An encrypted payload is uploaded by the attacker to the Google Drive.<crlf>The dispatch timer on list_request_queue triggers. New request file to be written to the \"l\" directory<crlf>The dispatch timer on te fileListQueue triggers. Reads the list request from the \"l\" directory Updates the DriveManager state from the Google Drive session Drops a listing file to the \"ls\" directory<crlf>The dispatch timer on ls_cmd_queue triggers. Parses the listing files from the \"ls\" directory Drops download command files for each remote file in the \"d\" directory Deletes listing files from the \"ls\" directory<crlf>The dispatch timer on DriveDownloadQueue triggers. Enumerates the files in the \"d\" directory Queues the download of command files to the \"ds\" directory Queues deletion of remote Google Drive file and local download command file after download is complete<crlf>The dispatch timer on ReadCmdQueue triggers. Reads and decrypts command files from \"ds\" directory Handles command execution Deletes local command file Writes encrypted feedback files to \"u\" directory<crlf>The dispatch timer on DriveUploadQueue triggers. Enumerates the files in the \"u\" directory Queues the upload of the result files Queues the deletion of local result files once upload is completed"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x84699624>",
                    "type": "UnknownWord",
                    "value": "savepath"
                },
                "references": {
                    "sentences": [],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x6718d7e2>",
                    "type": "UnknownWord",
                    "value": "launchdaemons"
                },
                "references": {
                    "sentences": [
                        "Regularly audit and monitor persistence locations, such as LaunchAgents and LaunchDaemons on endpoint macOS devices. This can be done through an EDR solution and/or with free tools such as BlockBlock and KnockKnock.<crlf>Monitor network traffic for anomalous proxy activity and internal scanning.<crlf>Ensure that XProtect and MRT from Apple are enabled and running on macOS systems."
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x68e4135f>",
                    "type": "UnknownWord",
                    "value": "blockblock"
                },
                "references": {
                    "sentences": [
                        "Regularly audit and monitor persistence locations, such as LaunchAgents and LaunchDaemons on endpoint macOS devices. This can be done through an EDR solution and/or with free tools such as BlockBlock and KnockKnock.<crlf>Monitor network traffic for anomalous proxy activity and internal scanning.<crlf>Ensure that XProtect and MRT from Apple are enabled and running on macOS systems."
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x636b10c0>",
                    "type": "UnknownWord",
                    "value": "knockknock"
                },
                "references": {
                    "sentences": [
                        "Regularly audit and monitor persistence locations, such as LaunchAgents and LaunchDaemons on endpoint macOS devices. This can be done through an EDR solution and/or with free tools such as BlockBlock and KnockKnock.<crlf>Monitor network traffic for anomalous proxy activity and internal scanning.<crlf>Ensure that XProtect and MRT from Apple are enabled and running on macOS systems."
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0xb9a1320d>",
                    "type": "UnknownWord",
                    "value": "->"
                },
                "references": {
                    "sentences": [
                        "https://www.amazon.com/dp/099105556X/ref=cm_sw_em_r_mt_dp_RYJ6VS3327WSY7SE551Y?_encoding=UTF8&psc=1 -> ISDN-13: 978-0991055562<crlf>https://www.amazon.com/dp/0321706250/ref=cm_sw_em_r_mt_dp_7J0VBS0DW5NWAZAFT5ZF -> ISDN-13: 978-0321706256<crlf>https://www.galloway.me.uk/2012/10/a-look-inside-blocks-episode-1/<crlf>https://opensource.apple.com/source/libclosure/libclosure-67/BlockImplementation.txt.auto.html"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x7992b70d>",
                    "type": "UnknownWord",
                    "value": "isdn-13"
                },
                "references": {
                    "sentences": [
                        "https://www.amazon.com/dp/099105556X/ref=cm_sw_em_r_mt_dp_RYJ6VS3327WSY7SE551Y?_encoding=UTF8&psc=1 -> ISDN-13: 978-0991055562<crlf>https://www.amazon.com/dp/0321706250/ref=cm_sw_em_r_mt_dp_7J0VBS0DW5NWAZAFT5ZF -> ISDN-13: 978-0321706256<crlf>https://www.galloway.me.uk/2012/10/a-look-inside-blocks-episode-1/<crlf>https://opensource.apple.com/source/libclosure/libclosure-67/BlockImplementation.txt.auto.html"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x53008955>",
                    "type": "UnknownWord",
                    "value": "978-0991055562"
                },
                "references": {
                    "sentences": [
                        "https://www.amazon.com/dp/099105556X/ref=cm_sw_em_r_mt_dp_RYJ6VS3327WSY7SE551Y?_encoding=UTF8&psc=1 -> ISDN-13: 978-0991055562<crlf>https://www.amazon.com/dp/0321706250/ref=cm_sw_em_r_mt_dp_7J0VBS0DW5NWAZAFT5ZF -> ISDN-13: 978-0321706256<crlf>https://www.galloway.me.uk/2012/10/a-look-inside-blocks-episode-1/<crlf>https://opensource.apple.com/source/libclosure/libclosure-67/BlockImplementation.txt.auto.html"
                    ],
                    "titles": []
                }
            },
            {
                "token": {
                    "id": "<UNKNOWNWORD_0x4845f01f>",
                    "type": "UnknownWord",
                    "value": "978-0321706256"
                },
                "references": {
                    "sentences": [
                        "https://www.amazon.com/dp/099105556X/ref=cm_sw_em_r_mt_dp_RYJ6VS3327WSY7SE551Y?_encoding=UTF8&psc=1 -> ISDN-13: 978-0991055562<crlf>https://www.amazon.com/dp/0321706250/ref=cm_sw_em_r_mt_dp_7J0VBS0DW5NWAZAFT5ZF -> ISDN-13: 978-0321706256<crlf>https://www.galloway.me.uk/2012/10/a-look-inside-blocks-episode-1/<crlf>https://opensource.apple.com/source/libclosure/libclosure-67/BlockImplementation.txt.auto.html"
                    ],
                    "titles": []
                }
            }
        ]
    },
    "other_links": [],
    "info": {
        "potential_threats": {},
        "sigma": false,
        "yara": false
    },
    "keywords": {
        "classified": [],
        "dubbed": [],
        "associated": [],
        "targets": [
            "Storm Cloud is an advanced and versatile threat actor, adapting its tool set to match different operating systems used by its targets"
        ],
        "attributed": []
    },
    "resources": {
        "links": {
            "github": [
                "https://github.com/fatedier/frp",
                "https://github.com/volexity/threat-intel/blob/main/2022/2022-03-22%20GIMMICK/indicators/yara.yar",
                "https://github.com/volexity/threat-intel/tree/main/2022/2022-03-22%20GIMMICK/attachments"
            ],
            "pastebin": [],
            "other": [
                "https://www.volexity.com/products-overview/surge/",
                "https://www.volexity.com/blog/2020/03/31/storm-cloud-unleashed-tibetan-community-focus-of-highly-targeted-fake-flash-campaign/",
                "https://support.apple.com/guide/mac-help/get-macos-updates-mchlpx1065/mac",
                "https://developer.apple.com/library/archive/documentation/System/Conceptual/ManPages_iPhoneOS/man3/CCCrypt.3cc.html",
                "https://en.wikipedia.org/wiki/Grand_Central_Dispatch",
                "https://developer.apple.com/library/archive/documentation/Cocoa/Conceptual/ProgrammingWithObjectiveC/WorkingwithBlocks/WorkingwithBlocks.html",
                "https://developer.apple.com/library/archive/documentation/CoreFoundation/Conceptual/CFBundles/BundleTypes/BundleTypes.html",
                "https://objective-see.com/products/blockblock.html",
                "https://objective-see.com/products/knockknock.html",
                "https://www.amazon.com/dp/099105556X/ref=cm_sw_em_r_mt_dp_RYJ6VS3327WSY7SE551Y?_encoding=UTF8&psc=1",
                "https://www.amazon.com/dp/0321706250/ref=cm_sw_em_r_mt_dp_7J0VBS0DW5NWAZAFT5ZF",
                "https://www.galloway.me.uk/2012/10/a-look-inside-blocks-episode-1/",
                "https://opensource.apple.com/source/libclosure/libclosure-67/BlockImplementation.txt.auto.html",
                "https://www.volexity.com/blog/tag/apt/",
                "https://www.volexity.com/blog/tag/mac/",
                "https://www.volexity.com/blog/tag/malware/",
                "https://www.volexity.com/blog/tag/osx/",
                "https://www.volexity.com/blog/tag/storm-cloud/"
            ]
        },
        "images": [
            "https://www.volexity.com/wp-content/uploads/2022/03/Volexity_Storm-Cloud_GIMMICK.png",
            "https://www.volexity.com/wp-content/uploads/2022/03/Volexity_GIMMICK_workflow.png",
            "https://www.volexity.com/wp-content/uploads/2022/03/fig1.png",
            "https://www.volexity.com/wp-content/uploads/2022/03/fig2.png",
            "https://www.volexity.com/wp-content/uploads/2022/03/fig3-1024x387.png"
        ]
    }
}