[
    {
        "report": {
            "id": "report_0x6effe09d",
            "date": "20220413",
            "title": "[Caution] Virus/XLS Xanpei Infecting Normal Excel Files",
            "url": "https://asec.ahnlab.com/en/33630"
        },
        "chapter": {
            "id": "chapter_0xbeb61c6a",
            "title": "[Caution] Virus/XLS Xanpei Infecting Normal Excel Files",
            "text": "The ASEC analysis team has recently discovered the constant distribution of malware strains that spread the infection when Excel file is opened. Besides infecting normal Excel files, they can also perform additional malicious behaviors such as acting as a downloader and performing DNS Spoofing, therefore, users need to take great caution.\nThe common trait of the malware strains is to spread the virus through the VBA (Visual Basic for Applications) codes included in Excel files. Upon opening the infected Excel file, the file containing virus VBA code is dropped to Excel startup path. And when any Excel file is opened, the malicious file dropped in Excel startup path is automatically executed to infect with virus and perform additional malicious behaviors. After the infection, malicious behaviors such as Downloader or DNS Spoofing occurs depending on the malware type.\n[1] Downloader Type Malware\nMD5: f8886b0d734c5ddcccd2a0d57d383637\nAlias: Virus/X97M.Downloader\nThis Excel file is infected with virus, and as shown in the figure below, it has the VBA code defined for virus and additional malicious behaviors.\nFigure 1. Malicious VBA code inside the file\nThe malicious code inside the file performs malicious activities by calling the d2p procedure for spreading malware and the boosting procedure including the Downloader logic in the Workbook_Open() procedure that is automatically run when an event for viewing a workbook occurs.\nFigure 2. Workbook_Open of the malicious VBA code\nThe d2p procedure containing the logic for spreading virus creates an Excel file with the name boosting.xls to spread the infection in the Excel startup path (see Figure 3). When opening a random document, the malware dropped in the path %AppData%\\Microsoft\\Excel\\XLSTART\\boosting.xls is automatically executed and infects the Excel file that is currently being viewed, and performs malicious behaviors.\nigure 3. Code for spreading malware\nAs shown in Figure 4, the boosting.xls file spreads malware after a certain time has passed. When the infection spreads, the original code defined in the file is deleted. The code then defines codes for infection and additional malicious behaviors in the Workbook_Open procedure of the Excel file.\nFigure 4. Code for spreading virus\nDownloader-type malware downloads and runs Miner-related executables from the C2 after infection (see Figure 5).\nFigure 5. Downloader feature\nThe C2 URLs for downloading are as follows:\nhxxp://45.78.21.150/boost/boosting[.]exe\nhxxp://45.78.21.150/boost/config[.]txt\nAdditionally, Excel virus strains of this type scan for the existence of the %AppData%\\Microsoft\\Excel\\XLSTART\\boosting.xls file. If the file does not exist, they spread virus and perform additional malicious behaviors. This means that if a dummy file with a 0-byte size exists in the path, malicious behaviors can be prevented in advance.\n[2] DNS Spoofing Type Malware\nMD5: 97841a3bf7ffec57a2586552b05c0ec5\nAlias: Virus/MSExcel.Xanpei\nThis type also has a normal Excel file infected with virus with the VBA code for virus and additional malicious behaviors defined. Unlike the Downloader type that was mentioned earlier, this type has a different name for the malicious Excel file dropped at the Excel startup path (accerlate.xls). Also, instead of downloading files, it performs DNS Spoofing by changing the host file.\nFigure 6. DNS Spoofing feature\nThe DNS Spoofing C2 URL is as follows:\nhxxp://45.78.21.150\nAhnLab is detecting malicious document files and downloaded executables as shown below. Furthermore, AhnLab is using the ASD network to block the C2 URLs that malicious Excel file connects.\n[File Detection]\nVirus/XLS.Xanpei (2022.03.14.02)\nVirus/X97M.Downloader (2018.12.11.07)\nVirus/MSExcel.Xanpei (2022.03.14.03)\nTrojan/Win64.BitMiner (2017.11.13.03)\nSubscribe to AhnLabs next-generation threat intelligence platform AhnLab TIP to check related IOC and detailed analysis information.\nCategories:Malware Information\nTagged as:excel, Excel file, Excel Malware, malware, Virus"
        }
    },
    {
        "report": {
            "id": "report_0x6effe09d",
            "date": "20220413",
            "title": "[Caution] Virus/XLS Xanpei Infecting Normal Excel Files",
            "url": "https://asec.ahnlab.com/en/33630"
        },
        "chapter": {
            "id": "chapter_0x79ff9006",
            "title": "[Caution] Virus/XLS Xanpei Infecting Normal Excel Files",
            "text": "Posted on\nApril 13, 2022"
        }
    }
]