[
    {
        "report": {
            "id": "report_0x7f4a4ed1",
            "date": "20220322",
            "title": "APT Attack Being Distributed as Windows Help File (*.chm)",
            "url": "https://asec.ahnlab.com/en/32800"
        },
        "chapter": {
            "id": "chapter_0x89117fc0",
            "title": "APT Attack Being Distributed as Windows Help File (*.chm)",
            "text": "The ASEC analysis team has recently discovered the distribution of malware disguised as a Windows Help File (*.chm), specifically targeting Korean users. The CHM file is a compiled HTML Help file that is executed via the Microsoft HTML help executable program.\nThe recently discovered CHM file downloads additional malicious files when run. A window that contains ordinary content is shown during this process, tricking the user into thinking that the file may not be malicious.\nThe malware is compressed and distributed as an email attachment as shown in the figure below.\nFigure 1. Distributed email\nThe attached compressed file contains a Word file and a RAR file. Inside the RAR file, there exists the malicious file, Guide.chm.\nFigure 2. Compressed file\nFigure 3. .chm file that exists inside Latest Info (Guide).rar\nWord file is encrypted, preventing the user from knowing what is inside the file. It is assumed that the content is designed to prompt the user into running the CHM file inside the same compressed file.\nFigure 4. Word file\nUpon running Guide.chm, the following help appears. The content of this help is identical to the one found in https://mage.github.io/mage/.\nFigure 5. Created help\nInside the CHM file, there is a special command that exists inside the MAGE User Guide.html file. This command is automatically run via the shortcut.Click(); function.\nFigure 6. Code inside MAGE User Guide.html\nOnce the command is run, Document.dat and Document.vbs are created inside the %USERPROFILE%\\Links\\ folder. Document.dat contains Base64-encoded data, and the decoded data is saved into Document.vbs.\nFigure 7. Created script file\nAfterward, it adds to the path HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Document so that the VBS file can be continuously run.\nFigure 8. Created registry\nDocument.vbs contains a code that uses powershell to download an additional file as shown below. The downloaded file is saved into the %tmp% folder as advupdate.exe and is executed.\nCurrently, the file that is downloaded from the URL is an innocuous file, but users must remain cautious as malware with the same filename has been discovered.\nThe same kinds of malware so far discovered are as follows.\nName of Compressed FileName of Malicious CHM FileDocument for court submission.zipasset.chmContract paper.zipcontract.chmwages.zipwages.chmdocument.zipNodejs for Game Server Development.chmTable 1. Name of additionally found malicious files\nDocument for court submission.zip file, similar to files explained before, contains a document file and a RAR file.\nFigure 9. Additionally discovered malicious file 1-1\nThe CHM file is also disguised as an innocuous help file. The Excel file could also be opened and examined as it was not encrypted.\nFigure 10. Additionally discovered malicious file 1-2 (left: CHM file when run / right: Excel file when run)\nThe compressed file distributed under the filename Contract paper.zip contains two document files and a RAR compressed file (see figure below). Both of the Word files are encrypted, making it impossible to check whats inside them. The CHM file is disguised as an innocuous help file that contains certain details.\nFigure 11. Additionally discovered malicious file 2-1\nFigure 12. Additionally discovered malicious file 2-2 (Word file)\nFigure 13. Additionally discovered malicious file 2-3 (CHM file)\nWhen the additionally discovered .chm files are run, script files are dropped into the %USERPROFILE%\\Links\\ folder and add run key. Afterward, when script files are run, additional malicious files are downloaded, saved into the %tmp% folder as advupdate.exe, and executed.\nBelow are the discovered download URLs.\nFilenameDownload URLNodejs for Game Server Development.chmhxxps://nhn-games[.]com/game03953/gamelist.php?type=1wages.chmhxxps://sktelecom[.]help/download/select.php?type=1User Guide.chmhxxps://sktelecom[.]help/download/select.php type=1contract.chmhxxps://want-helper[.]com/database/db.php?type=1asset.chmhxxps://want-helper[.]com/database/db.php?type=1Table 2. Additional download URL\nRecently, malicious Windows help files (*.chm) distributed in the form of compressed files are continuously being found. Seeing that the names of compressed files and interface of help files are written in Korean, it appears that the attackers are targeting Korean users. Currently, clicking the download URL results in an innocuous executable being downloaded, making it not possible to check what exactly the ultimately downloaded malware does. However, as the attacker may upload various malware strains to the URL, users must always take caution.\nAhnLabs anti-malware product, V3, detects the malware using the alias below.\n[File Detection]\nTrojan/CHM.Agent\nDownloader/CHM.Agent\n[IOC]\n3ae6503e836b295955a828a76ce2efa7 (CHM)\nd26481e376134dc14966ccab39b91f16 (CHM)\n997165ed836b8a2a6af5cf2d43af5803 (CHM)\n5f1091df4c74412ef59426c1bb65f4d0 (CHM)\nae43f4d4c6123294b2f3ede294032944 (CHM)\nacc6263bd54de778c1e22373d73887ab (CHM)\nhxxps://encorpost[.]com/post/post.php?type=1\nhxxps://nhn-games[.]com/game03953/gamelist.php?type=1\nhxxps://sktelecom[.]help/download/select.php?type=1\nhxxps://want-helper[.]com/database/db.php?type=1\nSubscribe to AhnLabs next-generation threat intelligence platform AhnLab TIP to check related IOC and detailed analysis information.\nCategories:Malware Information\nTagged as:Help",
            "table": "Filename;Download URL\nNodejs for Game Server Development.chm;hxxps://nhn-games[.]com/game03953/gamelist.php?type=1\nwages.chm;hxxps://sktelecom[.]help/download/select.php?type=1\nUser Guide.chm;hxxps://sktelecom[.]help/download/select.php type=1\ncontract.chm;hxxps://want-helper[.]com/database/db.php?type=1\nasset.chm;hxxps://want-helper[.]com/database/db.php?type=1\n"
        }
    },
    {
        "report": {
            "id": "report_0x7f4a4ed1",
            "date": "20220322",
            "title": "APT Attack Being Distributed as Windows Help File (*.chm)",
            "url": "https://asec.ahnlab.com/en/32800"
        },
        "chapter": {
            "id": "chapter_0x88cc085a",
            "title": "APT Attack Being Distributed as Windows Help File (*.chm)",
            "text": "Posted on\nMarch 22, 2022"
        }
    }
]