[
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x3f22ec8",
            "title": "Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x76e50edd",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team",
            "text": "Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team"
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x7f38f671",
            "title": "Report Summary",
            "text": "In this report we would like to share the strong connection between two notorious Cyber Threat Actors called Conti and Karakurt. Both of them worked for the same end result and it is the ransom money. The Infinitum IT Cyber Threat Intelligence team successfully monitored one of the key members of Conti Ransomware group, at this stage we dont want to disclose the nickname of the group member but we will share details about how the connection between two cyber threat groups occurred, tactics and techniques used by Karakurt hacking team and details about internal infrastructure of Conti / Karakurt.\nInfinitum IT Cyber Threat Intelligence team able to obtain remote access on multiple servers, they are being actively used by members of threat actors as command and control server, storage server that have stolen private data from various victims and web server that is being used by Karakurt Hacking team as a blog page. Threat actors like Ransomware group used their web pages to share large numbers of exfiltrate data that are being stolen from victims, they are using data to threaten the victim companies to pay the ransom money.\nTimeline\nAll of the data in this report has been shared with the Government authorized, to help them in further investigation. The data from Command and Control Servers will be used for preventing future cyber attacks and help various organizations across the globe, in this report we shared TTP and IOC list that contains analyzed data that is coming from attackers internal servers. Our main goal is to help the victims of these attacks and prevent the feutre cyber attacks against various institutions and organizations."
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0xd77fc308",
            "title": "Information About Karakurt (Russian: ) Threat Actors",
            "text": "Karakurt is a well known threat actor group that has launched cyberattack against several Canadian and US organizations. On December 29, 2021, the Karakurt group claimed on its website that it had struck 11 organizations as part of its Winter Data Leak Digest. Of the 11, six were based in Canada. The group claimed to have compromised more than 40 victims between September and November 2021, sharing the stolen files on its name and shame blog website.\nKarakurt focuses exclusively on the Data Exfiltration, they are not using Ransomware to encrypt victims files. The group accomplishes this by first using VPN credentials to access victims networks, through phishing attacks against victims.\nBlog web page used by Karakurt team (karakurt[.]co)\nKarakurt had previously employed the Cobalt Strike remote access tool, but we also observed that it had since switched to using AnyDesk. Afterwards, the group steals additional credentials from administrators by using the password-stealing tool Mimikatz and Active Directory enumeration tool called ADfind. No ransomware is employed at any stage of the attacks, but the group uses the threat of leaking the stolen data for its ransom demands.\nWe also observed that attackers use Mega upload accounts to store large volumes of stolen data."
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x5e25e5ef",
            "title": "Tactic and Techniques Used by Karakurt Hacking Team",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x3a256696",
            "title": "MITRE ATT&CK Table",
            "text": "",
            "table": "0;1\nTactic;Technique\nInitial Access;T1133: External Remote Services  T1078: Valid Accounts\nExecution;T1059: Command and Scripting Interpreter  T1086: PowerShell  T1035: Service Execution\nPersistence;T1050: New Service\nDefense Evasion;T1078: Valid Accounts  T1036: Masquerading  T1027: Obfuscated Files or Information\nCredential Access;T1110: Brute Force  T1003: Credential Dumping  T1557.001: LLMNR/NBT-NS Poisoning and SMB Relay\nDiscovery;T1083: File and Directory Discovery  T1082: System Information Discovery  T1087: Account Discovery  T1135: Network Share Discovery  T1069: Permission Groups Discovery  T1018: Remote System Discovery  T1016: System Network Configuration Discovery\nLateral Movement;T1021.001: Remote Desktop Protocol  T1021.006: Windows Remote Management\nCollection;T1005: Data from Local System  T1039: Data from Network Shared Drive\nCommand & Control;T1436: Commonly Used Port  T1105: Remote File Copy  T1071: Standard Application Layer Protocol  T1572: Protocol Tunneling\nExfiltration;T1002: Data Compressed  T1048: Exfiltration Over Alternative Protocol\n"
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x90f66c50",
            "title": "Internal Infrastructure Used by Conti and Karakurt Group",
            "text": "At the beginning of Conti leak in February 27, 2022 we are able to get inside multiple Protonmail and Mega Upload accounts used by one of the key members of Conti Ransomware group, after further investigation we observed threat actors used multiple Protonmail accounts for OPSEC reason,we are able to archived the content of mail traffic and we observed multiple email coming from Russian VPS Service called Inferno solutions, we got remote access on one of the Windows VPS Server that being used data storage system. That has more than 20 TB+ of stolen victim data.\nProton mail account used by key member of Conti Ransomware group\nVPS Server Admin Panel"
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x81d2606b",
            "title": "Windows Data Storage Server Used by Conti Ransomware",
            "text": "Our first stage of analysis is this data storage server that is being used for storing large volumes of stolen data from victims. We can also observe that some of the data was old but not published publicly. We contact the victims to give their data back, on every Cyber Attacks we saw the usage of Mega Upload accounts to manage this overall 20TB+ data.\nDuring our investigation we observed that, Conti member used FileZilla to connect multiple remote servers, the main purpose is to upload the stolen data to another server for preparing the public release.\nWhen we take a closer look at the IP address 209[.]222[.]98[.]19 the DNS record shows us, it belongs to the karakurt[.]co blog page which it is being used for sharing the stolen files.During connection of remote server via FileZilla, Conti member dont save any Password credentials, but Infinitum IT Cyber Threat Intelligence team successfully obtained the SSH Credentials via a 0day vulnerability affected by FileZilla and used this credentials to get inside the Command and Control Server.Attacker also used a SSH Private key to connect karakurt[.]co blog page, we also managed to obtained the private key."
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x39b8d584",
            "title": "Command and Control Server",
            "text": "The Infinitum IT Cyber Threat Intelligence team is able to access the Command and Control Server that is being actively used by the Karakurt Hacking team on cyber attack operations. As a summary of the attack chain, we observed the use of open source tools like\nLigolo-ng : Getting Initial Access on companies network via Reverse Tunneling, this technique being used for bypassing miss configured Firewall systems.\nMetasploit : Karakurt used Metasploit as C2 server and in post exploitation phase details can be seen on Metasploit log file that was obtained and shared by the Infinitum IT Cyber Threat Intelligence team on IOC part.\nImpacket: After getting Initial Access on the victim company network, Karakurt hacking team use Impacket to perform NTLM relay attacks. This tool mainly used for Lateral Movement\nDanted: Fast script for installing & configuring DantedSocks5 Proxy Server. That being used for Reverse Tunneling.\nOn a misconfigured Firewall, Threat actors can abuse this issue and they are able to get Initial Access on remote networks by Reverse Proxy Tunneling technique.In this report we dont disclose the victim but we want to raise an evarinse on usage of such technique is not a sophisticated attack, there are plenty of Open Source tools used by cyber attackers and if your network doesnt prepared against such an attack you may became the target.\nLigolo Proxy Panel\nOn below image can showed us, after getting Initial Access on the victim network with reverse tunneling, attacker able to obtained Internet interface data to perform the attack, just like they physically inside the network.\nThe Infinitum IT Cyber Threat Intelligence team, observed the usage of Metasploit Framework against multiple targets.Karakurt hacking team used Metasploit for getting Reverse Shell on victim devices, brute forcing SMB shares and RDP sessions.\nPost exploitation techniques used by Karakurt group can be observed on Metasploit logs"
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0xe8fbbcf8",
            "title": "Mitigation Against Conti / Karakurt Hacking Team",
            "text": "Employ robust and routine user-awareness and training regimens for users of all systems.\nEnsure that a robust crisis management and incident response plan are in place in the event of a high impact intrusion.\nMaintain best practices against malware, such as patching, updating anti-virus software, implementing strict network egress policies, and using application whitelisting where feasible.\nPatch infrastructure to the highest available level, as threat actors are often better able to exploit older systems with existing vulnerabilities.\nEnsure all internet-facing security and remote access appliances are patched to the latest versions.\nDisable RDP on external-facing devices and restrict workstation-to-workstation RDP connections.\nEmploy a strong corporate password policy that includes industry standards for password length, complexity, and expiration dates for both human and non-human accounts.\nUse MFA where possible for authenticating corporate accounts to include remote access mechanisms and security tools. Admin accounts should be cross-platform MFA enforced.\nUse admin accounts only for administrative purposes and never to connect to the network or browse the internet.\nDo not store unprotected credentials in files and scripts on shared locations.\nDeploy EDR across the environment, targeting at least 90% coverage of endpoint and workload visibility.\nEncrypt data at rest where possible and protect related keys and technology.\nHunt for attacker TTPs, including common living off the land techniques, to proactively detect and respond to a cyber-attack and mitigate its impact."
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0xf55f930c",
            "title": "IOC Data",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0xeb23c332",
            "title": "Acknowledgement",
            "text": "We would like to thank Federal Office for Information Security (BSI) / Germany for their valuable guidance and support throughout this research.\nDuring our research we also contacted companies who got affected by Conti / Karakurt Threat Actors to prevent the ongoing Cyber Attacks or notify them about the incident.\nThe public version of the report will be shared from our github page\nReaders can find the new samples, IOCs, and new versions of this report from our github page as we will constantly update our page based on new findings."
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x2d9866aa",
            "title": "References",
            "text": "Lozy. danted. 1 04 2022. https://github.com/Lozy/danted.\nNicocha30. ligolo-ng. 3 4 2022. https://github.com/Nicocha30/ligolo-ng.\nrapid7. metasploit-framework. 5 4 2022. https://github.com/rapid7/metasploit-framework.\nSecureAuthCorp. impacket. 01 04 2022. https://github.com/SecureAuthCorp/impacket.\ninfinitumit\n2022-04-08T19:23:53+03:008 Nisan 2022|Categories:\nAPT\n,\nMakaleler\n|Tags:\napt\n,\nransomware\n| Platformunu se yazy payla !\nFacebook\nTwitter\nLinkedIn\nReddit\nWhatsApp\nTumblr\nPinterest\nVk\nE-posta"
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x749ef543",
            "title": "likili Yazlar",
            "text": "Ransomware Trendleri ve Analizler Ransomware Trendleri ve Analizler 21 Mart 2022 | Yorum yok\nSQL Injection SQL Injection 17 Ocak 2022 | Yorum yok\nVMware Horizon Log4Shell CVE-2021-44228 Exploit VMware Horizon Log4Shell CVE-2021-44228 Exploit 7 Ocak 2022 | Yorum yok"
        }
    },
    {
        "report": {
            "id": "report_0x71eeb4fe",
            "date": "20220418",
            "title": "Threat Spotlight: Conti Ransomware Group Behind theKarakurt Hacking Team. Threat Spotlight: Conti Ransomware Group Behind the Karakurt Hacking Team",
            "url": "https://www.infinitumit.com.tr/conti-ransomware-group-behind-the-karakurt-hacking-team"
        },
        "chapter": {
            "id": "chapter_0x7cc91cf7",
            "title": "Additional IOC file",
            "text": "104.238.61.153\n45.8.119.60\n212.220.115.145\n5.45.83.32\n31.14.40.64\n95.170.133.54\n1.116.139.11\n209.222.98.19\n45.141.84.126\n185.5.251.35\n49.232.93.149\n61.177.173.17\n80.93.19.227\n139.219.4.103\n61.19.125.2\n159.65.140.76\n23.99.177.202\n109.169.14.109\n104.243.34.214\n37.252.0.143\n46.166.143.114\nLigolo-ng Agent\nhxxp://104.194.9.238/download/lig.ext\nhxxps://104.194.9.238:455/download/lig2.ext"
        }
    }
]