[
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xe2e1a047",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xe47229f7",
            "title": "Key Findings",
            "text": "New Espionage Campaign Targeting Israelis: Cybereason discovered a new and elaborate campaign that targets Israeli individuals and officials. The campaign is characterized as an espionage campaign aiming to steal sensitive information from PCs and mobile devices belonging to a chosen target group of Israeli individuals working for law enforcement, military and emergency services.\nAttribution to APT-C-23: Based on our investigation and previous knowledge of the group, Cybereason assesses with moderate-high confidence that the group behind the new campaign is APT-C-23, an Arabic-speaking, politically motivated group believed to be operating on behalf of Hamas.\nSocial Engineering as Primary Infection Vector: The attackers used fake Facebook profiles to trick specific individuals into downloading trojanized direct message applications for Android and PC, which granted them access to the victims devices.\nUpgraded Malware Arsenal: The new campaign consists of two previously undocumented malware, dubbed Barb(ie) Downloader and BarbWire Backdoor, both of which use an enhanced stealth mechanism to remain undetected. In addition, Cybereason observed an upgraded version of an Android implant dubbed VolatileVenom.\nAPT-C-23 Stepping Up Their Game: Until recently, the group has been using known tools which served them for years, and were known for their relatively unsophisticated tools and techniques. The analysis of this recent campaign shows that the group has revamped their toolset and playbook."
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x71b7b3ff",
            "title": "Luring the Victims: A Wolf in a Beautys Clothing",
            "text": "To get to their targets, APT-C-23 has set up a network of fake Facebook profiles that are highly maintained and constantly interacting with many Israeli citizens. The social engineering tactic used in this campaign relies mostly on classic catfishing, using fake identities of attractive young women to engage with mostly male individuals to gain their trust.\nThese fake accounts have operated for months, and seem relatively authentic to the unsuspecting user. The operators seem to have invested considerable effort in tending these profiles, expanding their social network by joining popular Israeli groups, writing posts in Hebrew, and adding friends of the potential victims as friends:\nFake Facebook account operated by APT-C-23\nIn order to give the profiles an even more authentic appearance, the group uses the accounts to like various Facebook groups and pages that are well known to Israelis, such as Israelis news pages, Israeli politicians accounts and corporate pages:\nLiked profiles showed on the above mentioned Facebook page\nOver time, the operators of the fake profiles were able to become friends with a broad spectrum of Israeli citizens, among them some high-profile targets that work for sensitive organizations including defense, law enforcement, emergency services and other government-related organizations:\nSome Facebook accounts that interacted with the fake account and their workplace\nAnother example of a fake profile used by APT-C-23 in this campaign, is the following:\nFake Facebook account operated by APT-C-23"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xed8bbaec",
            "title": "From Chat to Infection",
            "text": "After gaining the victims trust, the operator of the fake account suggests migrating the conversation from Facebook over to WhatsApp. By doing so, the operator quickly obtains the target's mobile number. In many cases, the content of the chat revolves around sexual themes, and the operators often suggest to the victims that they should use a safer and more discrete means of communication, suggesting a designated app for Android.\nIn addition, they also entice the victims to open a .rar file containing a video that supposedly contains explicit sexual content. However, when the users open the video they are infected with malware.\nThe following diagram captures the flow of the infection:\nThe VolatileVenom Malware: A supposedly secure and confidential Android messaging application.\nThe Barb(ie) Downloader: A link to a site hxxps://media-storage[.]site/09vy09JC053w15ik21Sw04 downloads a .rar file that contains a private video and the BarbWire Backdoor payload:\nGraph that describes the initial infection chain of the campaign"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xb2904506",
            "title": "Stage One: Barb(ie) Downloader",
            "text": "Barb(ie) is a downloader component used by APT-C-23 to install the BarbWire backdoor. As mentioned above, in the infection phase the downloader is delivered alongside a video in a .rar file. The video is meant to distract the victim from the infection process that is happening in the background.\nThe downloader sample analyzed in this section is named Windows Notifications.exe. When first executed, Barb(ie) decrypts strings using a custom base64 algorithm that is also used in the BarbWire backdoor. Those decrypted strings are different Virtual Machine vendor names, WMI queries, command and control (C2), file and folders names which are used in different phases of the execution.\nOne way the malware uses those strings is in performing multiple checks, such as anti-vm and anti-analysis checks, in order to determine that the coast is clear. If the check fails, a custom pop-up message is displayed to the user and the malware terminates itself:\nCustom pop-up displayed to user before terminating process: Unable to start program 'http:/localhost:60721/\nIf the malware finds the target machine to be clean and it doesnt detect any sandboxing or other analysis being performed on the targeted device, the malware will continue its execution and collect information about the machine, including username, computer name, date and time, running processes and OS version.\nLater, the malware will attempt to create a connection to the embedded C2 server: fausto-barb[.]website. When creating the connection, the malware sends information about the victim machine that is composed of the data collected. In addition, it sends other information to the C2, like the OS version, downloader name and compilation month (windowsNotification + 092021) as well as information on any installed Antivirus software running:\nC2 server for Barb(ie) downloader\nData sent back to the C2 over http\nBarb(ie) will attempt to download the payload by using the following URI: /api/sofy/pony:\nURI structure for Barb(ie) downloader\nIn addition, the downloader creates a file named adbloker.dat that stores the encrypted C2, copies itself to programdata and sets persistence via two scheduled tasks: 01 and 02.\nInterestingly, another Barb(ie) sample that was analyzed with a different name (Windows Security.exe) copies itself to appdata as well, but renames the executable to Windows Notifications.exe and sets the same persistence:\nTwo scheduled tasks created by Barb(ie) downloader for persistence\nExecution of the Barb(ie) downloader as shown in the Cybereason XDR Platform\nLooking at the metadata of Windows Notifications.exe, it appears that the author of the malware chooses a unique company name and product name that do not exist as part of Windows: Windows Security Groups as the company name, and Windows Essential as product name:\nMetadata of the Barb(ie) downloader as shown in the Cybereason XDR Platform\nOnce a successful connection has been established with the C2, Barb(ie) will download the payload, the BarbWire backdoor."
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x8e3b95fc",
            "title": "BarbWire Backdoor",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xe8040952",
            "title": "Background and Capabilities",
            "text": "The backdoor component of APT-C-23s operation is a very capable piece of malware, and it is obvious that a lot of effort was put into hiding its capabilities using a custom base64 algorithm. Its main goal is to fully compromise the victim machine, gaining access to their most sensitive data. The backdoors main capabilities include:\nPersistence\nOS Reconnaissance\nData encryption\nKeylogging\nScreen capturing\nAudio recording\nDownload additional malware\nLocal/external drives and directory enumeration\nSteal specific file types and exfiltrate data"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xa78d2ed7",
            "title": "Variants",
            "text": "According to the timeline of this operation, there are at least three different variants of the BarbWire backdoor. In addition to the compilation timestamp, there is the sekop flag that is used as an identifier for a currently running campaign. It is worth mentioning that the variant that was allegedly compiled in December 2021, still carries the Sep 2021 identifier, perhaps meaning that the Sep 2021 campaign was still ongoing for at least two months:",
            "table": "0;1;2;3;4\nMD5 Hash;Variant;Compilation timestamp;“sekop”;Similarity\nff1c877db4d0b6a37f4ba5d7b4bd4b3b980eddef;Early variant;2021-07-04 07:39:15 UTC;-;62% with campaign variant\nad9d280a97ee3a52314c84a6ec82ef25a005467d;Analyzed Campaign;2021-07-07 11:02:11 UTC;\"\"\"&sekop=072021_\"\"\";90% with new variant\n4dcdb7095da34b3cef73ad721d27002c5f65f47b;New variant;2021-12-28 11:17:12 UTC;“&sekop=092021_”;59% with early\n"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xbfa026a8",
            "title": "Initial Execution and Victim Host Profiling",
            "text": "The BarbWire persistence techniques include the creation of a scheduled task and also the implementation of a known Process protection technique:\nProcess protection implementation\nThe malware handles two execution scenarios; If it is being executed from a location that is other than %programdata%, the malware copies itself to %programdata%\\WMIhosts and creates a scheduled task:\nThe operative path of the BarbWire Backdoor\nThe scheduled task created by the malware\nAccording to a second execution scenario, where the file already operates from %appdata%, the malware starts collecting user information and gathering OS information including:\nPC name\nUsername\nProcess architecture\nWindows version\nInstalled AV products using WMI\nWMI query to check installed AV products\nIn order to hide the malwares most sensitive strings, which can disclose its capabilities and communication patterns, it uses a custom-built base64 algorithm.\nAfter successful C2 decryption, the BarbWire backdoor initiates a connectivity check using Googles domain, and then connects with the C2:\nConnectivity check code snippet\nIt is worth noting that the URIs are in the same format as in the Barb(ie) downloader analyzed above, and other related files pivoted in this research:\nOne of the generated URLs with the same pattern as the downloader\nOnce the initial information is gathered on the victims OS and the connectivity check is completed, the BarbWire Backdoor finally initiates the connection with the C2 through a POST request:\nInitial POST packet with information on the victims machine\nThe data that is sent in the POST request includes:",
            "table": "0;1\nParameter;Data\nname;A double layer encoded victim’s OS information\nsov;Installed AV name\nsekop;Campaign identifier and malware filename\npos;The victim’s OS and architecture\n"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x86cd6cd8",
            "title": "Data Collection and Exfiltration",
            "text": "The BarbWire backdoor can steal a wide range of file types, depending on the instructions it receives from its operators. It specifically looks for certain file extensions such as PDF files, Office documents, archives, videos, and images.\nIn addition to the local drives found on the host, it also looks for external media such as a CD-Rom drive. Searching for such an old media format, together with the file extensions of interests, could suggest a focus on targets that tend to use more physical formats to transfer and secure data, such as military, law enforcement, and healthcare:\nSearching for a CD-Rom drive presence\nBarbWire stores the data it collects from the host on special folders it creates under %programdata%\\Settings where it stores the collected data from the machine. Each stolen type (i.e. keylogged data,screen capture data etc.) has its own resource code name in the C2, appended to the previously generated user id:\nBelow is a table summarizing each folder and its main role:\nFolders created by the BarbWire Backdoor\nOnce the data is being staged and exfiltrated, the data is archived in a .rar file and sent to the C2 to a designated URI:\nExfiltration of archive data\nAs detailed in the beginning of the analysis, the backdoor also has keylogging and screen capturing data-stealing capabilities. Both are being stored in an interesting way, applying unrelated extensions to the files containing the stolen data. This is perhaps another stealth mechanism, or just a way for the attacker to distinguish between the different stolen data types:\nStolen keylogging data\nA screenshot taken by the malware and saved with an .iso extension",
            "table": "0;1\nFolder Name;Role\nactivationData, backup, recoveryFile;Staging data in a RAR archive and exfiltration, download additional payloads, volumes and documents of interest enumeration\nlogFile;Audio recording\nscanLog;Keylogger log file\nupdateStatus;Screenshots files\n"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x6ea6a6ed",
            "title": "VolatileVenom Android Implant Analysis",
            "text": "VolatileVenom is one of APT-C-23s arsenal of Android malware. The attackers lure the victims into installing the VolatileVenom under the pretext that the suggested app is more secure and discrete. Based on our investigation, it seems that VolatileVenom has been operationalized and integrated into the group's arsenal since at least April of 2020, and disguises itself using icons and names of chat applications:\nAdditional Icons of VolatileVenom disguised as messaging apps\nAn example of a fake messaging app used in this campaign, is an Android app named Wink Chat:\nStart-up screen of the app\nAfter the user attempts to sign up for the application, an error message pops up and indicates the app will be uninstalled:\nError message after sign-up\nHowever, in reality the application keeps running in the background, and if the Android version of the device is lower than 10, the application icon is hidden. If the Android version is higher than Android 10, the application icon is then replaced with the icon of Google Play installer. The attackers have the option to change the application icon to Google Chrome or Google Maps as well."
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x15ef1e88",
            "title": "Capabilities",
            "text": "VolatileVenom has a rich set of espionage capabilities, which enable attackers to extract a lot of data from their victims.\nThe main espionage capabilities are the following:\nSteal SMS messages\nRead contact list information\nUse the device camera to take photos\nSteal files with the following extensions: pdf, doc, docs, ppt, pptx, xls, xlsx, txt, text\nSteal images with the following extensions: jpg, jpeg, png\nRecord audio\nUse Phishing to steal credentials to popular apps such as Facebook and Twitter\nDiscard system notifications\nGet installed applications\nRestart Wi-Fi\nRecord calls / WhatsApp calls\nExtract call logs\nDownload files to the infected device\nTake screenshots\nRead notifications of the following apps: WhatsApp, Facebook, Telegram, Instagram, Skype, IMO, Viber\nDiscards any notifications raised by the system\nSwitch Case of Espionage Commands from the C2"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xfbf3ecdb",
            "title": "C2 Communication",
            "text": "VolatileVenom uses HTTPS and Firebase Cloud Messaging (FCM) for C2 communication. The application appears to have two methods to retrieve the C2 domain:\nFirst the malware decrypts a hard coded encrypted domain which is encrypted and encoded with AES and Base64. The encrypted domain is retrieved from a .so (shared object) file. The app loads the .so file (named liboxygen.so in the analyzed sample) , and executes a function (named do932() in the analyzed sample) that returns the encrypted domain:\nThe malware loads the .so file\nThe encrypted hard-coded domain inside the .so file\nNext, the encrypted domain is decoded and decrypted. In the analyzed sample, the encrypted domain is https://sites.google[.]com/view/linda-lester/lockhart:\nCode snippet of the decryption routine\nTo retrieve the final C2 domain, the malware connects to the decrypted domain and reads the title of the website (ex: FRANCES THOMAS COM) and builds the final C2 domain from that: frances-thomas[.]com:\nThe malware builds the final C2 domain from the title of the decrypted domain\nThe second method the malware retrieves the C2 domain is via SMS messages. In case the attackers wish to update the C2 domain, they may send an SMS message containing a new C2 domain to the infected device. The malware intercepts every SMS message, and if a message arrives from the attackers, the malware will extract the new C2 domain to be used:\nRegex to extract domains from SMS messages"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x1721fecd",
            "title": "Conclusion",
            "text": "In this report, the Cybereason Nocturnus Team investigated an active espionage campaign that victimizes Israeli citizens, among them high profile targets, for espionage purposes. The campaign featured a classic social engineering tactic known as catfishing, where the group used sexual content in order to lure their victims, mostly Israeli men, into downloading malware.\nCybereason assesses with moderate-high confidence that APT-C-23, a politically-motivated APT group that operates on behalf of Hamas, is behind the campaign detailed in this report. While the APT-C-23 operations against Arab-speaking targets (mostly Palestinians) are still taking place, this newly identified campaign specifically targets Israelis and shows unique characteristics that distinguish it from other campaigns. The attackers use a completely new infrastructure that is distinct from the known infrastructure used to target Palestinians and other Arabic-speakers. In addition, all three malware in use were also specifically designed to be used against Israeli targets, and were not observed being used against other targets.\nThe Cybereason investigation found that some victims were infected with both PC and Android malware dubbed Barb(ie) Downloader, BarbWire Backdoor, and VolatileVenom. This tight grip on their targets attests to how important and sensitive this campaign was for the threat actors.\nLastly, this campaign shows a considerable step-up in APT-C-23 capabilities, with upgraded stealth, more sophisticated malware, and perfection of their social engineering techniques which involve offensive HUMINT capabilities using a very active and well-groomed network of fake Facebook accounts that have been proven quite effective for the group.\nCybereason contacted Facebook and reported the fake accounts."
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xbef15a0d",
            "title": "Indicators of Compromise",
            "text": "LOOKING FOR THE IOCs? CLICK ON THE CHATBOT DISPLAYED IN LOWER-RIGHT OF YOUR SCREEN FOR ACCESS OR CLICK HERE."
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x20bfad66",
            "title": "MITRE ATT&CK BREAKDOWN",
            "text": "",
            "table": "0;1;2;3;4;5;6;7;8\nExecution;Reconnaissance;Persistence;Defense Evasion;Credential Access;Discovery;Collection;Command and Control;Exfiltration\nCommand-line interface;Gather Victim Host Information;Scheduled Task/Job: Scheduled Task;Masquerading;Input Capture: Keylogging;Software Discovery: Security Software Discovery;Archive Collected Data: Archive via Utility;Web Protocols;Exfiltration Over C2 Channel\nScheduled Task/Job: Scheduled Task;;;Deobfuscate/Decode Files or Information;;;Audio Capture;Data Encoding: Standard Encoding;Automated Exfiltration\nUser Execution;;;Indicator Removal on Host: File Deletion;;;Data from Removable Media;Data Encoding: Non-Standard Encoding;\n;;;;;;Input Capture: Keylogging;;\n;;;;;;Screen Capture;;\n"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x6527838f",
            "title": "MITRE ATT&CK BREAKDOWN: MOBILE",
            "text": "",
            "table": "0;1;2;3;4;5;6;7;8;9\nInitial Access;Execution;Persistence;Privilege Escalation;Defense Evasion;Credential Access;Discovery;Collection;Command and Control;Exfiltration\nDeliver Malicious App via Other Means;Broadcast Receivers;Broadcast Receivers;Device Administrator Permissions;Masquerade as Legitimate Application;Access Notifications;Application Discovery;Access Call Log;Alternate Network Mediums;Data Encrypted\nMasquerade as Legitimate Application;Scheduled Task/Job;Scheduled Task/Job;;Suppress Application Icon;Input Prompt;File and Directory Discovery;Access Contact List;Standard Application Layer Protocol;Standard Application Layer Protocol\n;Native Code;;;;;System Information Discovery;Access Notifications;;\n;;;;;;;Capture Audio;;\n;;;;;;;Capture Camera;;\n;;;;;;;Capture SMS Messages;;\n;;;;;;;Data from Local System;;\n;;;;;;;Screen Capture;;\n"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x4d769f3e",
            "title": "Indicators of Compromise (IOCs): Operation Bearded Barbie - APT-C-23 Campaign",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x5da576b6",
            "title": "Barb(ie) Downloader",
            "text": "Hashes\ne58b6be462d9c32a140485069ea5ab6e1f68bfa5ca639338b2361447076ca046\n1391fc71b88b027fc29536dbebf29859aae1a7a8fc3121e02ae69a0909c147a9\nb59091e84ab7d612a3c19a87802e834afb8893f2d5a957727e2ae7aa7b5fdb50\nb9f967e263dad9b08c19b5f2933fc71047d194d0c495058a0a54c8de11ce5d60\nC2\nfausto-barb[.]website"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x932a7f87",
            "title": "BarbWire Backdoor:",
            "text": "Hashes\nb1c604ca3cf3a17de9e182722a20e5381b255203d7a80ab7c18a6cf9439551d1\nadaa228e7b90ea2649da319f6651b140e93273d016267240c9aea7c0fea2e0bc\nc4fdbfd6608748d7f675a83f392cd923e86a6d491395a611a3d651c3385708b8\nebe09a6ef73a572f7a19d2e1eccd8f5d1895ae2730e67a060d008a2703ab3ec2\nadaa228e7b90ea2649da319f6651b140e93273d016267240c9aea7c0fea2e0bc\nC2\nwanda-bell[.]website\njarah-zeiman[.]website"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xf3dcdff8",
            "title": "VolatileVenom",
            "text": "Hashes\n522973e9d2944ca14072e1943136aeecf85d2e5adba26223635505c83ec865ab\n0f8395b1768314e3f4a0332fb2bad642308b96513c9db72884926cc736a57991\nc8d51db4b2171f289de67e412193d78ade58ec7a7de7aa90680c34349faeeee2\n69ec780e60073c25ef23c1983c43ca79c957ec6ae9d6df8967b4822bad8c700e\nfeef85f0a8f65b75776fc694e255bfa1b0240ebc1eb6af7dfb070064a31e61fc\nb2396341f77b9549f62a0ce8cc7dacf5aa250242ed30ed5051356d819b60abff\n7d3a00c93cbf15df1afab245f9be47feb27c862d51581dadaec50378bee7d5fa\n54f2aa690954ddfcd72e0915147378dd9a7228954b05c54da3605611b2d5a55e\n144ba7c6090acbd2bc35411a815ccf801fd49abc5dde327b03f207ed868cdd6e\n2481f133dd3594cbf18859b72faa391a4b34fd5b4261b26383242c756489bf07\n2d6f114e595c861799a91c840a42d065aeba4e85aefccd7fe806d4f10416f1d6"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xd021025f",
            "title": "C2 Domains",
            "text": "frances-thomas[.]com\nscott-chapin[.]com\nlinda-gaytan[.]website\ndavid-gardiner[.]website\namanda-hart[.]website\njavan-demsky.website"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xc493cdc4",
            "title": "Google URLs",
            "text": "https://sites.google.com/view/janx/about\nhttps://sites.google[.]com/view/linda-lester/lockhart\nhttps://sites.google[.]com/view/charlok/adlov\nhttps://sites.google[.]com/view/kevin-arocha/transform-status\nhttps://sites.google[.]com/view/sebastian-victor/jonathan\nhttps://sites.google[.]com/view/virginia-blake/samantha\nhttps://sites.google[.]com/view/esther-wright/process\nAbout the Author"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0xe231e918",
            "title": "Cybereason Nocturnus",
            "text": "The Cybereason Nocturnus Team has brought the worlds brightest minds from the military, government intelligence, and enterprise security to uncover emerging threats across the globe. They specialize in analyzing new attack methodologies, reverse-engineering malware, and exposing unknown system vulnerabilities. The Cybereason Nocturnus Team was the first to release a vaccination for the 2017 NotPetya and Bad Rabbit cyberattacks.\nAll Posts by Cybereason Nocturnus"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x4492a451",
            "title": "Ransomware vs AI: The Battle Between Machines",
            "text": "An AI-driven XDR solution can cut through the noise introduced by a constant flood of alerts, allowing security teams to spend less time sifting through alerts and chasing false positives and more time detecting and blocking attacks...\nCategory"
        }
    },
    {
        "report": {
            "id": "report_0xf216545b",
            "date": "20220406",
            "title": "Operation Bearded Barbie: APT-C-23 Campaign Targeting Israeli Officials",
            "url": "https://www.cybereason.com/blog/operation-bearded-barbie-apt-c-23-campaign-targeting-israeli-officials"
        },
        "chapter": {
            "id": "chapter_0x2adf1f1f",
            "title": "Cybereason and IBM: A Better Way to do Enterprise IR",
            "text": "Cybereason and IBM are launching a joint solution to address the most critical SOC challenges and significantly improve incident response delivery, triage, and remediation processes...\nNEWSLETTER"
        }
    }
]