[
    {
        "report": {
            "id": "report_0xd36a515e",
            "date": "20220320",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "url": "https://www.microsoft.com/security/blog/2022/03/16/uncovering-trickbots-use-of-iot-devices-in-command-and-control-infrastructure"
        },
        "chapter": {
            "id": "chapter_0xdf1bf7ae",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "text": "Trickbot, a sophisticated trojan that has evolved significantly since its discovery in 2016, has continually expanded its capabilities and, even with disruption efforts and news of its infrastructure going offline, it has managed to remain one of the most persistent threats in recent years. The malwares modular nature has allowed it to be increasingly adaptable to different networks, environments, and devices. In addition, it has grown to include numerous plug-ins, access-as-a-service backdoors for other malware like Ryuk ransomware, and mining capabilities. A significant part of its evolution also includes making its attacks and infrastructure more durable against detection, including continuously improving its persistence capabilities, evading researchers and reverse engineering, and finding new ways to maintain the stability of its command-and-control (C2) framework.\nThis continuous evolution has seen Trickbot expand its reach from computers to Internet of Things (IoT) devices such as routers, with the malware updating its C2 infrastructure to utilize MikroTik devices and modules. MikroTik routers are widely used around the world across different industries. By using MikroTik routers as proxy servers for its C2 servers and redirecting the traffic through non-standard ports, Trickbot adds another persistence layer that helps malicious IPs evade detection by standard security systems.\nThe Microsoft Defender for IoT research team has recently discovered the exact method through which MikroTik devices are used in Trickbots C2 infrastructure. In this blog, we will share our analysis of the said method and provide insights on how attackers gain access to MikroTik devices and use compromised IoT devices in Trickbot attacks.\nThis analysis has enabled us to develop a forensic tool to identify Trickbot-related compromise and other suspicious indicators on MikroTik devices. We published this tool to help customers ensure these IoT devices are not susceptible to these attacks. Were also sharing recommended steps for detection and remediating compromise if found, as well as general prevention steps to protect against future attacks.\nFigure 1. Trickbot attack diagram"
        }
    },
    {
        "report": {
            "id": "report_0xd36a515e",
            "date": "20220320",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "url": "https://www.microsoft.com/security/blog/2022/03/16/uncovering-trickbots-use-of-iot-devices-in-command-and-control-infrastructure"
        },
        "chapter": {
            "id": "chapter_0x4c4a0059",
            "title": "How attackers compromise MikroTik devices for Trickbot C2",
            "text": "The purpose of Trickbot for using MikroTik devices is to create a line of communication between the Trickbot-affected device and the C2 server that standard defense systems in the network are not able to detect. The attackers begin by hacking into a MikroTik router. They do this by acquiring credentials using several methods, which we will discuss in detail in the following section.\nThe attackers then issue a unique command that redirects traffic between two ports in the router, establishing the line of communication between Trickbot-affected devices and the C2. MikroTik devices have unique hardware and software, RouterBOARD and RouterOS. This means that to run such a command, the attackers need expertise in RouterOS SSH shell commands. We uncovered this attacker method by tracking traffic containing these SSH shell commands.\nFigure 2. Direct line of communication between the Trickbot infected device and the Trickbot C2"
        }
    },
    {
        "report": {
            "id": "report_0xd36a515e",
            "date": "20220320",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "url": "https://www.microsoft.com/security/blog/2022/03/16/uncovering-trickbots-use-of-iot-devices-in-command-and-control-infrastructure"
        },
        "chapter": {
            "id": "chapter_0xa5b81081",
            "title": "Accessing the MikroTik device and maintaining access",
            "text": "Attackers first need to access the MikroTik shell to run the routing commands. To do so, they need to acquire credentials. As mentioned earlier, based on our analysis, there are several methods that attackers use to access a target router:\nUsing default MikroTik passwords.\nLaunching brute force attacks. We have seen attackers use some unique passwords that probably were harvested from other MikroTik devices.\nExploiting CVE-2018-14847 on devices with RouterOS versions older than 6.42. This vulnerability gives the attacker the ability to read arbitrary files like user.dat, which contains passwords.\nTo maintain access, the attackers then change the affected routers password."
        }
    },
    {
        "report": {
            "id": "report_0xd36a515e",
            "date": "20220320",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "url": "https://www.microsoft.com/security/blog/2022/03/16/uncovering-trickbots-use-of-iot-devices-in-command-and-control-infrastructure"
        },
        "chapter": {
            "id": "chapter_0xcda468fb",
            "title": "Redirecting traffic",
            "text": "MikroTik devices have a unique Linux-based OS called RouterOS with a unique SSH shell that can be accessed through SSH protocol using a restricted set of commands. These commands can be easily identified by the prefix /. For example:\n/ip\n/system\n/tool\nThese commands usually wont have any meaning on regular Linux-based shells and are solely intended for MikroTik devices. We observed through Microsoft threat data the use of these types of commands. Understanding that these are MikroTik-specific commands, we were able to track their source and intent. For example, we observed attackers issuing the following commands:\n/ip firewall nat add chain=dstnat proto=tcp dst-port=449 to-port=80 action=dst-nat to-addresses=<infected device> dst-address=<real C2 address>\nFrom the command, we can understand the following:\nA new rule, similar to iptables, is created\nThe rule redirects traffic from the device to a server\nThe redirected traffic is received from port 449 and redirected to port 80\nThe said command is a legitimate network address translation (NAT) command that allows the NAT router to perform IP address rewriting. In this case, it is being used for malicious activity. Trickbot is known for using ports 443 and 449, and we were able to verify that some target servers were identified as TrickBot C2 servers in the past.\nThis analysis highlights the importance of keeping IoT devices secure in todays ever evolving threat environment. Using Microsoft threat data, Microsofts IoT and operational technology (OT) security experts established the exact methods that attackers use to leverage compromised IoT devices and gained knowledge that can help us better protect customers from threats."
        }
    },
    {
        "report": {
            "id": "report_0xd36a515e",
            "date": "20220320",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "url": "https://www.microsoft.com/security/blog/2022/03/16/uncovering-trickbots-use-of-iot-devices-in-command-and-control-infrastructure"
        },
        "chapter": {
            "id": "chapter_0x2633f0e9",
            "title": "Defending IoT devices against Trickbot attacks",
            "text": "As security solutions for conventional computing devices continue to evolve and improve, attackers will explore alternative ways to compromise target networks. Attack attempts against routers and other IoT devices are not new, and being unmanaged, they can easily be the weakest links in the network. Therefore, organizations should also consider these devices when implementing security policies and best practices."
        }
    },
    {
        "report": {
            "id": "report_0xd36a515e",
            "date": "20220320",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "url": "https://www.microsoft.com/security/blog/2022/03/16/uncovering-trickbots-use-of-iot-devices-in-command-and-control-infrastructure"
        },
        "chapter": {
            "id": "chapter_0x7fa91b8d",
            "title": "An open-source tool for MikroTik forensics",
            "text": "While investigating MikroTik and attacks in the wild, we observed several methods of attacking these devices in addition to the method we described in this blog. We aggregated our knowledge of these methods and known CVEs into an open-source tool that can extract the forensic artifacts related to these attacks.\nSome of this tools functionalities include the following:\nGet the version of the device and map it to CVEs\nCheck for scheduled tasks\nLook for traffic redirection rules (NAT and other rules)\nLook for DNS cache poisoning\nLook for default ports change\nLook for non-default users\nWe have published the tool in GitHub and are sharing this tool with the broader community to encourage better intelligence-sharing in the field of IoT security and to help build better protections against threat actors abusing IoT devices."
        }
    },
    {
        "report": {
            "id": "report_0xd36a515e",
            "date": "20220320",
            "title": "Uncovering Trickbots use of IoT devices in command-and-control infrastructure",
            "url": "https://www.microsoft.com/security/blog/2022/03/16/uncovering-trickbots-use-of-iot-devices-in-command-and-control-infrastructure"
        },
        "chapter": {
            "id": "chapter_0xd5d8a899",
            "title": "How to detect, remediate, and prevent infections",
            "text": "Organizations with potentially at-risk MikroTik devices can perform the following detection and remediation steps:\nRun the following command to detect if the NAT rule was applied to the device (completed by the tool as well):\n/ip firewall nat print\nIf the following data exists, it might indicate infection:\nchain=dstnat action=dst-nat to-addresses=<public IP address> \nto-ports=80 protocol=tcp dst-address=<your MikroTik IP> dst-port=449 \nchain=srcnat action=masquerade src-address=<your MikroTik IP>\nRun the following command to remove the potentially malicious NAT rule:\n/ip firewall nat remove numbers=<rule number to remove>\nTo prevent future infections, perform the following steps:\nChange the default password to a strong one\nBlock port 8291 from external access\nChange SSH port to something other than default (22)\nMake sure routers are up to date with the latest firmware and patches\nUse a secure virtual private network (VPN) service for remote access and restrict remote access to the router"
        }
    }
]