[
    {
        "report": {
            "id": "report_0x9773d2a8",
            "date": "20220408",
            "title": "CryptoClip Hijacker",
            "url": "https://labs.k7computing.com/index.php/cryptoclip-hijacker"
        },
        "chapter": {
            "id": "chapter_0xc2882e58",
            "title": "CryptoClip Hijacker",
            "text": "Cryptocurrency\nSocial Networking Apps"
        }
    },
    {
        "report": {
            "id": "report_0x9773d2a8",
            "date": "20220408",
            "title": "CryptoClip Hijacker",
            "url": "https://labs.k7computing.com/index.php/cryptoclip-hijacker"
        },
        "chapter": {
            "id": "chapter_0x19f89a1c",
            "title": "Binary Overview",
            "text": "This binary is .NET compiled\nFigure 1: Version info of the malware\nThis files version information and the internal name was spoofed to be like svchost.exe. Legitimate svchost.exe file would be Microsoft Visual C++ 8 compiled, and not .NET as observed in Figure 1. The file is also signed with a fake digital certificate as shown Figure 3.\nFigure 2: Digital Certificate information\nThe malware uses a simple decryption logic for all its encrypted data. First the encrypted string and a key ( UUdkUzZTQkFtMXlKTkE3Zw==) is decoded in base64 format. Then the decoded string is XORed with the decoded key. Figure 3 depicts this decryption process.\nFigure 3: Code to decrypt/decode\nEven the files original filename was seen as base64 encoded and XOR encrypted. The decoded value was EjUdI0I8AS0EQS4rOiJfAiM=: crypto clip watcher. which as mentioned earlier is the name of a legitimate crypto tool.\nFigure 4: Original file name"
        }
    },
    {
        "report": {
            "id": "report_0x9773d2a8",
            "date": "20220408",
            "title": "CryptoClip Hijacker",
            "url": "https://labs.k7computing.com/index.php/cryptoclip-hijacker"
        },
        "chapter": {
            "id": "chapter_0x841b7b1d",
            "title": "Persistence technique used in this binary file",
            "text": "On statically analyzing the decompiled IL binary we found the reference to a persistence entry in %APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup where the malware self copies and executes itself under the guise of svchost32.exe. Adds the same filepath to the run entry as well, under the subkey Host Process for Windows Services as shown in Figure 5.\nFigure 5: Persistence entry in registry\nUses one another standard technique of adding scheduled tasks using cmd.exe.\nFigure 6: Process tree of the malware\nThe self-copied file svchost32.exe is scheduled to be executed every minute by creating a job file as shown in Figure 7.\nFigure 7: The previous command line as seen statically in the decompiled binary"
        }
    },
    {
        "report": {
            "id": "report_0x9773d2a8",
            "date": "20220408",
            "title": "CryptoClip Hijacker",
            "url": "https://labs.k7computing.com/index.php/cryptoclip-hijacker"
        },
        "chapter": {
            "id": "chapter_0x3006e1ea",
            "title": "Malware Mechanism",
            "text": "This file has 38 crypto wallet addresses of the attacker, few of the shown in Figure 8. This addresses are also encoded with base64 and XORed with the key.\nFigure 8: List of crypto currency that are targeted by the malware\nSome of the transactions to this wallet are shown below in Figure 9.\nFigure 9: Encoded wallet address in decompiled code and decoded address.\nA regex pattern(\\b(79|380)[0-9]{9}\\b) is used by this malware to scrape for crypto wallet addresses. Once that is done the malware validates to which currency the scraped wallet is relevant to, using the currency wallet specific regex. These regexes are also encoded as shown in Figure 10.\nFigure 10: Currency specific regex encoded/decoded\nThe user wallet address in the clipboard is replaced with the malware authors wallet address. The code snippet to find and replace the clipboard content is shown in Figure 11.\nFigure11: Get/Set text from clipboard\nWe checked one of the attackers crypto wallet addresses and found a couple of transactions being made to it, which roughly translates to about 100$."
        }
    },
    {
        "report": {
            "id": "report_0x9773d2a8",
            "date": "20220408",
            "title": "CryptoClip Hijacker",
            "url": "https://labs.k7computing.com/index.php/cryptoclip-hijacker"
        },
        "chapter": {
            "id": "chapter_0xd8ebf4ec",
            "title": "Transactions",
            "text": "Figure 12: Transaction showing transfer of the crypto to the attackers wallet address\nIt is always advisable to download tools or applications from reputable sources and exercise caution while using any such binaries. It is also always advisable to use a security software like K7 Total Security."
        }
    },
    {
        "report": {
            "id": "report_0x9773d2a8",
            "date": "20220408",
            "title": "CryptoClip Hijacker",
            "url": "https://labs.k7computing.com/index.php/cryptoclip-hijacker"
        },
        "chapter": {
            "id": "chapter_0x8dcbeb5c",
            "title": "Indicators Of Compromise (IOCs) and Detections",
            "text": "Hash 3488617002B1652F487D5AD410CB92AF\nDetection Name Trojan(00545fd01)\nOriginal File Name crypto clip watcher.exe\nMutex 2c092895c2e64adb\nBehavior suspicious program (ID 700018)"
        }
    },
    {
        "report": {
            "id": "report_0x9773d2a8",
            "date": "20220408",
            "title": "CryptoClip Hijacker",
            "url": "https://labs.k7computing.com/index.php/cryptoclip-hijacker"
        },
        "chapter": {
            "id": "chapter_0x71297aef",
            "title": "Like what you're reading? Subscribe to our top stories.",
            "text": "If you want to subscribe to our monthly newsletter, please submit the form below.\nEmail* :\nPrevious Post The Discord Token Grab\nNext Post"
        }
    }
]