[
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0xea7ee56b",
            "title": "Coper Banking Trojan",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x68652068",
            "title": "Technical Analysis",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0xde54e4d7",
            "title": "APK Metadata Information",
            "text": "App Name: Play Store app install\nPackage Name: com.theseeye5\nSHA256 Hash: 4261cc05a8c4ecaf1605ef931397a4d97cc12fe38738a4f6016c3695aa2c571f\nFigure 1 shows the metadata information of an application.\nFigure 1 App Metadata Information\nThe figure below shows the application icon impersonating the Google Play Store app displayed on the Android device.\nFigure 2 App Icon and Name"
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x42406169",
            "title": "Manifest Description",
            "text": "The fake Play Store app asks for 32 permissions, of which the TA takes advantage of 12. The malwares harmful permission requests are listed below:\nWe found the activity class that is initiated when the app is launched via the icon. This was determined by looking at the Android components declared in the Manifest file. Figure 3 depicts the declaration of this activity.\nFigure 3 Launcher Activity\nIn addition to the launcher activity, the applications Manifest file contains several receivers & services and the applications subclass.",
            "table": "0;1\nPermission;Description\nREAD_PHONE_STATE;Allows the application to access the phone features of the device\nADD_VOICEMAIL;Allows an application to add voicemails into the system\nCALL_PHONE;Allows the application to call phone numbers without your intervention\nREAD_EXTERNAL_STORAGE;Allows an application to read from external storage.\nWRITE_EXTERNAL_STORAGE;Allows an application to write to external storage.\nWRITE_SETTINGS;Allows an application to modify the system’s settings data.\nCALL_PHONE;Perform call without user intervention\nREAD_SMS;Access user’s SMSs stored in the device\nRECEIVE_SMS;Fetch and process SMS messages\nSEND_SMS;Allows the app to send SMS messages\nSYSTEM_ALERT_WINDOW;Allows to display system alerts over other apps\n"
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x280fc698",
            "title": "Source Code Review",
            "text": "Apart from the applications subclass, the rest of the components identified from the Manifest file are missing. Hence, we can infer that the application is packed.\ncom.theseeye5.KSNckdWjjyIXg is the applications subclass initiated on launching the application. The application loads its components from the library file upon analyzing the subclass, as shown below.\nFigure 4 Applications Subclass loading library file\nThe project file browser can also be used for viewing the library files presence. libyvr.so is visible in the screenshot below.\nFigure 5 Library file in Project file representation\nUpon analyzing the .so file, the application acts as a dropper, which is the initial phase of the Coper malware that drops and installs the malwares primary harmful module hiding inside the victims Android device.\nAs seen in Figure 4, the file drops an encrypted.dex file. This file can be decrypted to reveal the Coper malwares malicious code, as shown below.\nFigure 6 Decrypted Dex file\nUpon analyzing the decrypted.dex file, we were able to find the presence of missed Receivers, Services, and Mainactivity of the application. Below, we have listed the malicious activities the application can perform:\nThe application uses the Device Administration API along with the DeviceAdminReceiver subclass to enable/disable device admin to the apps that users install on their devices.\nFigure 7 Enabling/Disabling Device Admin\nThe application can read all the incoming SMS messages from the infected device.\nFigure 8 Reading Incoming SMS\nThe applications entry point/launcher activity reads installed packages from the users device.\nFigure 9 Launcher activity of the malicious application\nThe malware reads the incoming notifications by verifying the packages and steals the messages from the notification using Notification Listener Service.\nFigure 10 Reads and cancels the notification using Notification Listener service\nLike other Banking Trojans, Coper malware requests users to enable the Accessibility Service to perform various Accessibility Event types to conduct malicious activities, as shown in the below figure.\nFigure 11 Accessibility Event Types\nThe malware maintains a connection with the C&C server and queries it every minute. If the malware gets the relevant instructions from the C&C server, the time interval can be altered to ensure the malware gets sufficient time to perform other malicious functionalities.\nCoper malware may also alter additional configuration parameters, as shown in Figure 12.\nFigure 12 Timer Delay and Configuration Changes Performed by malware\nThe list of webinjects or applications for which malicious apps attempt to steal data were also identified. Coper malware usually has a targeted list of applications in their remote server that prohibits them from running in the infected device. Coper malware actively targets banking applications across Europe, Australia, and even parts of South America.\nThe malware also receives commands from the TA through the C&C URL hard coded within the app in encrypted text. Figure 13 depicts the list of commands stored within the app in encrypted text.\nFigure 13 Commands received from C&C server\nThe list of commands used in Coper malware are given below:\nUpon further analysis, we were able to find the hardcoded additional Command and Control (C&C) domains, webinjects, and configuration data by the Malware author. The hard-coded C&C domains and configuration data are shown below.\nFigure 14 Additional C&C domains and configuration data hardcoded by malware author",
            "table": "0;1\nCommand;Description\nussd;Run a USSD request\nsms;Send an SMS\nregister_again;Dynamically registering a broadcast receiver\nlock_on & lock_off;Lock/Unlock the device screen\nintercept_on & intercept_off;Start/Stop intercepting SMS\nvnc_start & vnc_stop;Start/Stop a VNC\npush;Demonstrate a push notification\nrepeat_inject;Re-display a phishing window on top of the targeted app’s window\nstart_keylogger & stop_keylogger;Run/Stop a Keylogger\nuninstall_apps;Delete an application specified in the command\nkill_bot;Delete itself and the dropper\nopen_url;Launches the defined URL\nrun_app;Run a defined package\n"
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0xd8bcc166",
            "title": "Dynamic C&C servers:",
            "text": "hxxps://s22231232fdnsjds[.]top/PArhFzp5sG2sN/\nhxxps://s32231232fdnsjds[.]top/PArhFzp5sG2sN/\nhxxps://s42231232fdnsjds[.]top/PArhFzp5sG2sN/\nCoper trojans have several defense measures. Controlling the integrity of the core malicious component is one of them. The Copper malware will attempt to restore it if it is removed.\nCoper malware also has a secondary safety measure to monitor potentially harmful behavior to the trojan, such as:\nThe user trying to modify the device administrators list user access to the trojans information page from the systems list of installed apps.\nThe user visiting the Google Play Protect page in the Play Store app.\nThe user changes the trojans access privileges for the Accessibility Services features."
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x85068b61",
            "title": "Conclusion",
            "text": "According to our research, Banking trojans no longer conduct assaults only based on overlay or using rented Mobility as a Service (MaaS), as previously detected in numerous Banking Trojan malware variants.\nThis malware uses Virtual Network Computing (VNC) to initiate screen recording services by recognizing the foreground settings in the list of apps.\nFinancial institutions must strengthen their mobile-first approach and prepare for the challenges posed by this virus by understanding the security landscape. This aim may be achieved by implementing a real-time threat-driven mobile security strategy."
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x6026c7ae",
            "title": "Our Recommendations",
            "text": "We have listed some essential cybersecurity best practices that create the first line of control against attackers. We recommend that our readers follow the best practices given below:"
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x8733cd51",
            "title": "How To Prevent Malware Infection?",
            "text": "Download and install software only from official app stores like Google Play Store or the iOS App Store.\nUse a reputed anti-virus and internet security software package on your connected devices, such as PCs, laptops, and mobile devices.\nUse strong passwords and enforce multi-factor authentication wherever possible.\nEnable biometric security features such as fingerprint or facial recognition for unlocking the mobile device where possible.\nBe wary of opening any links received via SMS or emails delivered to your phone.\nEnsure that Google Play Protect is enabled on Android devices.\nBe careful while enabling any permissions.\nKeep your devices, operating systems, and applications updated."
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x3e6c6edd",
            "title": "How To Identify Whether You Are Infected?",
            "text": "Regularly check the Mobile/Wi-Fi data usage of applications installed in mobile devices.\nKeep an eye on the alerts provided by Anti-viruses and Android OS and take necessary actions accordingly."
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0xc880813",
            "title": "What To Do When You Are Infected?",
            "text": "Disable Wi-Fi/Mobile data and remove SIM card as in some cases, the malware can re-enable the Mobile Data.\nPerform a factory reset.\nRemove the application in case a factory reset is not possible.\nTake a backup of personal media Files (excluding mobile applications) and perform a device reset."
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0xaf634d94",
            "title": "What To Do In Case Of Any Fraudulent Transaction?",
            "text": "In case of a fraudulent transaction, immediately report it to the concerned bank."
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0xa0c00198",
            "title": "What Should Banks Do To Protect Their Customers?",
            "text": "Banks and other financial entities should educate customers on safeguarding themselves from malware attacks via telephone, SMS, or emails."
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x89d09b3b",
            "title": "MITRE ATT&CK Techniques",
            "text": "",
            "table": "0;1;2\nTactic;Technique ID;Technique Name\nInitial Access;T1476;Deliver Malicious App via Other Mean\nDefense Evasion;T1406;Obfuscated Files or Information\nInitial Access/Defense Evasion;T1444;Masquerade as Legitimate Application\nCollection;T1513;Screen Capture\nCollection;T1412;Capture SMS Messages\nCredential Access;T1417;Input Capture (Keylogger)\nCommand and Control;T1436;Commonly Used Ports\n"
        }
    },
    {
        "report": {
            "id": "report_0x93f2abff",
            "date": "20220324",
            "title": "Android Malware Posing as Google Play Store App Installer. Coper Banking Trojan",
            "url": "https://blog.cyble.com/2022/03/24/coper-banking-trojan"
        },
        "chapter": {
            "id": "chapter_0x3fbc31eb",
            "title": "Indicators Of Compromise (IOCs)",
            "text": "",
            "table": "0;1;2\nIndicators;Indicator Type;Description\n4261cc05a8c4ecaf1605ef931397a4d97cc12fe38738a4f6016c3695aa2c571f;SHA256;Hash of the analysed APK file\n9b07766286667e6444c93e86d833a426a5d660f0;SHA1;Hash of the analysed APK file\n85b7a0e8cdee68bca806fc45948c2d82;MD5;Hash of the analysed APK file\nhxxps://s22231232fdnsjds[.]top/;URL;C&C servers\nhxxps://s32231232fdnsjds[.]top/;URL;C&C servers\nhxxps://s42231232fdnsjds[.]top;URL;C&C servers\n"
        }
    }
]