[
    {
        "report": {
            "id": "report_0x596465f1",
            "date": "20220324",
            "title": "Zscalers cloud is not at risk:. ThreatLabz SOC playbook for Okta:. What happened in the Okta attack?. Guidance and Best Practices. Lapsus$ Attack on Okta: How to Evaluate the Impact to your Organization",
            "url": "https://www.zscaler.com/blogs/security-research/lapsus-attack-okta-how-evaluate-impact-your-organization"
        },
        "chapter": {
            "id": "chapter_0x3f991b01",
            "title": "Lapsus$ Attack on Okta: How to Evaluate the Impact to your Organization",
            "text": "Microsoft and Okta disclosed breaches this week involving Lapsus$, a cybercrime group that has made headlines multiple times in recent months for attacks against corporations including NVIDIA, Ubisoft, Samsung, and Vodafone. The group specializes in stealing and extorting data in exchange for a ransom payment. Lapsus$ is known to leverage low-tech but high-impact methods to gain access to organizations. Lapsus$ has used tactics such as social engineering, SIM swapping, and paying employees and business partners for access to credentials and multifactor authentication approvals. The first known extortion attempt by Lapsus$ included the Brazil Health Ministry in December of 2021."
        }
    },
    {
        "report": {
            "id": "report_0x596465f1",
            "date": "20220324",
            "title": "Zscalers cloud is not at risk:. ThreatLabz SOC playbook for Okta:. What happened in the Okta attack?. Guidance and Best Practices. Lapsus$ Attack on Okta: How to Evaluate the Impact to your Organization",
            "url": "https://www.zscaler.com/blogs/security-research/lapsus-attack-okta-how-evaluate-impact-your-organization"
        },
        "chapter": {
            "id": "chapter_0x4f040867",
            "title": "SOC Detection Rules for Okta",
            "text": "The process to enable Threat Detection for Okta using a SOC Playbook should be well-defined with specific workflows and actions. Okta has pre-built log ingestion modules for many of the common SIEM solutions. Once events are ingested, a number of queries can be created and easily leveraged for signs of a potential compromise or other suspicious activities. While they are not a comprehensive set of queries, they serve as a solid starting point for a security investigation.",
            "table": "0;1\nDetection Name;Detection Query\nMFA Deactivation Attempt;event.dataset:okta.system and event.action:user.mfa.factor.deactivate\nMFA Reset Attempt;event.dataset:okta.system and event.action:user.mfa.factor.reset_all\nMFA Push Brute Force Attempt;\"sequence by user.email with maxspan=10m  [any where event.module == \"\"okta\"\" and event.action == \"\"user.mfa.okta_verify.deny_push\"\"]  [any where event.module == \"\"okta\"\" and event.action == \"\"user.mfa.okta_verify.deny_push\"\"]  [any where event.module == \"\"okta\"\" and event.action == \"\"user.authentication.sso\"\"]\"\nMFA Bypass Attempt;event.dataset:okta.system and event.action:user.mfa.attempt_bypass\nAccount Login Brute Force Attempt;event.dataset:okta.system and event.action:user.account.lock\nUser Session Impersonation;event.dataset:okta.system and event.action:user.session.impersonation.initiate\nGroup Administrative Privilege Assignment;event.dataset:okta.system and event.action:group.privilege.grant\nUser Administrative Privilege Assignment;event.dataset:okta.system and event.action:user.account.privilege.grant\nPolicy Rule Modification;event.dataset:okta.system and event.action:policy.rule.update\nPolicy Rule Deletion;event.dataset:okta.system and event.action:policy.rule.delete\nPolicy Rule Deactivation;event.dataset:okta.system and event.action:policy.rule.deactivate\n"
        }
    },
    {
        "report": {
            "id": "report_0x596465f1",
            "date": "20220324",
            "title": "Zscalers cloud is not at risk:. ThreatLabz SOC playbook for Okta:. What happened in the Okta attack?. Guidance and Best Practices. Lapsus$ Attack on Okta: How to Evaluate the Impact to your Organization",
            "url": "https://www.zscaler.com/blogs/security-research/lapsus-attack-okta-how-evaluate-impact-your-organization"
        },
        "chapter": {
            "id": "chapter_0x96b101ae",
            "title": "Deepen Desai",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x596465f1",
            "date": "20220324",
            "title": "Zscalers cloud is not at risk:. ThreatLabz SOC playbook for Okta:. What happened in the Okta attack?. Guidance and Best Practices. Lapsus$ Attack on Okta: How to Evaluate the Impact to your Organization",
            "url": "https://www.zscaler.com/blogs/security-research/lapsus-attack-okta-how-evaluate-impact-your-organization"
        },
        "chapter": {
            "id": "chapter_0xcc45ceca",
            "title": "Dhaval Parekh",
            "text": ""
        }
    }
]