[
    {
        "report": {
            "id": "report_0xd2b88a18",
            "date": "20220320",
            "title": "Webinar on cyberattacks in Ukraine summary and Q&A",
            "url": "https://securelist.com/webinar-on-cyberattacks-in-ukraine-summary-and-qa/106075"
        },
        "chapter": {
            "id": "chapter_0x2ee9a465",
            "title": "Webinar on cyberattacks in Ukraine summary and Q&A",
            "text": "Publications\n14 Mar 2022\n4 minute read\nTable of Contents\nAbout the webinar\nQ&A\nIndicators of Compromise (IoCs)\nAuthors\nGReAT"
        }
    },
    {
        "report": {
            "id": "report_0xd2b88a18",
            "date": "20220320",
            "title": "Webinar on cyberattacks in Ukraine summary and Q&A",
            "url": "https://securelist.com/webinar-on-cyberattacks-in-ukraine-summary-and-qa/106075"
        },
        "chapter": {
            "id": "chapter_0xbbcaaec0",
            "title": "Webinar on cyberattacks in Ukraine summary and Q&A",
            "text": "Publications"
        }
    },
    {
        "report": {
            "id": "report_0xd2b88a18",
            "date": "20220320",
            "title": "Webinar on cyberattacks in Ukraine summary and Q&A",
            "url": "https://securelist.com/webinar-on-cyberattacks-in-ukraine-summary-and-qa/106075"
        },
        "chapter": {
            "id": "chapter_0x64a94d87",
            "title": "About the webinar",
            "text": "On March 10, 2022 Kasperskys Global Research and Analysis Team (GReAT) shared their insights into the current (and past) cyberattacks in Ukraine. In this post we address the questions that we did not have the time to answer and provide the Indicators of Compromise (IoCs) that can help you defend against the identified threats. You can watch the full recording of the webinar here: A look at current cyberattacks in Ukraine\nThe webinar included an historical overview of attacks on Ukraine; and an overview of current cyber-activity in the country, which comprises known APT activity, unknown parties carrying out DDoS attacks and leveraging commodity RATs, hacktivism, activities by cybercriminals and unattributed attacks.\nIn the webcast, we also provided an analysis of attacks identified using Kasperskys honeypot network in Ukraine; as well as an analysis of the APT attacks by Gamaredon, Cyclops Blink, Hades/Sandworm and unknown groups, using commodity malware such as PandoraBlade. We also looked into different wipers that have been used against organizations in Ukraine, including HermeticWiper, WhisperGate, IsaacWiper and HermeticRansom. We also covered unknown and unattributed attacks and hacktivist activity taking place in the same timeframe.\nWe assess that the number of cyber attacks in Ukraine will increase during the next six months. While most of the current attacks are of low complexity such as DDoS or attacks using commodity and low-quality tools more sophisticated attacks exist also, and more are expected to come. Current complex activities include the employment of HermeticWiper, which stands out due to its sophistication, as well as the Viasat cyber event the partial network outage that impacted internet service for fixed broadband customers in Ukraine and elsewhere on the European KA-SAT network that affected over 30,000 plus terminals in Europe.\nCurrently, we assess that the risk of the cyber component of this conflict spilling over to Europe is medium-high.\nWe advise organizations to:\nTake typical measures against DDoS attacks, ransomware and destructive malware, phishing, targeted attacks, supply-chain attacks and firmware attacks\nMake sure that any and all internet-facing systems are up-to-date with all the latest patches installed\nInstall security software on endpoints\nSet up extensive logging that will allow defenders to be alerted about suspicious events\nEstablish strict application white-listing on all machines\nActively hunt for attackers inside the companys internal network\nIntegrate Threat Intelligence into SOC, EDR and leverage IOCs, YARA, Suricata and Sigma rules. We would also refer you to Kasperskys Threat Intelligence Resource Hub, which currently provides free access to independent, continuously updated and globally-sourced information on ongoing cyberattacks and threats."
        }
    },
    {
        "report": {
            "id": "report_0xd2b88a18",
            "date": "20220320",
            "title": "Webinar on cyberattacks in Ukraine summary and Q&A",
            "url": "https://securelist.com/webinar-on-cyberattacks-in-ukraine-summary-and-qa/106075"
        },
        "chapter": {
            "id": "chapter_0x87482963",
            "title": "Q&A",
            "text": "Due to time limitations, we could not address all questions during the webinar, so here are our answers for the remaining questions we received in the live session:\nQ: What are the chances that well see attacks using enterprise resources to launch attacks?\nA: Depending on the nature of the attack, actors may not differentiate between home, SMB and enterprise systems. For example, infected IoT and network devices such as IP-cameras may be used by anyone, and may be infected and abused by attackers to launch attacks such as DDoS attacks. Attackers will use and abuse any resources they require in order to conduct their attack. If this includes enterprise resources then they will be included in the attackers scope.\nQ: Currently we have seen massive connection outbreaks in many different services over TOR-exits located in the German region. Does this provide a true picture of the threat landscape, since many attackers seem to be from in this instance Germany but might originate from regions that are very interested in causing damage to Europe or Ukraine specifically right now?\nA: We commonly take TOR and other anonymizing services into account when it comes to the origin of attacks. Not all attacks, for example on our honeypot infrastructure, are easily possible through TOR due to enforced policies on exit-nodes.\nQ: Im wondering what you can say about the attacks on Russian targets, both from hacktivists and others? Can you help us separate the hype and exaggerations from attacks that are having a real impact?\nA: We have seen several public hack announcements. Most of them dont include enough evidence to confirm a real hack; nor do we have the abilities or resources to verify most of them as they are very specific and targeted.\nThe most important suggestion is to not blindly trust all messages, reports and claims especially unverified content or if its from unverified channels/accounts.\nQ: We all know of REvil group activity and the Kaseya case. REvil members were arrested by the Russian FSB a few months ago. Do you believe that these people might be employed by the Kremlin to organize an attack against Ukraine? Or you think it might be possible to determine if any attackers are former REvil members?\nA: We dont have any insights into the employment of criminals or other threat actors; nor into plans and strategies of any government or related organizations. Our focus is on the technical aspects only, which is where our expertise and focus lies. The real world identity of criminals and other threat actors is the focus area of law enforcement and related agencies.\nQ: How may this conflict between Russia and Ukraine affect financial operations? Are firewalls and antivirus tools enough to defend against a cyberattack that comes from Europe?\nA: Financial transactions and other operations are handled through the networks of financial institutions. These are usually secured using many different methods. The origin (that is, region or country) is usually not the first question in regards to defense, but rather technical aspects and targets. Depending on that, particular methods and policies should be applied to protect against attacks.\nQ: Do you have any current readings on attacks on NGOs?\nA: Several investigations reveal that targets include NGOs these are accessible through our Threat Intelligence Reporting Service.\nQ: How can we use the Kaspersky honeypot and sandbox?\nA: Our honeypots are not part of any Kaspersky products. They are dedicated systems where specific sensors are installed in order to monitor attacks. However, you may join our honeypot initiative (for details, email us at honeypots@kaspersky.com).\nYou may access and use the Kaspersky Sandbox within our Product & Service offerings: Kaspersky Sandbox and Kaspersky Threat Intelligence. File analysis can also be conducted through OpenTIP.\nWhat follows is the list of IoCs we derived from our honeypot-sensors in Ukraine. These are the observed, most prominent and relevant attacking IP addresses."
        }
    },
    {
        "report": {
            "id": "report_0xd2b88a18",
            "date": "20220320",
            "title": "Webinar on cyberattacks in Ukraine summary and Q&A",
            "url": "https://securelist.com/webinar-on-cyberattacks-in-ukraine-summary-and-qa/106075"
        },
        "chapter": {
            "id": "chapter_0x46da473",
            "title": "Indicators of Compromise (IoCs)",
            "text": "IPs found attacking Ukraine honeypot assets\n185[.]252[.]232[.]67\n133[.]242[.]129[.]39\n120[.]48[.]3[.]144\n178[.]62[.]81[.]147\n159[.]203[.]71[.]145\n116[.]105[.]72[.]113\n182[.]59[.]88[.]117\n27[.]6[.]204[.]233\n115[.]48[.]212[.]167\n42[.]227[.]250[.]181\n219[.]157[.]145[.]211\n182[.]119[.]167[.]53\n42[.]224[.]124[.]173\n125[.]40[.]19[.]101\n196[.]70[.]116[.]243\n125[.]41[.]141[.]113\n219[.]157[.]59[.]51\n14[.]106[.]231[.]203\n87[.]150[.]3[.]191\n152[.]32[.]180[.]171\n192[.]241[.]221[.]199\n121[.]229[.]44[.]136\n192[.]241[.]220[.]251\n192[.]241[.]220[.]48\n192[.]241[.]220[.]47\n192[.]241[.]218[.]100\n62[.]16[.]2[.]14\n152[.]32[.]135[.]202\n139[.]162[.]8[.]54\nHashes\necce8845921a91854ab34bff2623151e IsaacWiper\nd5d2c4ac6c724cd63b69ca054713e278 HermeticRansom\n3f4a16b29f2f0532b7ce3e7656799125 HermeticWiper\n84ba0197920fd3e2b7dfa719fee09d2f HermeticWiper\n517d2b385b846d6ea13b75b8adceb061 HermeticWizard\n5d5c99a08a7d927346ca2dafa7973fc1 WhisperGate\n14c8482f302b5e81e3fa1b18a509289d WhisperGate\ne61518ae9454a563b8f842286bbdb87b WhisperGate\n3907c7fbd4148395284d8e6e3c1dba5d WhisperGate\ne5071ccd626ad4ef8b0be7561c50f1ac WhisperGate\n238bf5d26e338ca205b269ca4a9f57a8 WhisperGate\n033fa3ae260e465da3d541bc138d2e1d WhiteBlackCrypt x32\n4a6bec571521881b387b9de3d7b06aa0 WhiteBlackCrypt x32\n072da4148add1d8ee1e691cb94b31737 WhiteBlackCrypt x32\n99bd77ae4a287904c813960727046d80 WhiteBlackCrypt x32\nb36e5c508efea796731d444c189b413c WhiteBlackCrypt x64\n490d8cdaf68619f23a2e03f55fd9e33e Pandora hVNC\n6942546805623a1648960ffdc91d1cff Pandora hVNC\nc2cbd5caa9012e4878ff35c31cb2122f Pandora hVNC\n02190c8c52bfafe4fa69b2972f867c1b Pandora hVNC\ne34d6387d3ab063b0d926ac1fca8c4c4 MicroBackdoor spearphishing ZIP archive\n2556a9e1d5e9874171f51620e5c5e09a MicroBackdoor CHM dropper\nbc6932a0479045b2e60896567a37a36c MicroBackdoor JS dropper\nMore IOCs are available to customers of the Kaspersky Intelligence reporting service. Contact: intelreports@kaspersky.com\nAPT\nCyber weapon\nDDoS-attacks\nHackers\nTargeted attacks\nAuthors\nGReAT"
        }
    }
]