[
    {
        "report": {
            "id": "report_0xd6e10f93",
            "date": "20220420",
            "title": "Uncovering new techniques and phishing attack trends from thecloud. Report Highlights",
            "url": "https://www.zscaler.com/blogs/security-research/uncovering-new-techniques-and-phishing-attack-trends-cloud"
        },
        "chapter": {
            "id": "chapter_0xc83c2122",
            "title": "Uncovering new techniques and phishing attack trends from thecloud",
            "text": "Download your free copy of the 2022 ThreatLabz Phishing Report, and check out our infographic.\nFor decades, phishing has been a complex and time-consuming challenge for every security team. As the findings of the ThreatLabz 2022 Phishing Report reveal, the challenge is getting harder: adversaries are getting craftier, and attackers are growing in numbers due to pre-built phishing kits available on the darknet. In this annual report, ThreatLabz offers deep insights on the current phishing threat landscape from a full years worth of phishing data from the worlds largest security cloud. Avoiding the latest breed of phishing attacks requires heightened awareness from users, additional context, and a zero trust approach."
        }
    },
    {
        "report": {
            "id": "report_0xd6e10f93",
            "date": "20220420",
            "title": "Uncovering new techniques and phishing attack trends from thecloud. Report Highlights",
            "url": "https://www.zscaler.com/blogs/security-research/uncovering-new-techniques-and-phishing-attack-trends-cloud"
        },
        "chapter": {
            "id": "chapter_0xfeebff09",
            "title": "Related Zscaler products:",
            "text": "Zscaler Internet Access helps identify and stop malicious activity by routing and inspecting all internet traffic through the Zero Trust Exchange. Zscaler blocks:\nURLs and IPs observed in Zscaler cloud, and from natively integrated open source and commercial threat intel sources. This includes policy-defined high-risk URL categories commonly used for phishing such as newly observed and newly activated domains.\nIPS signatures developed from ThreatLabz analysis of phishing kits and pages.\nNovel phishing sites identified by content scans powered by AI/ML detection.\nAdvanced Threat Protection blocks all known command-and-control domains.\nAdvanced Cloud Firewall extends command-and-control protection to all ports and protocols, including emerging C&C destinations.\nCloud Browser Isolation creates a safe gap between users and malicious web categories, rendering content as a stream of picture-perfect images to eliminate the leakage of data and the delivery of active threats.\nAdvanced Cloud Sandbox prevents unknown malware delivered in second stage payloads.\nZscaler Private Access safeguards applications by limiting lateral movement with least privileged access user-to-app segmentation and full in-line inspection of private app traffic.\nZscaler Deception detects and contains attackers attempting to move laterally or escalate privileges by luring them with decoy servers, applications, directories, and user accounts.\nLearn more\nDownload the 2022 Phishing Report by ThreatLabz to learn more about the latest trends in phishing attacks and to discover:\nOverview of 21 common phishing attack types, 11 scam categories, and threat analysis of the TTPs used in popular and emerging scams\nHow the phishing threat landscape has shifted towards specialization and automation, making it easier for threat actors to launch more potent campaigns than ever before\nBest practices for identifying attacks and improving your phishing defenses\nHow zero trust can fortify your organization against phishing attacks\n2023 phishing trend predictions\nGet your copy here.\nAbout us\nZscaler ThreatLabz is a global threat research team with a mission to protect customers from advanced cyberthreats. Made up of more than 100 security experts with decades of experience in tracking threat actors, malware reverse engineering, behavior analytics, and data science, the team operates 24/7 to identify and prevent emerging threats using insights from 300 trillion daily signals from the Zscaler Zero Trust Exchange.\nSince its inception, ThreatLabz has been tracking the evolution of emerging threat vectors, campaigns, and groups, contributing critical findings and insights on zero-day vulnerabilities, including active IOCs and TTPs for threat actors, malware, and ransomware families, phishing campaigns, and more.\nThreatLabz supports industry information sharing and plays an integral role in the development of world-class security solutions at Zscaler. See the latest ThreatLabz threat research on the Zscaler blog.\nSecurity Research\nInsights and Research"
        }
    },
    {
        "report": {
            "id": "report_0xd6e10f93",
            "date": "20220420",
            "title": "Uncovering new techniques and phishing attack trends from thecloud. Report Highlights",
            "url": "https://www.zscaler.com/blogs/security-research/uncovering-new-techniques-and-phishing-attack-trends-cloud"
        },
        "chapter": {
            "id": "chapter_0xbf3643cf",
            "title": "Rohit Hegde",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0xd6e10f93",
            "date": "20220420",
            "title": "Uncovering new techniques and phishing attack trends from thecloud. Report Highlights",
            "url": "https://www.zscaler.com/blogs/security-research/uncovering-new-techniques-and-phishing-attack-trends-cloud"
        },
        "chapter": {
            "id": "chapter_0xdda31579",
            "title": "Jim Wang",
            "text": ""
        }
    }
]