{
    "id": "<report_0x2ae7d61f>",
    "url": "https://www.telsy.com/the-evil-twin-attack",
    "title": "The Evil Twin attack",
    "meta": [],
    "chapters": [
        {
            "id": "<chapter_0xb375c58b>",
            "title": "The Evil Twin attack",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0xb158e15b>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "23 May",
                    "html": " \n\t\t\t\t\t\t23 May\t\t\t\t\t\n"
                },
                {
                    "id": "<sentence_0xe5d7d696>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "An Evil Twin attack is a spoofing cyberattack that works by tricking users into connecting to a fake Wi-Fi access point that mimics a legitimate network.",
                    "html": "<p>An Evil Twin attack is a spoofing cyberattack that works by tricking users into connecting to a fake Wi-Fi access point that mimics a legitimate network.</p>"
                },
                {
                    "id": "<sentence_0x82a7fa42>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Once a user is connected to an Evil Twin network, hackers can access everything from their network traffic to private login credentials.",
                    "html": "<p>Once a user is connected to an “Evil Twin” network, hackers can access everything from their network traffic to private login credentials.</p>"
                },
                {
                    "id": "<sentence_0x250690ca>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<p> </p>"
                }
            ]
        },
        {
            "id": "<chapter_0xcb8f78dd>",
            "title": "The Evil Twin attack",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0xcf79dfa3>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<a class=\"go--back\" href=\"\">\n</a>"
                },
                {
                    "id": "<sentence_0xa83ab48f>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xf647a2b9>": "https://www.telsy.com/category/cybersecurity/"
                    },
                    "text": "Cybersecurity",
                    "html": "<a href=\"https://www.telsy.com/category/cybersecurity/\" rel=\"category tag\">Cybersecurity</a>"
                },
                {
                    "id": "<sentence_0x474e1d6b>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": ",",
                    "html": ", "
                },
                {
                    "id": "<sentence_0x3ee7eb69>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xdc091cc0>": "https://www.telsy.com/category/cyber-attack/"
                    },
                    "text": "Cyber Attack",
                    "html": "<a href=\"https://www.telsy.com/category/cyber-attack/\" rel=\"category tag\">Cyber Attack</a>"
                }
            ]
        },
        {
            "id": "<chapter_0xfe2a47f4>",
            "title": "How an Evil Twin Attack Works",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0x414e9903>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Evil Twin attacks get their name from their ability to imitate legitimate Wi-Fi networks to the extent that they are indistinguishable from one another.",
                    "html": "<p>Evil Twin attacks get their name from their ability to imitate legitimate Wi-Fi networks to the extent that they are indistinguishable from one another.</p>"
                },
                {
                    "id": "<sentence_0xe7b744d8>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "This type of attack is particularly dangerous because it can be nearly impossible to identify.",
                    "html": "<p>This type of attack is particularly dangerous because it can be nearly impossible to identify.</p>"
                },
                {
                    "id": "<sentence_0xff186ee3>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "The most dangerous Evil Twin attacks work by tricking victims into thinking that they are connecting to a reliable public Wi-Fi network.",
                    "html": "<p>The most dangerous Evil Twin attacks work by tricking victims into thinking that they are connecting to a reliable public Wi-Fi network.</p>"
                },
                {
                    "id": "<sentence_0xb2531fae>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "To make the attack as believable as possible, hackers typically use the following steps:",
                    "html": "<p>To make the attack as believable as possible, hackers typically use the following steps:</p>"
                },
                {
                    "id": "<sentence_0xcfbfee7>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x1d9904dd>": "https://www.techtarget.com/searchsecurity/definition/Wi-Fi-Pineapple"
                    },
                    "text": "Step 1: Set up an Evil Twin access point<crlf>A hacker looks for a location with free, popular WiFi. The hacker takes note of the Service Set Identifier (SSID) name. Then, the hacker uses a tool like a WiFi Pineapple to set up a new account with the same SSID. Connected devices cant differentiate between legitimate connections and fake versions.",
                    "html": "<p>Step 1: Set up an Evil Twin access point\nA hacker looks for a location with free, popular WiFi. The hacker takes note of the Service Set Identifier (SSID) name. Then, the hacker uses a tool like a <a href=\"https://www.techtarget.com/searchsecurity/definition/Wi-Fi-Pineapple\">WiFi Pineapple</a> to set up a new account with the same SSID. Connected devices can’t differentiate between legitimate connections and fake versions.</p>"
                },
                {
                    "id": "<sentence_0x9217a054>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Step 2: Set up a fake captive portal<crlf>Before you can sign in to most public WiFi accounts, you must fill in data on a generic login page. A hacker will set up an exact copy of this page, hoping that they will trick the victim into offering up authentication details. Once the hacker has those, they can log in to the network and control it.",
                    "html": "<p>Step 2: Set up a fake captive portal\nBefore you can sign in to most public WiFi accounts, you must fill in data on a generic login page. A hacker will set up an exact copy of this page, hoping that they will trick the victim into offering up authentication details. Once the hacker has those, they can log in to the network and control it.</p>"
                },
                {
                    "id": "<sentence_0x4578da7d>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xf495095e>": "https://www.telsy.com/ddos-attacks/"
                    },
                    "text": "Step 3: Encourage victims to connect to the Evil Twin WiFi<crlf>The hacker moves close to the victims and makes a stronger connection signal than the valid version. Anyone new will only see the Evil Twin, and they will tap and log in. The hacker can kick off anyone currently connected with a distributed denial of service (DDoS) attack, which temporarily takes the valid server offline and prompts mass logins.",
                    "html": "<p>Step 3: Encourage victims to connect to the Evil Twin WiFi\nThe hacker moves close to the victims and makes a stronger connection signal than the valid version. Anyone new will only see the Evil Twin, and they will tap and log in. The hacker can kick off anyone currently connected with a distributed denial of service <a href=\"https://www.telsy.com/ddos-attacks/\">(DDoS) attack</a>, which temporarily takes the valid server offline and prompts mass logins.</p>"
                },
                {
                    "id": "<sentence_0xd29d609c>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Step 4: The hacker steals the data<crlf>Anyone who logs in connects via the hacker. This is a classic man-in-the-middle attack, which allows the attacker to monitor anything that happens online. If the user logs into something sensitive (like a bank account), the hacker can see all the login details and save them for later use.",
                    "html": "<p>Step 4: The hacker steals the data\nAnyone who logs in connects via the hacker. This is a classic man-in-the-middle attack, which allows the attacker to monitor anything that happens online. If the user logs into something sensitive (like a bank account), the hacker can see all the login details and save them for later use.</p>"
                },
                {
                    "id": "<sentence_0xf86266f6>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<p> </p>"
                }
            ]
        },
        {
            "id": "<chapter_0x30d4b916>",
            "title": "Example of an Evil Twin Attack",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0xa5fc81ef>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Lets say that a user decides to connect to a public Wi-Fi network at a local coffee shop. Theyve connected to the access point there before, so they assume its safe and reliable.",
                    "html": "<p>Let’s say that a user decides to connect to a public Wi-Fi network at a local coffee shop. They’ve connected to the access point there before, so they assume it’s safe and reliable.</p>"
                },
                {
                    "id": "<sentence_0xbf50007a>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "This time, however, a hacker has set up an Evil Twin network with an identical SSID name and a stronger signal than the legitimate access point. The user connects to it despite it being listed as Unsecure.",
                    "html": "<p>This time, however, a hacker has set up an Evil Twin network with an identical SSID name and a stronger signal than the legitimate access point. The user connects to it despite it being listed as “Unsecure.”</p>"
                },
                {
                    "id": "<sentence_0x70a4e819>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "While connected to the network, the user logs into their bank account to check their balance and later accesses their companys portal to catch up on work.",
                    "html": "<p>While connected to the network, the user logs into their bank account to check their balance and later accesses their company’s portal to catch up on work.</p>"
                },
                {
                    "id": "<sentence_0xdb1f533a>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Because the user has not set up a virtual private network (VPN) to encrypt their data, the Evil Twin network allows the hacker to access their banking information and company website.",
                    "html": "<p>Because the user has not set up a virtual private network (VPN) to encrypt their data, the Evil Twin network allows the hacker to access their banking information and company website.</p>"
                },
                {
                    "id": "<sentence_0x435c9bfa>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<p> </p>"
                }
            ]
        },
        {
            "id": "<chapter_0xcb164a94>",
            "title": "Cybersecurity Risks",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0x68efc2e6>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Evil Twin attacks pose a significant cybersecurity risk for both end users and businesses.",
                    "html": "<p>Evil Twin attacks pose a significant cybersecurity risk for both end users and businesses.</p>"
                },
                {
                    "id": "<sentence_0x19e84799>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Hackers often use Evil Twin attacks to gain access to personal user data like login credentials, bank transactions, and credit card information.",
                    "html": "<p>Hackers often use Evil Twin attacks to gain access to personal user data like login credentials, bank transactions, and credit card information.</p>"
                },
                {
                    "id": "<sentence_0x55528fd5>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "This is especially dangerous for users who use the same username and password for multiple accounts, since the hacker could gain access to all of them by monitoring just one login attempt.",
                    "html": "<p>This is especially dangerous for users who use the same username and password for multiple accounts, since the hacker could gain access to all of them by monitoring just one login attempt.</p>"
                },
                {
                    "id": "<sentence_0xda17bbcd>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Moreover, if a user logs into their companys portal while connected to an Evil Twin network, the hacker can gain access to the company website using the employees credentials.",
                    "html": "<p>Moreover, if a user logs into their company’s portal while connected to an Evil Twin network, the hacker can gain access to the company website using the employee’s credentials.</p>"
                },
                {
                    "id": "<sentence_0xea9e788d>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "This poses a significant cybersecurity risk as hackers can then access company data or plant malware in the system.",
                    "html": "<p>This poses a significant cybersecurity risk as hackers can then access company data or plant malware in the system.</p>"
                },
                {
                    "id": "<sentence_0x719bf092>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "To help prevent hackers from creating networks that mimic their own, companies can identify duplicate networks using wireless intrusion prevention systems.",
                    "html": "<p>To help prevent hackers from creating networks that mimic their own, companies can identify duplicate networks using wireless intrusion prevention systems.</p>"
                },
                {
                    "id": "<sentence_0xaa24882>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Businesses that offer public Wi-Fi may also provide customers and employees with a personal security key to ensure that users are connecting to the legitimate network.",
                    "html": "<p>Businesses that offer public Wi-Fi may also provide customers and employees with a personal security key to ensure that users are connecting to the legitimate network.</p>"
                },
                {
                    "id": "<sentence_0x8cf4e182>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<p> </p>"
                }
            ]
        },
        {
            "id": "<chapter_0xd64cb697>",
            "title": "How To Protect Yourself From an Evil Twin Attack",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0xc64aa521>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Evil Twin attacks can be difficult to identify, but there are multiple steps you can take to protect yourself when connecting to public Wi-Fi networks.",
                    "html": "<p>Evil Twin attacks can be difficult to identify, but there are multiple steps you can take to protect yourself when connecting to public Wi-Fi networks.</p>"
                },
                {
                    "id": "<sentence_0x46c7887c>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Use Your Own Hotspot: the easiest way to protect yourself from an Evil Twin attack is to use a personal hotspot instead of public Wi-Fi whenever possible. This ensures that you always connect to a reliable network in public spaces and prevents hackers from accessing your data. Just remember to set a password to keep your access point private.<crlf>Avoid Unsecured Wi-Fi Hotspots: if you need to connect to a public network, try to avoid any access points marked Unsecure. Unsecured networks lack legitimate security features, and Evil Twin networks almost always have this designation. Hackers often rely on people brushing this off and connecting to their network without knowing the risks.<crlf>Disable Auto Connect: if you have auto connect enabled on your device, it will automatically connect to any networks that you have used before once youre in range. This can be dangerous in public places, especially if you have unknowingly connected to an Evil Twin network in the past. To ensure that you always connect to the network you want, disable auto connect any time you leave your home or office.<crlf>Never Log Into Private Accounts on Public Wi-Fi: you should avoid logging into private accounts whenever possible when using public Wi-Fi. Hackers can only access your login information if you use it while connected to their Evil Twin network, so remaining signed out can help protect your private information.<crlf>Use a VPN to Encrypt Traffic: a VPN can help protect you from an Evil Twin attack by encrypting your data before a hacker sees it. When you download a reliable VPN app to your device, it encrypts or scrambles your online activity before sending it to the network, making it impossible for a hacker to read and understand.<crlf>Stick to HTTPS websites: when using a public network, be sure to only visit HTTPS websites. These sites offer end-to-end encryption, preventing hackers from monitoring your activity while you use them.<crlf>Use Two-Factor Authentication: adding two-factor authentication to your private accounts is a great way to prevent hackers from accessing them. Even if a hacker gains access to your login credentials, the two-factor authentication will prevent them from successfully accessing your account.<crlf>What To Do if You Fall Victim to an Attack: if you discover that a hacker has breached your data through an Evil Twin attack, you should contact your local police department and your bank or credit card company if the hacker stole money or gained access to your banking information during the attack.",
                    "html": "<ul>\n<li>Use Your Own Hotspot: the easiest way to protect yourself from an Evil Twin attack is to use a personal hotspot instead of public Wi-Fi whenever possible. This ensures that you always connect to a reliable network in public spaces and prevents hackers from accessing your data. Just remember to set a password to keep your access point private.</li>\n<li>Avoid Unsecured Wi-Fi Hotspots: if you need to connect to a public network, try to avoid any access points marked “Unsecure.” Unsecured networks lack legitimate security features, and Evil Twin networks almost always have this designation. Hackers often rely on people brushing this off and connecting to their network without knowing the risks.</li>\n<li>Disable Auto Connect: if you have auto connect enabled on your device, it will automatically connect to any networks that you have used before once you’re in range. This can be dangerous in public places, especially if you have unknowingly connected to an Evil Twin network in the past. To ensure that you always connect to the network you want, disable auto connect any time you leave your home or office.</li>\n<li>Never Log Into Private Accounts on Public Wi-Fi: you should avoid logging into private accounts whenever possible when using public Wi-Fi. Hackers can only access your login information if you use it while connected to their Evil Twin network, so remaining signed out can help protect your private information.</li>\n<li>Use a VPN to Encrypt Traffic: a VPN can help protect you from an Evil Twin attack by encrypting your data before a hacker sees it. When you download a reliable VPN app to your device, it encrypts or scrambles your online activity before sending it to the network, making it impossible for a hacker to read and understand.</li>\n<li>Stick to HTTPS websites: when using a public network, be sure to only visit HTTPS websites. These sites offer end-to-end encryption, preventing hackers from monitoring your activity while you use them.</li>\n<li>Use Two-Factor Authentication: adding two-factor authentication to your private accounts is a great way to prevent hackers from accessing them. Even if a hacker gains access to your login credentials, the two-factor authentication will prevent them from successfully accessing your account.</li>\n<li>What To Do if You Fall Victim to an Attack: if you discover that a hacker has breached your data through an Evil Twin attack, you should contact your local police department and your bank or credit card company if the hacker stole money or gained access to your banking information during the attack.</li>\n</ul>"
                },
                {
                    "id": "<sentence_0xaad02989>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Evil Twin attacks are just one method that hackers use to gain access to sensitive information online.",
                    "html": "<p>Evil Twin attacks are just one method that hackers use to gain access to sensitive information online.</p>"
                },
                {
                    "id": "<sentence_0x2a5f90fd>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "To further protect yourself from cyberattacks, consider downloading reputable antivirus software and read up on the most common types of hackers to look out for.",
                    "html": "<p>To further protect yourself from cyberattacks, consider downloading reputable antivirus software and read up on the most common types of hackers to look out for.</p>"
                },
                {
                    "id": "<sentence_0x2d736c7e>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<a class=\"pld-like-trigger pld-like-dislike-trigger\" href=\"\" title=\"\">\n</a>"
                },
                {
                    "id": "<sentence_0x5ebabdca>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "1",
                    "html": "\n1 \n"
                },
                {
                    "id": "<sentence_0xfb2cc4d2>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<a class=\"pld-dislike-trigger pld-like-dislike-trigger\" href=\"\" title=\"\">\n</a>"
                }
            ]
        }
    ]
}