[
    {
        "report": {
            "id": "report_0x4a545761",
            "date": "20220320",
            "title": "Chinese phishing actors consistently targeting EU diplomats",
            "url": "https://www.proofpoint.com/us/newsroom/news/chinese-phishing-actors-consistently-targeting-eu-diplomats"
        },
        "chapter": {
            "id": "chapter_0xee6c8b61",
            "title": "Chinese phishing actors consistently targeting EU diplomats",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x4a545761",
            "date": "20220320",
            "title": "Chinese phishing actors consistently targeting EU diplomats",
            "url": "https://www.proofpoint.com/us/newsroom/news/chinese-phishing-actors-consistently-targeting-eu-diplomats"
        },
        "chapter": {
            "id": "chapter_0x1c02104d",
            "title": "Timeline of activity",
            "text": "Starting in August 2020, the phishing actors impersonated EU-based organizations to target governments in the continent.\nEmail impersonating a UN agent (Proofpoint)\nThe malicious emails used a DropBox URL to deliver a variant of the PlugX malware, which was previously deployed in attacks against Australian organizations.\nIn November 2021, TA416 added hidden image trackers on emails to validate message openings and follow a more targeted approach in their campaign.\nOn January 17, 2022, Proofpoint noticed new delivery attempts involving ZIP files that were custom-named to match the targets interests.\nJanuary 2022 phishing email (Proofpoint)\nA change in tactic also occurred at this point, as the ZIP files werent fetched from a cloud hosting service but instead leveraged a dropper malware executable.\nThe four components downloaded this way were the PlugX malware, its loader, the DLL search order hijacker (process loader), and a PDF decoy file.\nFinally, on February 28, 2022, the Chinese threat actors were spotted using a compromised diplomats address to target other top-ranking officials of NATO countries with lures involving the Russian invasion of Ukraine.\nThe most recent phishing lure linked to TA416 (Proofpoint)\nThe compromised person worked in refugee and migrant services, an area that was recently targeted by Belarusian hackers as well."
        }
    },
    {
        "report": {
            "id": "report_0x4a545761",
            "date": "20220320",
            "title": "Chinese phishing actors consistently targeting EU diplomats",
            "url": "https://www.proofpoint.com/us/newsroom/news/chinese-phishing-actors-consistently-targeting-eu-diplomats"
        },
        "chapter": {
            "id": "chapter_0x1c4ef1b2",
            "title": "Superficial changes",
            "text": "While the tactics, malware drop, installation, and loading methods remain constant across campaigns, Mustang Panda puts some effort into regularly changing the components used.\nThe group uses different legitimate PE files to initiate side-loading, as well as a variety of PlugX DLL loaders including the PotPlayer and DocCon versions, elaborates the Proofpoint report.\nTA416 also uses different variants of the final PlugX payload in which the communication routines are observed to be different when closely analyzed.\nHowever, too many elements form a common ground between 2020, 2021, and 2022 campaigns, as reflected in the following table.\nCommon TA416 tactics throughout the years (Proofpoint)\nAs Proofpoints report underlines in conclusion, these superficial variations will continue unabated, especially now that a fresh set of indicators of compromise has been published, so vigilance and good email security practices are advised to all potential targets.\nChina\nMustang Panda\nPhishing\nta416\nFacebook\nTwitter\nLinkedIn\nEmail\nBill Toulas is a technology writer and infosec news reporter with over a decade of experience working on various online publications. An open source advocate and Linux enthusiast, is currently finding pleasure in following hacks, malware campaigns, and data breach incidents, as well as by exploring the intricate ways through which tech is swiftly transforming our lives."
        }
    }
]