[
    {
        "report": {
            "id": "report_0x699c64c4",
            "date": "20220320",
            "title": "ASEC Weekly Malware Statistics (March 7th, 2022 March 13th, 2022)",
            "url": "https://asec.ahnlab.com/en/32677"
        },
        "chapter": {
            "id": "chapter_0x42bd5ded",
            "title": "ASEC Weekly Malware Statistics (March 7th, 2022 March 13th, 2022)",
            "text": "The ASEC analysis team is using the ASEC automatic analysis system RAPIT to categorize and respond to known malware. This post will list weekly statistics collected from March 7th, 2022 (Monday) to March 13th, 2022 (Sunday).\nFor the main category, info-stealer ranked top with 71.2%, followed by RAT (Remote Administration Tool) with 12.4%, downloader with 6.8%, banking malware with 5.9%, ransomware with 2.7%, and backdoor with 0.3%.\nTop 1 AgentTesla\nAgentTesla is an infostealer that ranked first place with 29.4%. It is an info-stealer that leaks user credentials saved in web browsers, emails, and FTP clients.\nRecently collected samples use the following email servers and user accounts when leaking the collected information.\nserver mail.alimentostolten[.]cl (177.221.140[.]71) sender moo3@alimentostolten.cl receiver moo3@alimentostolten.cl user moo3@alimentostolten.cl pw icui*****@\nserver mail.atharvashipping[.]co (107.180.38[.]104) sender stanley@atharvashipping.co receiver sharif@kadenasportwear.com user stanley@atharvashipping.co pw S*******5\nserver mail.escueladeseguridadmaritima[.]com (160.153.132[.]203) sender julieta@escueladeseguridadmaritima.com receiver officestore2022@gmail.com user julieta@escueladeseguridadmaritima.com pw JUs******20\nAs most are distributed through spam emails disguised as invoices, shipment documents, and purchase orders, the file names contain such words shown above (Invoice, Shipment, P.O. Purchase Order). Multiple collected samples were disguised as files with extensions of pdf and xlsx.\nIATF 16949 LOC&ISO 9001 & ISO 14001 signed contrct.pdf_2.exe\nPO 102230.PDF (Savana Delhi MedicChem. Private Ltd) Signed Copy.exe\nORDER FOR FU.exe\nPO-HBK3092022.exe\nAWB NO.5646219901-Invoice & Shipping Documents.exe\nAWB N0 30296411_Invoice Documets 2022.exe\nINVOICE JPg.exe\nAmBank Malaysia Swift Copy.exe\nSTATEMENT_OF_ACCOUNT.exe\nQuote_order#098799.exe\ndhl shippping documents.pdf.exe\nPAYMENT_SLIP.exe\nURGENT__P_O.exe\nTop 2 Formbook\nFormbook ranked second place with 26.6%.\nLike other info-stealer, it is mainly distributed through spam emails. The distributed file names are close to each other. As for the files shown in the list below, bmpdsani22-0049rs_1.exe and enhptcdzxlpgiuy.exe, they changed the name of the parent folder, and distributed them using email to their targets. In other words, the malware was made differently by changing the compressed filename of the file attached to the phishing email. Thus, users should take extra caution when opening the file sent from unknown users.\nEUR_18630-7014608032022-pdf.pif.exe\nPO_00107_03_22.exe\nEnquiry.exe\nPROFORMA_INVOICE.exe\nCommercial-Invoice.exe\nSwift_copy.exe\nXX Construction Inc. 2022 Commence for Defect Repair, Contract for Completion\\bmpdsani22-0049rs_1.exe\nEstimate Inc. XXX Infrastructure 20220307_104249\\bmpdsani22-0049rs_1.exe\nXXXX Estimate\\bmpdsani22-0049rs_1.exe\nXXXXX BioTech Purchase Order ph meter\\enhptcdzxlpgiuy.exe\nXXX Country Product Unit Price(220311)_XXXX Mart\\enhptcdzxlpgiuy.exe\nAs Formbook is injected in a normal process that is in the directory of explorer.exe and system32, the malicious behaviors are performed by the normal process. Besides user credentials in the web browser, the malware can steal various information through keylogging, clipboard grabbing, and web browser form grabbing.\nBelow is the list of confirmed C&C server URLs of Formbook.\nhxxp://www.mimihin[.]com/s32s/\nhxxp://www.cesiesis[.]com/rmpc/\nhxxp://www.hapocun[.]link/o09u/\nhxxp://www.redandseven[.]com/nhc5/\nhxxp://www.arches2[.]com/qbkr/\nhxxp://www.budistx[.]com/s9m1/\nhxxp://www.onegaitom[.]online/g2e7/\nTop 3 Lokibot\nLokibot ranked third place with 11.5%. It is an info-stealer that leaks information about programs such as web browsers, email clients, and FTP clients.\nBeing a malware that is distributed through spam emails, it shares similar file names with other malware spam emails.\norden de compra_pdf________________________________.exe\nPO 220803-04A.exe\nupdate status of order 07G050.exe\n193026588 Swift Copy.exe\nCRIBER-(P.O_H6790074)_scan0394.exe\nPO 3360.exe\nAs shown below, most Lokibot C&C server URLs tend to end in fre.php.\nhxxp://hstfurnaces[.]net/gd10/fre.php\nhxxp://nesofirenit[.]gq/stats/fre.php\nhxxp://chrisupdated[.]xyz/ttboi/five/fre.php\nhxxp://dfrcy[.]xyz/MV1/w2/fre.php\nhxxp://qtd8gcdoplav737wretjqmaiy[.]cf/Kent1/fre.php\nhxxp://75bccc18b4d1631c2ecda542c872db27[.]gq/BN1/fre.php\nhxxp://vmopahtqdf84hfvsqepalcbcch63gdyvah[.]ml/BN2/fre.php\nTop 4 BeamWinHTTP\nBeamWinHTTP is a downloader malware that ranked fourth place with 6.5%. BeamWinHTTP is distributed via malware disguised as PUP installer. When it is executed, it installs PUP malware Garbage Cleaner, and can download and install additional malware at the same time.\nRecently, there have been numerous cases of distribution by the dropper disguised as a software crack file. The ASEC analysis team is responding to this malware using the alias MulDrop. See the following blog post for more information on the malware.\nThe confirmed C&C server URL is as follows.\nhxxp://appwebstat[.]biz\nTop 5 RedLine\nRedLine ranked fifth place with 5.9%. The malware steals various information such as web browsers, FTP clients, cryptocurrency wallets, and PC settings. It can also download additional malware by receiving commands from the C&C server. Like BeamWinHTTP, there have been numerous cases of RedLine being distributed under the disguise of a software crack file.\nThe following are the confirmed C&C server domains for RedLine:\nf0642513.xsph[.]ru\n45.142.212[.]178\ndeyneyab[.]xyz\nrtrkolada[.]xyz\n5.206.227[.]11\nSubscribe to AhnLabs next-generation threat intelligence platform AhnLab TIP to check related IOC and detailed analysis information.\nCategories:Malware Information\nTagged as:weekly statistics"
        }
    },
    {
        "report": {
            "id": "report_0x699c64c4",
            "date": "20220320",
            "title": "ASEC Weekly Malware Statistics (March 7th, 2022 March 13th, 2022)",
            "url": "https://asec.ahnlab.com/en/32677"
        },
        "chapter": {
            "id": "chapter_0x4bf07ba2",
            "title": "ASEC Weekly Malware Statistics (March 7th, 2022 March 13th, 2022)",
            "text": "Posted on\nMarch 18, 2022"
        }
    }
]