[
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x6902750d",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "text": "Key Takeaways: An in-depth analysis of Midas and trends across other Thanos ransomware variants reveals how ransomware groups shifted tactics in 2021 to:\nlower sunk costs by using RaaS builders to reduce development time\nincrease payouts with double extortion tactics by using their own data leak sites\nextend the length and effectiveness of campaigns to get the highest investment returns by updating payloads and/or rebranding their own ransomware group\nAdvertised on the darkweb for Ransomware-as-a-Service (RaaS), Thanos ransomware was first identified in February 2020. Written in C# language running on the .net framework, this serious offender reboots systems in safeboot mode to bypass antivirus detection and includes a builder that enables threat actors to create new variants by customizing samples. Source code of Thanos builder also leaked and there are lots of different variants that have been seen based on that. Here we discuss the four 2021 variants shown in Figure 1 below that used double extortion tactics.\nFigure 1:Timeline of Thanos derived ransomware variations\nBeginning in February 2021, the Prometheus ransomware variant emerged as one of the new Thanos built variants of the year. It encrypts files and appends .[{ID}],.PROM[prometheushelp@mail{.}ch] , {ID}[prometheusdec@yahoo{.}com] extension and drop RESTORE_FILES_INFO.txt, RESTORE_FILES_INFO.hta ransom note. The Prometheus group which operates the variant has claimed to be part of the notorious REvil ransomware group responsible for the Kaseya supply chain attack, however experts doubt the claim as a solid connection between the two has never been established. This variant is known for using double extortion techniques to make organizations pay that include threatening to leak valuable data on their leak site. A quick check reveals that the leak site is currently down, but the threat still holds potential weight\nIn July 2021, another Thanos derived ransomware called Haron was discovered. It encrypts files and appends .{Targeted Company name} extension and drops RESTORE_FILES_INFO.hta,RESTORE_FILES_INFO.txt ransom note. Haron ransomware group also have their own data leak site used for double extortion. This variant has striking similarities with Avaddon ransomware based on examination of the ransom note and data leak site information.\nSeptember 2021, the Thanos builder was used again to develop the Spook ransomware variant. It encrypts files and appends .{ID} extension and drops RESTORE_FILES_INFO.hta,RESTORE_FILES_INFO.txt ransom note. Similar to the other variants, Spook ransomware also uses double extortion techniques with their own data leak site as shown in the screenshot below.\nRounding out the year in October 2021, another Thanos ransomware family emerged with the Midas variant that appends .{Targeted Company name} extension and drops RESTORE_FILES_INFO.hta and RESTORE_FILES_INFO.txt ransom note. In January 2022, ThreatLabz investigated a report of Midas ransomware being slowly deployed over a 2-month period and the attacker was observed using different powershell scripts, remote access tools and an open source windows utility.\nLike the others, Midas features its own data leak site for double extortion. Interestingly, the site contains leaked victim data from a Haron ransomware attack, suggesting to researchers that Midas is potentially linked to the Haron ransomware operators.\nFigure 2: Count of companies with leaked data by 2021 Thanos ransomware variants."
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x34e9f6ab",
            "title": "Identifying Thanos as the Source for the Prometheus, Haron, Spook, and Midas ransomware variants",
            "text": "Tracing the evolution of Thanos based ransomware variants back to the source provides threat researchers with an inside look at how ransomware gangs operate and evolve over time. To establish a connection between each variant, the ThreatLabz team looked for the use of common signatures and indicators that would point back to the Thanos ransomware builder. After determining that each variant was derived using the builder, the team set about analyzing the similarities and differences in the shifting techniques adversaries employ to make new variants of a common origin ransomware more effective. These observations help us to gain insights into the cooperation happening between adversary groups and better understand the development lifecycle and alternating impacts of ransomware through its variants.\nThe analysis that follows walks you through identifying Thanos variants through an examination of common signatures found in the ransom note key identifiers and the consistent use of a common file marker GotAllDone. Followed by an in-depth analysis of the latest Midas variant.\nIdentifying Thanos Variants\nAll four of the 2021 Thanos based ransomware variants contain a key identifier with common signatures for the Thanos builder found in the ransom notes as shown in Figure 3 below.\nFigure 3: Screenshots of ransom notes showing the common signature Key Identifier for 2021 Thanos ransomware variants: Prometheus, Haron, Spook and Midas.\nAnother similarity is that after encryption they append base 64 encoded key after encrypting data of every file. Prometheus, Haron, Spook, and Midasall contain the same FileMarker that is GotAllDone appended at the end of each encrypted file. Below screenshot displays the FileMarker info and Base64 encoded key appended after the data encrypted by Midas ransomware.\nFigure 4: Screenshots of FileMarker and Base64 encoded key appended"
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x96a12107",
            "title": "Midas Ransomware",
            "text": "The Midas data leak site currently displays data from 29 victim companies including data from several victims previously seen on the Haron data leak site which is now inactive.\nFigure 5: Screenshot of the Midas ransomware data leak site index page.\nFigure 6: Screenshot of victim companies listed on Midas ransomware data leak site."
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x3c485de1",
            "title": "Technical analysis",
            "text": "Midas ransomware is written in C# and obfuscated using smartassembly. Once executed this variant starts terminating processes using taskkill.exe. It terminates processes that inhibit encryption processes and processes related to security software, database related programs so it can encrypt more files. Below is a list of the common processes typically terminated by Thanos based ransomware.\nMost commonly terminated processes:\nIt also deletes the process, schedule task and registry related to the Raccine tool. It is a ransomware prevention tool that protects the system from ransomware processes to delete shadow copy.\nPrometheus, Haron, Spook and Midas have been seen terminating Raccine related artifacts.\nFigure 7: Command used to terminate Vaccine process and other artifacts.\nThe Midas variant is designed to stop service related to security products, database software, backups and email exchanges.\nList of most commonly disrupted services:\nAnother technique used by most variants of Thanos based ransomware is to evade detection by finding and terminating processes for analysis tools by searching the list of keywords shown below:\nFurther, it changes the configuration of specific services as shown below.\nFigure 8: Screenshot of service configuration changes.\nIt deletes shadow copy using powershell command so the system is unable to recover data.\nCommand : \"powershell.exe\" & Get-WmiObject Win32_Shadowcopy | ForEach-Object { $_Delete(); }",
            "table": "0;1;2\nhttp analyzer stand-alone;NetworkTrafficView;CFF Explorer\nfiddler;HTTPNetworkSniffer;protection_id\neffetech http sniffer;tcpdump;pe-sieve\nfiresheep;intercepter;MegaDumper\nIEWatch Professional;Intercepter-NG;UnConfuserEx\ndumpcap;ollydbg;Universal_Fixer\nwireshark;dnspy-x86;NoFuserEx\nwireshark portable;dotpeek;cheatengine\nsysinternals tcpview;dotpeek64;\nNetworkMiner;RDG Packer Detector;\n"
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0xf5702420",
            "title": "File Encryption",
            "text": "Midas ransomware searches through each drive and directory and encrypts the files. It creates a random key and encrypts a file using AES algorithm in CBC mode. Then the AES key is encrypted by the RSA public key as shown in the screenshot below. The encryption key is encoded in base64 and appended to each impacted file. It also added FileMarker GotAllDone at the end of each encrypted file. The encrypted key is also saved in the Registry under HKEY_CURRENT_USER\\SOFTWARE\\KEYID\\myKeyID. After encryption, it drops the reload1.lnk file to open a ransom note at every restart.\nPath: \"C:\\\\Users\\\\{Username}\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\reload1.lnk\".\nFigure 9: Screenshot of encrypting AES key with RSA public key.\nIt encrypts the file contained below extensions:\nAfter encryption it appends .{Targeted Company name} extension and drops RESTORE_FILES_INFO.hta and RESTORE_FILES_INFO.txt ransom note. Below is the screenshot of the ransom note. RESTORE_FILES_INFO.hta doesnt contain Key ID but RESTORE_FILES_INFO.txt contains key ID.\nFigure 10: Ransom note of Midas"
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x58364694",
            "title": "Cloud Sandbox Detection",
            "text": "Figure 11: Zscaler Cloud Sandbox detection of Midas ransomware\nIn addition to sandbox detections, Zscalers multilayered cloud security platform detects indicators at various levels.\nWin32.Ransom.Thanos\nWin32.Ransom.Prometheus\nWin32.Ransom.Spook\nWin32.Ransom.Haron\nWin32.Ransom.Midas"
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x49b0dc75",
            "title": "MITRE ATT&CK Technique",
            "text": "",
            "table": "0;1\nID;Technique\nT1059;Command and Scripting Interpreter\nT1569.002;Service Execution\nT1112;Modify Registry\nT1562.001;Disable or Modify Tools\nT1010;Application Window Discovery\nT1057;Process Discovery\nT1518.001;Security Software Discovery\nT1083;File and Directory Discovery\nT1490;Inhibit System Recovery\nT1489;Service Stop\nT1486;Data Encrypted for Impact\n"
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x50ce2508",
            "title": "IOC",
            "text": "MD5:3767a7d073f5d2729158578a7006e4c4\nSecurity Research\nInsights and Research\nRansomware"
        }
    },
    {
        "report": {
            "id": "report_0x9e4b0581",
            "date": "20220323",
            "title": "Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants. Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants.Midas Ransomware : Tracing the Evolution of Thanos Ransomware Variants",
            "url": "https://www.zscaler.com/blogs/security-research/midas-ransomware-tracing-evolution-thanos-ransomware-variants"
        },
        "chapter": {
            "id": "chapter_0x78831484",
            "title": "Rajdeepsinh Dodia",
            "text": ""
        }
    }
]