[
    {
        "report": {
            "id": "report_0x79aedc80",
            "date": "20220421",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners. A high number of exploitation attempts",
            "url": "https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html"
        },
        "chapter": {
            "id": "chapter_0xd5a5005c",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners",
            "text": "Recently, we observed attempts to exploit the Spring4Shell vulnerability a remote code execution bug, assigned as CVE-2022-22965 by malicious actors to deploy cryptocurrency miners.\nBy: Nitesh Surana, Ashish Verma\n\nApril 20, 2022\nRead time: 4 min (975 words)\nSave to Folio\nSubscribe\nTo generate more profit, operators of cryptocurrency miners constantly look for ways to deploy their malware on vulnerable machines. These often involve the exploitation of in-the-wild vulnerabilities in different types of operating systems. Recently, we observed active attempts to exploit the Spring4Shell vulnerability a remote code execution bug, assigned as CVE-2022-22965, that exists in the Spring MVC (model-view-controller) and WebFlux applications running on Java Development Kit version 9 or higher and that was previously linked to the Mirai botnet by malicious actors to deploy cryptocurrency miners.\nThese cryptocurrency miners have the potential to affect a large number of users, especially since Spring is the most widely used framework for developing enterprise-level applications in Java, with its open-source nature making it more readily adaptable for developers and companies. Furthermore, the Spring framework is not just a standalone piece of software but is part of the Spring ecosystem, which provides components for cloud, data, and security, among others.\nIn this blog entry, we look at how malicious actors exploit the vulnerability to deploy their cryptocurrency miners."
        }
    },
    {
        "report": {
            "id": "report_0x79aedc80",
            "date": "20220421",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners. A high number of exploitation attempts",
            "url": "https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html"
        },
        "chapter": {
            "id": "chapter_0x29fccdbd",
            "title": "A high number of exploitation attempts",
            "text": "Malicious actors have been busy trying to find ways to exploit Spring4Shell since its disclosure at the end of March 2022. The following figure shows the total number of attempts to exploit the vulnerability that we observed from April 1 to 12, 2022. At least 700 exploitation attempts were performed daily during this period, with a peak of nearly 3,000 exploitation attempts occurring on April 3.\nFigure 1. Attempts to exploit Spring4Shell that we observed from April 1 to 12, 2022"
        }
    },
    {
        "report": {
            "id": "report_0x79aedc80",
            "date": "20220421",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners. A high number of exploitation attempts",
            "url": "https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html"
        },
        "chapter": {
            "id": "chapter_0x7c43b5da",
            "title": "Creating the web shell",
            "text": "Among the exploitation attempts were ones aimed at deploying cryptocurrency miners. In this section, we look at how the malicious actors behind these exploitation attempts create a web shell to deploy their cryptocurrency miners.\nThe following code is used to create the web shell:\nThe web shells content is URL-encoded using the following code:\nAfter decoding, the resulting payload is a Spring4Shell web shell:"
        }
    },
    {
        "report": {
            "id": "report_0x79aedc80",
            "date": "20220421",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners. A high number of exploitation attempts",
            "url": "https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html"
        },
        "chapter": {
            "id": "chapter_0x41d46e83",
            "title": "How the payload is executed in a vulnerable system",
            "text": "Before executing the payload, the malicious actors first have to determine the operating system of the machine they are infecting. They do this using a string check to see if os.name contains the word ndo. If it does, then the machine is identified as Windows-based, otherwise the machine is identified as Linux-based.\nOnce the operating system is identified, the encoded payload is executed. The exploit uniform resource identifier (URI) containing the web shell path and parameters is shown in the following code:\nThe web shell is identified as zbc0fb.jsp, while the parameters w and l stand for, respectively, Windows and Linux payloads, which are Base64-encoded.\nPowerShell is then executed using the following parameters:\nNonI: Run noninteractive session.\nW: Hide WindowStyle.\nNoP: Prevent the PowerShell profile from loading.\nExec: Make bypassing the script execution policy in PowerShell possible.\nEnc: Implement the Base64-encoded command.\nFor Windows payloads, the following PowerShell command fetches the script ldr.ps1 and executes it within memory without having to create it on-disk:\nThe IP address and the port of the vulnerable server are also logged on the malicious actors infrastructure.\nThe following code shows ldr.ps1 and its execution flow specifically, the redacted PowerShell script that downloads the cryptocurrency miner and executes it. (A similar PowerShell script was previously reported by The DFIR Report.)\nThe execution flow of the cryptocurrency miner involves the following steps:\n1. The firewall is turned off using the netsh utility.\n2. Other known cryptocurrency miners such as kthreaddi, sysrv, and sysrv012 are stopped or killed.\n3. Other running processes listening on ports 3333, 4444, 5555, 7777, and 9000 are stopped.\n4. If the process kthreaddk does not exist, the cryptocurrency miner downloads a binary, sys.exe, from 194[.]145[.]227[.]21 to C:\\Users\\<user>\\AppData\\Roaming\\<random-6-to-12-letter-string>.exe.\n5. The cryptocurrency miner then starts the process with a hidden window to avoid having the user observe visual hints of the process being executed.\n6. A scheduled task with the name BrowserUpdate is created later, running every minute. In addition, the Windows run key is modified to run the binary sys.exe."
        }
    },
    {
        "report": {
            "id": "report_0x79aedc80",
            "date": "20220421",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners. A high number of exploitation attempts",
            "url": "https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html"
        },
        "chapter": {
            "id": "chapter_0xf0593bd3",
            "title": "Conclusion and security recommendations",
            "text": "We are unable confirm if the exploitation attempts we analyzed for this blog entry were successful. It should be noted that we also observed Linux payloads where the script ldr.sh attempts to stop other running cryptocurrency miners to run its own payload.\nWe highly encourage users of the Spring framework to update their software to 5.3.18 and 5.2.20 or later to prevent the exploitation of Spring4Shell (CVE-2022-22965) from occurring on their systems. More details on how Trend Micro technologies such as Trend Micro Cloud One protect users from attacks using this vulnerability can be found in our security bulletin."
        }
    },
    {
        "report": {
            "id": "report_0x79aedc80",
            "date": "20220421",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners. A high number of exploitation attempts",
            "url": "https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html"
        },
        "chapter": {
            "id": "chapter_0xf03cecbe",
            "title": "Indicators of compromise (IOCs)",
            "text": "Tags\nEndpoints\n|\nExploits & Vulnerabilities\n|\nResearch\n|\nArticles, News, Reports",
            "table": "0;1\nIP address;Detail\n194[.]145[.]227[.]21;Malware accomplice\n"
        }
    },
    {
        "report": {
            "id": "report_0x79aedc80",
            "date": "20220421",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners. A high number of exploitation attempts",
            "url": "https://www.trendmicro.com/en_us/research/22/d/spring4shell-exploited-to-deploy-cryptocurrency-miners.html"
        },
        "chapter": {
            "id": "chapter_0x122df308",
            "title": "Analyzing Attempts to Exploit the Spring4Shell Vulnerability CVE-2022-22965 to Deploy Cryptocurrency Miners",
            "text": "Exploits & Vulnerabilities"
        }
    }
]