[
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x94c63fdc",
            "title": "Campaign overview",
            "text": "A new Traffic Direction System (TDS) we are calling Parrot TDS, using tens of thousands of compromised websites, has emerged in recent months and is reaching users from around the world. The TDS has infected various web servers hosting more than 16,500 websites, ranging from adult content sites, personal websites, university sites, and local government sites.\nParrot TDS acts as a gateway for further malicious campaigns to reach potential victims. In this particular case, the infected sites appearances are altered by a campaign called FakeUpdate (also known as SocGholish), which uses JavaScript to display fake notices for users to update their browser, offering an update file for download. The file observed being delivered to victims is a remote access tool.\nThe newly discovered TDS is, in some aspects, similar to the Prometheus TDS that appeared in the spring of 2021 [1]. However, what makes Parrot TDS unique is its robustness and its huge reach, giving it the potential to infect millions of users. We identified increased activity of the Parrot TDS in February 2022 by detecting suspicious JavaScript files on compromised web servers. We analysed its behaviour and identified several versions, as well as several types of campaigns using Parrot TDS. Based on the appearance of the first samples and the registration date of the Command and Control (C2) domains it uses, Parrot TDS has been active since October 2021.\nOne of the main things that distinguishes Parrot TDS from other TDS is how widespread it is and how many potential victims it has. The compromised websites we found appear to have nothing in common apart from servers hosting poorly secured CMS sites, like WordPress sites. From March 1, 2022 to March 29, 2022, we protected more than 600,000 unique users from around the globe from visiting these infected sites. In this time frame, we protected the most users in Brazil, more than 73,000 unique users, India, nearly 55,000 unique users, and more than 31,000 unique users from the US.\nMap illustrating the countries Parrot TDS has targeted (in March)"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x9328ba87",
            "title": "Compromised Websites",
            "text": "In February 2022, we identified a significant increase in the number of websites that contained malicious JavaScript code. This code was appended to the end of almost all JavaScript on the compromised web servers we discovered. Over time, we identified two versions (proxied and direct) of what we are calling Parrot TDS.\nIn both cases, web servers with different content management systems (CMS) were compromised. Most often WordPress in various versions, including the latest one or Joomla, were affected. Since the compromised web servers have nothing in common, we assume the attackers took advantage of poorly secured servers, with weak login credentials, to gain admin access to the servers, but we do not have enough information to confirm this theory."
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x4953e06f",
            "title": "Identified Campaigns",
            "text": "The Parrot TDS response is JavaScript code that is executed on the client. In general, this code can be arbitrary and exposes clients to further danger. However, in practice, we have seen only two types of responses. The first, shown below, is simply setting the __utma cookie on the client. This happens when the client should not be redirected to the landing page. Due to the cookie-based user filtering mentioned above, this step effectively prevents repeated requests on Parrot TDS C2 servers in the future.\nBenign Parrot TDS C2 Response\nThe next code snippet shows the second type, which is a campaign redirection targeting Windows machines.\nMalicious Parrot TDS C2 Response"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x9933ade1",
            "title": "Conclusion and Recommendation",
            "text": "We have identified an extensive infrastructure of compromised web servers that served as TDS and put a large number of users at risk. Given that the attacker had almost unlimited access to tens of thousands of web servers, the above list of campaigns is undoubtedly not exhaustive.\nThe Avast Threat Labs has several recommendations for developers to avoid their servers from being compromised.\nScan all files on the web server with Avast Antivirus.\nReplace all JavaScript and PHP files on the web server with original ones.\nUse the latest CMS version.\nUse the latest versions of installed plugins.\nCheck for automatically running tasks on the web server (for example, cron jobs).\nCheck and set up secure credentials. Make sure to always use unique credentials for every service.\nCheck the administrator accounts on the server. Make sure each of them belongs to you and have strong passwords.\nWhen applicable, set up 2FA for all the web server admin accounts.\nUse some of the available security plugins (WordPress, Joomla)."
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x41ad0bc0",
            "title": "Indicators of Compromise (IoC)",
            "text": "Repository:"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0xdaaadc90",
            "title": "Parrot TDS takes over web servers and threatens millions",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x66f9a527",
            "title": "Proxied Version",
            "text": "The proxied version communicates with the TDS infrastructure via a malicious PHP script, usually located on the same web server, and executes the response content. A deobfuscated code snippet of the proxied version is shown below.\nMalicious JavaScript Code\nThis code performs basic user filtering based on the User-Agent string, cookies and referrer. Briefly said, this code contacts the TDS only once for each user who visits the infected page. This type of filtering prevents multiple repeating requests and possible server overload.\nThe aforementioned PHP script serves two purposes. The first is to extract client information like the IP address, referrer and cookies, forward the request from the victim to the Parrot TDS C2 server and send the response in the other direction.\nThe second functionality allows an attacker to perform arbitrary code execution on the web server by sending a specifically crafted request, effectively creating a backdoor. The PHP script uses different names and is located in different locations, but usually, its name corresponds to the name of the folder it is in (hence the name of the TDS, since it parrots the names of folders).\nIn several cases, we also identified a traditional web shell on the infected web servers, which was located in various locations under different names but still following the same parroting pattern. This web shell likely allowed the attacker more comfortable access to the server, while the backdoor in the PHP script mentioned above was used as a backup option. An example of a web shell identified on one of the compromised web servers is shown below.\nTraditional web shell GUI\nSince we have seen several cases of reinfection, it is highly likely that the server automatically restores possibly deleted files using, for example, a cron job. However, we do not have enough information to confirm this theory."
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0xf298bb4f",
            "title": "Direct Version",
            "text": "The direct version is almost identical to the previous one. This version utilises the same filtering technique. However, it sends the request directly to the TDS C2 server and, unlike the previous version, omits the malicious backdoor PHP script. It executes the content of the response the same way as the previous version. The whole communication sequence of both versions is depicted below. We experimentally verified that the TDS redirects from one IP address only once.\nInfection chain sequence diagram"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x4638e740",
            "title": "FakeUpdate Campaign",
            "text": "The most prevalent customer of Parrot TDS we saw in the wild was the FakeUpdate campaign. The previous version of this campaign was described by MalwareBytes Lab in 2018 [2]. Although the version we identified slightly differs from the 2018 version, the core remains the same. The user receives JavaScript that changes the appearance of the page and tries to force the user to download malicious code. An example of what such a page looks like is shown below.\nFakeUpdate Campaign\nThis JavaScript also contains a Base64 encoded ZIP file with one malicious JavaScript file inside. Once the user downloads the ZIP file and executes the JavaScript it contains, the code starts fingerprinting the client in several stages and then delivers the final payload."
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0xd13a7844",
            "title": "User Filtering",
            "text": "The entire infection chain is set up so that it is complicated to replicate and, therefore, to investigate it. Parrot TDS provides the first layer of defence, which filters users based on IP address, User-Agent and referrer.\nThe FakeUpdate campaign provides the second layer of defence, using several mechanisms. The first is using unique URLs that deliver malicious content to only one specific user.\nThe last defence mechanism is scanning the users PC. This scan is performed by several JavaScript codes sent by the FakeUpdate C2 server to the user. This scan harvests the following information.\nName of the PC\nUser name\nDomain name\nManufacturer\nModel\nBIOS version\nAntivirus and antispyware products\nMAC address\nList of processes\nOS version\nAn overview of the process is shown in the picture below. The first part represents the Parrot TDS filtering based on the IP address, referrer and cookies, and after the user successfully passes these tests, the FakeUpdate page appears. The second part represents the FakeUpdate filtering based on a scan of the victims device.\nOverview of the filtering process"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x258f4317",
            "title": "Final Payload",
            "text": "The final payload is then delivered in two phases. In the first phase, a PowerShell script is dropped and run by the malicious JavaScript code. This PowerShell script is downloaded to a temporary folder under a random eight character name (e.g. %Temp%\\1c017f89.ps1). However, the name of this PowerShell is hardcoded in the JavaScript code. The content of this script is usually a simple whoami /all command. The result is sent back to the C2 server.\nIn the second phase, the final payload is delivered. This payload is downloaded to the AppData\\Roaming folder. Here, a folder with a random name containing several files is dropped. The payloads we have observed so far are part of the NetSupport Client remote access tool and allow the attacker to gain easy access to the compromised machines [3].\nThe RAT is commonly named ctfmon.exe (mimicking the name of a legitimate program). It is also automatically started when the computer is switched on by setting an HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run registry key.\nNetSupport mimicking the name of a legitimate Microsoft service\nNetSupport Client Installed on the compromised machine\nThe installed NetSupport Manager tool is configured so that the user has very little chance of noticing it and, at the same time, gives the attacker maximum opportunities. The tool basically gives the attacker full access to the victims machine. To run unnoticed, chat functions are disabled, and the silent option is set on the tool, for example. A gateway is also set up that allows the attacker to connect to the client from anywhere in the world. So far, weve seen Chinese domains in the tools configuration files used as gateways. The following picture below shows the client settings.\nNetSupport Client Settings"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x5d305dca",
            "title": "Phishing",
            "text": "We identified several infected servers hosting phishing sites. These phishing sites, imitating, for example, a Microsoft office login page, were hosted on compromised servers in the form of PHP scripts. The figure below shows the aforementioned Microsoft phishing observed on an otherwise legitimate site. We dont have enough information to assign this to Parrot TDS directly. However, a significant number of the compromised servers contained phishing as well.\nMicrosoft Phishing hosted on the compromised web server"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x72c20f5a",
            "title": "Parrot TDS",
            "text": "* In attempts to prevent further attacks onto the infected servers, we are providing this hash on demand. Please DM us on Twitter or reach us out at ti@avast.com.",
            "table": "0\nC&C Servers\nclickstat360[.]com\nstatclick[.]net\nstaticvisit[.]net\nwebcachespace[.]net\nsyncadv[.]com\nwebcachestorage[.]com\n"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x90834319",
            "title": "FakeUpdate",
            "text": "* Delivering the final payload",
            "table": "0;1;2\nC&C Servers;;\nparmsplace[.]com;ahrealestatepr[.]com;expresswayautopr[.]com\nxomosagency[.]com;codigodebarra[.]co;craigconnors[.]com\nlawrencetravelco[.]com;maxxcorp[.]net;2ctmedia[.]com\naccountablitypartner[.]com;walmyrivera[.]com;youbyashboutique[.]com\nweightlossihp[.]com;codingbit[.]co[.]in;fishslayerjigco[.]com\navanzatechnicalsolutions[.]com;srkpc[.]com;wholesalerandy[.]com\nmattingsolutions[.]co;integrativehealthpartners[.]com;wwpcrisis[.]com\nlilscrambler[.]com;markbrey[.]com;nuwealthmedia[.]com\npocketstay[.]com;fioressence[.]com;drpease[.]com\nrefinedwebs[.]com;spillpalletonline[.]com;altcoinfan[.]com\nwindsorbongvape[.]com;hill-family[.]us;109.234.35[.]249\n141.136.35[.]157;91.219.236[.]192  *;91.219.236[.]202  *\n"
        }
    },
    {
        "report": {
            "id": "report_0x7c14f4ba",
            "date": "20220407",
            "title": "Parrot TDS takes over web servers and threatens millions. Campaign overview",
            "url": "https://decoded.avast.io/janrubin/parrot-tds-takes-over-web-servers-and-threatens-millions/?utm_source=rss&utm_medium=rss&utm_campaign=parrot-tds-takes-over-web-servers-and-threatens-millions"
        },
        "chapter": {
            "id": "chapter_0x3cd35cd6",
            "title": "NetSupport RAT",
            "text": "**xxx stands for the random string name",
            "table": "0\nC&C\n194.180.158[.]173\n87.120.8[.]141\n15.76.172[.]110\n45.76.172[.]113\n5.180.136[.]119\n94.158.247[.]84\n94.158.245[.]113\n94.158.247[.]100\n154.38.242[.]14\n199.247.3[.]55\n"
        }
    }
]