[
    {
        "report": {
            "id": "report_0x762c0a47",
            "date": "20220405",
            "title": "Malicious Word Documents Using MS Media Player (Impersonating AhnLab)",
            "url": "https://asec.ahnlab.com/en/33477"
        },
        "chapter": {
            "id": "chapter_0x18bb20b8",
            "title": "Malicious Word Documents Using MS Media Player (Impersonating AhnLab)",
            "text": "Last week, the ASEC analysis team uploaded a post named Malicious Word File Targeting Corporate Users Being Distributed that contained information about a malicious Word file. Currently, documents of the same type are being distributed with text that impersonates AhnLab. The Word files confirmed this time download another Word file containing malicious VBA macro via the external URL and run it. Another difference is that the additionally downloaded Word file uses the Windows Media Player() function instead of AutoOpen() to automatically run the VBA macro. It appears the attackers adopted a measure to bypass anti-malware products that detect automatic execution of the AutoOpen() function-based macro.\nThe confirmed filenames are as follows:\nNFT split.docx\n202203_BTC_ETH_additional account info.docx\nComplaint for fund-raising business without permission.docx\nFund-raising without permission.docx\nBTC_ETH automated trading account info.docx\nCryptocurrency_investment plan.docx\nUpon running the Word file, a Word macro (dotm) file is downloaded via the external URL in the word\\_rels\\settings.xml.rels file and executed.\nFigure 1. Inside settings.xml.rels\nFigure 2. Word file attempting to access external URL\nThe downloaded file contains a macro as shown below. The attacker inserted an image and text to prompt users to press Enable Content.\nFigure 3. Word file content\nWhen users click Enable Content, the malicious VBA macro that exists inside the externally-downloaded Word file is run.\nThe macro is written using the WindowsMediaPlayer1_OpenStateChange() function instead of AutoOpen() that was used in the previously detected Word documents. This function is executed when the openState property of the Windows Media Player object changes. When it is run, it performs malicious activities via the RunFE() function just like in previous cases. The following shows a part of the VBA macro code.\nOpening the Word document downloaded through the external URL shows Windows Media Player within the file. The file contains Windows Media Player named WindowsMediaPlayer1 as shown below.\nFigure 4. Inside the additionally downloaded Word file\nThe attacker enabled the AutoPlay option for the Player so that the WindowsMediaPlayer1_OpenStateChange() function is automatically run. When the Player is run, WindowsMediaPlayer1_OpenStateChange() inside the VBA macro is executed, commencing malicious activities even if the user does not perform additional tasks for the Player. Ultimately, as the attacker set the Player to run automatically, the malicious macro is automatically run when the user clicks the Enable Content button.\nFigure 5. Inside word\\activeX\\activeX1.xml\nFigure 6. WindowsMediaPlayer1s properties\nMalicious activities that are performed by the macro code are the same as those explained in the previous blog post. It downloads additional malware that suits the users PC environment and runs it after injecting it into the Word process.\nDownload URL\nX86 environment: hxxp://ZVc1ijAU.naveicoipc[.]tech/ACMS/0lvNAK1t/0lvNAK1t32.acm\nX64 environment: hxxp://ZVc1ijAU.naveicoipc[.]tech/ACMS/0lvNAK1t/0lvNAK1t64.acm\nAfterward, it drops USOService.exe into the %ProgramData%\\USOShared\\Logs folder and runs it. Then it adds the file as HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\WUService registry so that it can be continuously run.\nFigure 7. Created executable\nThe dotm file that was downloaded from the external URL of the additionally confirmed Word document Complaint for fund-raising business without permission.docx creates the message box shown below if the macro is enabled. The Word file creates a malicious file named UpdateChecker.exe into the \\AppData\\Local\\Microsoft\\Office\\ folder. It seems that the attacker drops malware in various folders including the %ProgramData% folder.\nFigure 8. Message box that appears when successfully accessing download URL\nFigure 9. Message box that appears when failed to access download URL\nAttacks using Word files are being continuously discovered recently. As seen from the cases impersonating AhnLab to prompt users to enable macros, the attackers are using various images and content to trick people. One should take caution when enabling content for the file.\nAhnLabs anti-malware software, V3, is currently detecting and blocking the files using the following aliases.\n[File Detection]\nDownloader/DOC.Akdoor\nDownloadaer/XML.Generic\nTrojan/Win.Generic.C5025270\n[IOC]\nce00749c908de017010055a83ac0654f\n783e7c3ba39daa28301b841785794d76\n2fec0c6ff8af4484471633aeaa1c9996\n6df608342938f0d30a058c48bb9d8d4d\nhxxp://ZVc1ijAU.naveicoipc[.]tech/ACMS/0lvNAK1t/0lvNAK1t32.acm\nhxxp://ZVc1ijAU.naveicoipc[.]tech/ACMS/0lvNAK1t/0lvNAK1t64.acm\nhxxp://naveicoipc[.]tech/ACMS/0nXbQs2e/topAccounts?uid=rt6i45sd\nhxxp://naveicoipd[.]tech/ACMS/018ueCdS/blockchainTemplate\nhxxp://bcvbert.naveicoipe[.]tech/ACMS/01AweT9Z/wwwTemplate?uid=glvrdta\nhxxp://wrhehdfg.naveicoipe[.]tech/ACMS/0TQyKdO9/accountTemplate0330?vvvid=rehs4344s\nhxxp://msldkopw.naveicoipe[.]tech/ACMS/0TQyKdO9/accountTemplate03301?vvvid=zxzdfherh\nhxxp://uktyukb.naveicoipe[.]tech/ACMS/0TQyKdO9/accountTemplate03304?vvvid=cvnrturr\nhxxp://gowelknx.naveicoipf[.]online/ACMS/07RRwrwK/securityTemplate0?securityID=ffsdwiefwe\nhxxp://xjowihgnxcvb.naveicoipf[.]online/ACMS/07RRwrwK/securityTemplate3?securityID=cbvkoweoigwk\nSubscribe to AhnLabs next-generation threat intelligence platform AhnLab TIP to check related IOC and detailed analysis information.\nCategories:Malware Information\nTagged as:VBA Macro, Word"
        }
    },
    {
        "report": {
            "id": "report_0x762c0a47",
            "date": "20220405",
            "title": "Malicious Word Documents Using MS Media Player (Impersonating AhnLab)",
            "url": "https://asec.ahnlab.com/en/33477"
        },
        "chapter": {
            "id": "chapter_0x5ed1001d",
            "title": "Malicious Word Documents Using MS Media Player (Impersonating AhnLab)",
            "text": "Posted on\nApril 5, 2022"
        }
    }
]