[
    {
        "report": {
            "id": "report_0xd395c2a8",
            "date": "20220419",
            "title": "Managed SOC Vs Managed XDR Part 2",
            "url": "https://www.rewterz.com/articles/managed-soc-vs-managed-xdr-part-2"
        },
        "chapter": {
            "id": "chapter_0x7445756c",
            "title": "Managed SOC Vs Managed XDR Part 2",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0xd395c2a8",
            "date": "20220419",
            "title": "Managed SOC Vs Managed XDR Part 2",
            "url": "https://www.rewterz.com/articles/managed-soc-vs-managed-xdr-part-2"
        },
        "chapter": {
            "id": "chapter_0x80b74cc4",
            "title": "Managed XDR A quick rundown:",
            "text": "We saw a basic outline of what a security operations center (SOC) is and the challenges of SOC teams in the first part of this blog series. In this part, well take a look at the XDR solution and how this solution fills the gap or cover the pitfalls of SOC.\nManaged XDR extends Managed Detection & Response (MDR) services throughout the organization to provide a fully managed solution that encompasses security analytics and operations, enhanced threat hunting, detection, and quick response across endpoint, network, and cloud environments."
        }
    },
    {
        "report": {
            "id": "report_0xd395c2a8",
            "date": "20220419",
            "title": "Managed SOC Vs Managed XDR Part 2",
            "url": "https://www.rewterz.com/articles/managed-soc-vs-managed-xdr-part-2"
        },
        "chapter": {
            "id": "chapter_0x5c1a78d6",
            "title": "XDR: a new & mature shape to security",
            "text": "The XDR platform significantly enhances your cybersecurity posture while also assisting you in maximizing the return on your security efforts.\nIt provides improved prevention capabilities, effective response, granular visibility, and better productivity. XDR assists security teams in the following ways:\nIdentify complex or hidden threats\nTrack threats across multiple system components\nEnhance detection and response rate\nAnalyze threats more effectively and efficiently"
        }
    },
    {
        "report": {
            "id": "report_0xd395c2a8",
            "date": "20220419",
            "title": "Managed SOC Vs Managed XDR Part 2",
            "url": "https://www.rewterz.com/articles/managed-soc-vs-managed-xdr-part-2"
        },
        "chapter": {
            "id": "chapter_0xc911b45e",
            "title": "Features Of an XDR",
            "text": "Dashboard\nThe Managed XDR provides a central dashboard that displays a prioritized list of suspicious activities and susceptible setups that need to be addressed immediately. The prioritized list allows administrators to focus on the most serious concerns and spend less time researching low-risk incidents. Suspicious actions are rated according to their seriousness. The timing of the event, related processes, executed command lines, file hashes, device, user, and more are all visible on the dashboard. Dashboards are beneficial because they make it simple to take additional action when diving into the specifics of a suspicious item by providing a context-aware list of further inquiry alternatives and rapid measures. A single-pane-of-glass view to all analytics also reduces the screen fatigue in analysts that arises from switching between multiple software and windows.\nAutomation\nThe Managed XDR solution provides SOC with automated and orchestrated malware prevention, threat detection, and response. It uses automated correlation and machine learning to reveal malicious behaviors that are difficult to detect, saving security staff time when spotting possible issues and detecting the full of an attack chain. Automated playbooks make manual labor obsolete as the menial tasks and alerts are generated automatically to make the life of analysts easier.\nMean Time\nManaged XDR gives insight into Indicators of Compromise (IOCs) and breaches, allowing organizations to detect more subtle signals of a potential compromise sooner, without wasting time triaging alerts or investigating false positives. This enables security teams to minimize their average response time and reduce the mean time to respond (MTTR).\nThreat Intelligence\nManaged XDR delivers the comprehensive context required for an attack-centric view of an entire chain of events across security layers by leveraging powerful analytics and threat intelligence.\nIt combines network visibility and data analytics throughout the whole network infrastructure of a company. It provides the context needed for analysts to discover advanced threats on the network.\nCompanies can improve SOC performance and boost their capacity to discover and attack the worst of the worst threat actors with XDRs combination of threat intelligence, automation, and machine learning.\nRemediation\nManaged XDR also offers consolidated and efficient incident response and remediation capabilities across the corporate networks environments. This enables security analysts to respond quickly and effectively to mass attacks against the company, lowering the total impact and expense of the incident. It offers 247 alert monitoring, investigation, remediation, and response backed by resources and expertise.\nPart 3 coming next week: Why Choose Managed XDR For Managed SOC?"
        }
    }
]