[
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xdff441c1",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x6488e9b1",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "text": "15 March 2022\n/\nBotnet"
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xd9cc2ae4",
            "title": "Background",
            "text": "Since the Log4J vulnerability was exposed, we see more and more malware jumped on the wagon, Elknot, Gafgyt, Mirai are all too familiar, on February 9, 2022, 360Netlab's honeypot system captured an unknown ELF file propagating through the Log4J vulnerability. What stands out is that the network traffic generated by this sample triggered a DNS Tunnel alert in our system, We decided to take a close look, and indeed, it is a new botnet family, which we named B1txor20 based on its propagation using the file name \"b1t\", the XOR encryption algorithm, and the RC4 algorithm key length of 20 bytes.\nIn short, B1txor20 is a Backdoor for the Linux platform, which uses DNS Tunnel technology to build C2 communication channels. In addition to the traditional backdoor functions, B1txor20 also has functions such as opening Socket5 proxy and remotely downloading and installing Rootkit.\nAnother interesting point is that we found that many developed features are not put into use (in IDA, there is no cross-reference); some features have bugs. we presume that the author of B1txor20 will continue to improve and open different features according to different scenarios, so maybe we will meet B1txor20's siblings in the future."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xdf6e4c7f",
            "title": "B1txor20 Overview",
            "text": "We have captured a total of four different B1txor20 samples, their functions are almost the same, a total of 15 function numbers are supported, according to these functions, B1txor20 can be characterized as: using DNS Tunnel to establish C2 channel, support direct connection and relay, while using ZLIB compression, RC4 encryption, BASE64 encodingto protect the traffic of the backdoor Trojan, mainly targets ARM, X64 CPU architecture of the Linux platform.\nThe main features currently supported are shown below.\nSHELL\nProxy\nExecute arbitrary commands\nInstall Rootkit\nUpload sensitive information\nIts basic flowchart is shown below."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x783926a4",
            "title": "Reverse Analysis",
            "text": "We choose the sample on February 09, 2022 as the main object of analysis, and its basic information is shown as follows.\nThe sample of B1txor20 is dynamically linked, so it is relatively easy to reverse. Simply put, when B1txor20 executes, it will first disguise itself as a [netns] process, run a single instance through the PID file/var/run/.netns.pid, and then use /etc/machine-id, /tmp/.138171241 or /dev/urandom to generate the BotID, then decrypt the domain name used for DNS Tunnel and the RC4 secret key used to encrypt the traffic and test the connectivity of the DNS server, and finally use DNS Tunnel to send registration information to C2 and wait for the execution of the commands issued by C2. Here we will not go into details about the regular functions, we will take a look at the DNS Tunnel implementation of the B1txor20."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x93af5ad2",
            "title": "Generating Bot ID",
            "text": "B1txor20 uses the following code snippet to read 32 bytes from /etc/machine-id, or /tmp/.138171241, for generating BotId, and if it fails, a 16 bytes of data will be generated via /dev/urandom and will be written to the previous 2 files.\nThe following code snippet shows the process of BotId calculation.\nTaking the machine-id valueab3b49d10ec42c38b1093b8ce9ad12afof our VM as an example, the following equivalent python code can be used to calculate the value of BotId as 0x125d."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x1618cf80",
            "title": "Decryption",
            "text": "B1txor20 decrypts the domain name and RC4 secret key stored in the sample with the following code snippet.\nIts principle is very simple, it is a single-byte xor operation, where xor_key is49 D3 4F A7 A2 BC 4D FA 40 CF A6 32 31 E9 59 A1.\nThe decryption process is equivalent to the CyberChef implementation in the following figure, which shows that the domain name is.dns.webserv.systems and the RC4 secret key is EnLgLKHhy20f8A1dX85l."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x4234618e",
            "title": "Measure the connectivity of DNS servers",
            "text": "B1txor20 tests the connectivity of 3 DNS (8.8.8.8:53, 8.8.8.4:53, 194.165.16.24:443) servers with the following code snippet.\nThe principle is to use res_mkquery API to build the DNS request message for \"google.com\", then send the request via res_send, and as long as it can be sent successfully, the network is considered to be connected to the corresponding DNS server, and they are saved for subsequent use.\nThe actual traffic generated by Bot and 194.165.16.24 is as follows."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xb7f767f7",
            "title": "C&C Communication",
            "text": "When the above preparations are completed, B1txor20 enters the final stage, using DNS Tunnel to establish communication with C2 and wait for the execution of the commands sent by C2.\nGenerally speaking, the scenario of malware using DNS Tunnel is as follows:\nBot sends the stolen sensitive information, command execution results, and any other information that needs to be delivered, after hiding it using specific encoding techniques, to C2 as a DNS request; After receiving the request, C2 sends the payload to the Bot side as a response to the DNS request. In this way, Bot and C2 achieve communication with the help of DNS protocol.\nIn such a network structure, there are 3 key points:\n1:C2 must support the DNS protocol\n2: Specific encoding techniques\n3: The way DNS requests are sent\nThe following section will analyze the technical details of B1txor20's communication around these points, in conjunction with the traffic generated by B1txor20 in practice."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xfda32d87",
            "title": "0x01:Locating C2",
            "text": "Through the traffic in the above figure, we can see that the SLD used by B1txor20 is webserv.systems, and using the DIG command, we can see that this SLD is point to IP 194.165.16.24; and the DNS resolution service is turned on at this IP 194, so we can determine that the C2 of B1txor20 is exactly 194.165.16.24."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x33a67a71",
            "title": "0x02:Generate Tunnel domain name",
            "text": "The format of B1txor20's Tunnel domain name isBase64-Like String+.dns.websrv.systems. It is obvious that the front Base64 string is the information sent by Bot to C2, how is it generated?\nFirst, the B1txor20 packet has a pre-construction process, which can be seen in the format of0xFF + BotId + 0xFF + Stage + 0xFF + TaskInfo, 0xFF is used to separate different items, and when the construction is finished, according to different Stage values, different tasks will fill theTaskInfosection accordingly.\nTake the above task as an example, the Stage value is 1. Through the gather_info function, the information of \"sysinfo_uptime,uid,hostname\" is filled into TaskInfo, and they are separated by0x0a.\nWhen the required information is ready, B1txor20 uses theprocess_queryfunction to further process the above information, which includes three processes: ZLIB compression, RC4 encryption, and Base64 encoding.\nThe secret key used in RC4 encryption is the string \"EnLgLKHhy20f8A1dX85l\" mentioned in the previous decryption section, and the Alphabet String used in Base64 is ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789^_.\nFinally, B1txor20 adds 1 byte of status and 4 bytes of random string before the Base64 string generated above, and then splices it with domain, which is the final domain name to be queried. The value of status is ['0', '1', '2'], 0 means that the current query is truncated, the subsequent query and the current should be spelled into the same; 1 means that when the query is complete.\nLet's take a look at the actual generated query 1HQoOKPvBKs8yqO1tTUQkCqGWN9anB4RAGWhnJy8A.dns.webserv.systems, removing the first 5 bytes, and the .dns.webserv.systems part to get KPvBKs8yqO1tTUQkCqGWN9anB4RAGWhnJy8A, then use Base64 decoding, RC4 decryption, ZLIB decompression, you can get the following raw data.\nFrom the data content and format, it can correspond with our previous description one by one, indicating that our previous analysis is correct."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x15d0e0cb",
            "title": "0x3:Send DNS request",
            "text": "When the above domain name construction is complete, B1txor20 generates and sends DNS requests using the RES series API.\nThere are 3 ways to send DNS requests, depending on the previous test of DNS connectivity.\n1.Send to public dns (8.8.8.8, 8.8.4.4)\n2.Send directly to C2 (194.165.16.24)\n3.Send to local dns (nameserver in /etc/resolv.conf)\nIn this way, it is faster, but less concealed and easy to be detected and traced; in this way, 1 and 3 are more concealed, but a little slower."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xd4c3ac5e",
            "title": "0x4:Process C2 payload",
            "text": "After the Bot sends the DNS request in the above way, it waits for the execution of the C2 instruction, which is stored in the response message of the DNS request in the format of Status(1 byte):Body, where the Body part also uses \"ZLIB compression, RC4 encryption, BASE64 encoding \" protection method.\nFor example, the actual command \"1VSE6NZwczNMm2zgaXeLkZro=\" is received in the following figure.\nBody part for \"VSE6NZwczNMm2zgaXeLkZro=\", After decoded by Base64, RC4 decryption, you can get the following format of data, and then decompression of thered part, you get the final instruction FF 02 FF 0A FF, you can see that its format and the format generated by the above query is consistent, at this point it can be known that Bot will go to perform 0x02 function, so that Bot's round of interaction with C2 is complete."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x64a18d6b",
            "title": "C&C instructions",
            "text": "B1txor20 supports a total of 14 instructions, and the correspondence between instruction number and function is shown in the following table.\nIn the table, \"Not used\" means that this function has the corresponding processing code in the sample, but it is not called. We are not sure if these codes are used for debugging or in other scenarios.\nWe found that some functions are buggy in their implementation, such as 0x3, which uses the remove function to delete the socket file after bind the domain socket, which makes the socket unconnectable and thus the whole function is useless.",
            "table": "Cmd ID;Function\n0x1;Beacon/Heartbeat\n0x2;Upload system info\n0x3;\"Create \"\"/dev/pamd\"\" (unix domain socket) which can get a shell\"\n0x4;Exec arbitrary system cmd via popen\n0x5;Traffic forwarding\n0x6;Write File\n0x7;Read File\n0x8;\"Deliver info via \"\"/var/tmp/.unetns\"\"(unix domain socket)，Not used\"\n0x9;Upload specific info，Not used\n0x10;Stop proxy service\n0x11;Start proxy service\n0x1a;Create proxy service\n0x21;Reverse shell\n0x50;\"Upload \"\"/boot/conf- XXX\"\" info，Not used\"\n0x51;install M3T4M0RPH1N3.ko rootkit\n"
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xf1cd4dbf",
            "title": "Small note",
            "text": "We noticed the domain name has been registered for 6 years, which is kind unusual?"
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x4169c480",
            "title": "Contact us",
            "text": "Readers are always welcomed to reach us on Twitter or email us to netlab at 360 dot cn."
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x597c715a",
            "title": "IOC",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x7acbc169",
            "title": "C2",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0xcbda5c00",
            "title": "Scanner",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x9eb87fbd",
            "title": "Downloader",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x1383ae23",
            "date": "20220320",
            "title": "New Threat: B1txor20, A Linux Backdoor Using DNS Tunnel",
            "url": "https://blog.netlab.360.com/b1txor20-use-of-dns-tunneling_en"
        },
        "chapter": {
            "id": "chapter_0x227d5a96",
            "title": "Sample MD5",
            "text": "This post was a collaboration between\nAlex.Turing, Hui Wang\nAlex.Turing Read more posts by this author.\nHui Wang Read more posts by this author."
        }
    }
]