{
    "id": "<report_0x3b62ba23>",
    "url": "https://cybersecurity.att.com/blogs/security-essentials/stories-from-the-soc-command-and-control",
    "title": "Stories from the SOC - Command and Control",
    "meta": [
        {
            "id": "<chapter_0x25251556>",
            "title": "Stories from the SOC - Command and Control",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0x78b48889>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "May 9, 2022 |",
                    "html": "\nMay 9, 2022 | "
                },
                {
                    "id": "<sentence_0x2d8c400e>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x9371bd11>": "https://cybersecurity.att.com/blogs/author/robert-dean"
                    },
                    "text": "Robert Dean",
                    "html": "<a href=\"/blogs/author/robert-dean\">Robert Dean</a>"
                },
                {
                    "id": "<sentence_0xe6f4ef52>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Executive summary",
                    "html": "<p>Executive summary</p>"
                },
                {
                    "id": "<sentence_0x1f4d7f6>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Investigation",
                    "html": "<p>Investigation</p>"
                },
                {
                    "id": "<sentence_0xf6cdd61d>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Initial alarm review",
                    "html": "<p>Initial alarm review</p>"
                },
                {
                    "id": "<sentence_0x924e2732>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Indicators of Compromise (IOC)",
                    "html": "<p>Indicators of Compromise (IOC)</p>"
                },
                {
                    "id": "<sentence_0x4e8b7eea>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Expanded investigation",
                    "html": "<p>Expanded investigation</p>"
                },
                {
                    "id": "<sentence_0x8057ee7>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Events search",
                    "html": "<p>Events search</p>"
                },
                {
                    "id": "<sentence_0xf69d3b32>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Response",
                    "html": "<p>Response</p>"
                },
                {
                    "id": "<sentence_0x83e819e3>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Building the investigation",
                    "html": "<p>Building the investigation</p>"
                },
                {
                    "id": "<sentence_0xaab8dc63>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Customer interaction",
                    "html": "<p>Customer interaction</p>"
                },
                {
                    "id": "<sentence_0xcc40fc09>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Limitations and opportunities",
                    "html": "<p>Limitations and opportunities</p>"
                },
                {
                    "id": "<sentence_0x7ffe7f45>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Limitations",
                    "html": "<p>Limitations</p>"
                },
                {
                    "id": "<sentence_0x931ed12e>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Opportunities",
                    "html": "<p>Opportunities</p>"
                }
            ]
        }
    ],
    "chapters": [
        {
            "id": "<chapter_0x409fa5cf>",
            "title": "Stories from the SOC - Command and Control",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0x9a1b421e>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xb7d12b2a>": "https://cybersecurity.att.com/solutions/extended-detection-and-response"
                    },
                    "text": "Stories from the SOC is a blog series that describes recent real-world security incident investigations conducted and reported by the AT&T SOC analyst team for AT&T Managed Extended Detection and Response customers.",
                    "html": "<p>Stories from the SOC is a blog series that describes recent real-world security incident investigations conducted and reported by the AT&amp;T SOC analyst team for <a href=\"https://cybersecurity.att.com/solutions/extended-detection-and-response\" target=\"_blank\">AT&amp;T Managed Extended Detection and Response</a> customers.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x97bd0c58>",
            "title": "Executive summary",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0xc8dd7dd8>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xe1c1ef4a>": "https://attack.mitre.org/tactics/TA0011/"
                    },
                    "text": "Once a malicious actor has gained initial access to an internal asset, they may attempt to conduct command and control activity. The Command and Control (C&C) tactic, as identified by the MITRE ATT&CK Framework, consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Cobalt Strike is an effective adversary simulation tool used in security assessments but has been abused by malicious actors for Command and Control of victim networks. If configured by attackers, it can be used to deploy malicious software, execute scripts, and more.",
                    "html": "<p>Once a malicious actor has gained initial access to an internal asset, they may attempt to conduct command and control activity. The ‘<a href=\"https://attack.mitre.org/tactics/TA0011/\" rel=\"noopener\" target=\"_blank\">Command and Control’</a> (C&amp;C) tactic, as identified by the MITRE ATT&amp;CK© Framework, consists “of techniques that adversaries may use to communicate with systems under their control within a victim network.” Cobalt Strike is an effective adversary simulation tool used in security assessments but has been abused by malicious actors for Command and Control of victim networks. If configured by attackers, it can be used to deploy malicious software, execute scripts, and more.</p>"
                },
                {
                    "id": "<sentence_0xd3f93c1b>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "This investigation began when the Managed Extended Detection and Response (MXDR) analyst team received multiple alarms involving the detection of Cobalt Strike on an internal customer asset. Within ten minutes of this activity, the attacker launched a Meterpreter reverse shell and successfully installed remote access tools Atera and Splashtop Streamer on the asset. These actions allowed the attacker to establish multiple channels of command and control. In response, the MXDR team created an investigation and informed the customer of this activity. The customer determined that an endpoint detection and response (EDR) agent was not running on this asset, which could have prevented this attack from occurring. This threat was remediated by isolating the asset and scanning it with SentinelOne to remove indicators of compromise. Additionally, Cobalt Strike, Atera, and Splashtop Streamer were added to SentinelOnes blacklist to prevent unauthorized execution of this software in the customer environment.",
                    "html": "<p>This investigation began when the Managed Extended Detection and Response (MXDR) analyst team received multiple alarms involving the detection of Cobalt Strike on an internal customer asset. Within ten minutes of this activity, the attacker launched a Meterpreter reverse shell and successfully installed remote access tools Atera and Splashtop Streamer on the asset. These actions allowed the attacker to establish multiple channels of command and control. In response, the MXDR team created an investigation and informed the customer of this activity. The customer determined that an endpoint detection and response (EDR) agent was not running on this asset, which could have prevented this attack from occurring. This threat was remediated by isolating the asset and scanning it with SentinelOne to remove indicators of compromise. Additionally, Cobalt Strike, Atera, and Splashtop Streamer were added to SentinelOne’s blacklist to prevent unauthorized execution of this software in the customer environment.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x19811a11>",
            "title": "Investigation",
            "title_level": 2,
            "sentences": []
        },
        {
            "id": "<chapter_0x29e14634>",
            "title": "Initial alarm review",
            "title_level": 3,
            "sentences": []
        },
        {
            "id": "<chapter_0x72e14bc3>",
            "title": "Indicators of Compromise (IOC)",
            "title_level": 4,
            "sentences": [
                {
                    "id": "<sentence_0x3490b5a0>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x732721bc>": "https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Behavior:Win32/CobaltStrike.E!sms&threatId=-2147190355"
                    },
                    "text": "An initial alarm was triggered by a Windows Defender detection of Cobalt Strike on an internal customer asset. The associated log was provided to USM Anywhere using NXLog and was detected using a Windows Defender signature. Multiple processes related to Cobalt Strike were attached to this alarm.",
                    "html": "<p>An initial alarm was triggered by a Windows Defender detection of Cobalt Strike on an internal customer asset. The associated log was provided to USM Anywhere using NXLog and was detected using a Windows Defender <a href=\"https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Behavior:Win32/CobaltStrike.E!sms&amp;threatId=-2147190355\" rel=\"noopener\" target=\"_blank\">signature</a>. Multiple processes related to Cobalt Strike were attached to this alarm.</p>"
                },
                {
                    "id": "<sentence_0x518e8087>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<p><img alt=\"\"/></p>"
                },
                {
                    "id": "<sentence_0x9a60bb00>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Cobalt Strike, as mentioned previously, is a legitimate security tool that can be abused by malicious actors for Command and Control of compromised machines. In this instance, a Cobalt Strike beacon was installed on the compromised asset to communicate with the attackers infrastructure. Windows Defender took action to prevent these processes from running.",
                    "html": "<p>Cobalt Strike, as mentioned previously, is a legitimate security tool that can be abused by malicious actors for Command and Control of compromised machines. In this instance, a Cobalt Strike beacon was installed on the compromised asset to communicate with the attacker’s infrastructure. Windows Defender took action to prevent these processes from running.</p>"
                },
                {
                    "id": "<sentence_0xeb53d185>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Immediately following the Cobalt Strike detection, an additional alarm was triggered for a Meterpreter reverse shell.",
                    "html": "<p>Immediately following the Cobalt Strike detection, an additional alarm was triggered for a Meterpreter reverse shell.</p>"
                },
                {
                    "id": "<sentence_0x48080f27>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<p><img alt=\"Meterpreter\"/></p>"
                },
                {
                    "id": "<sentence_0x2706bc24>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "A Meterpreter reverse shell is a component of the Metasploit Framework and requires the attacker to set up a remote listener on their own infrastructure that listens for connections. Upon successful exploitation, the victim machine connects to this remote listener, establishing a channel for the attacker to send malicious commands. A Meterpreter reverse shell can be used to allow an attacker to upload files to the victim machine, record user keystrokes, and more. In this instance, Windows Defender also took action to prevent this process from running.",
                    "html": "<p>A Meterpreter reverse shell is a component of the Metasploit Framework and requires the attacker to set up a remote ‘listener’ on their own infrastructure that ‘listens’ for connections. Upon successful exploitation, the victim machine connects to this remote listener, establishing a channel for the attacker to send malicious commands. A Meterpreter reverse shell can be used to allow an attacker to upload files to the victim machine, record user keystrokes, and more. In this instance, Windows Defender also took action to prevent this process from running.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xb5b80ae1>",
            "title": "Expanded investigation",
            "title_level": 3,
            "sentences": []
        },
        {
            "id": "<chapter_0x561c8072>",
            "title": "Events search",
            "title_level": 4,
            "sentences": [
                {
                    "id": "<sentence_0x47e4dc99>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "During post-exploitation, an attacker may leverage scheduled tasks to run periodically, disable antivirus, or configure malicious applications to execute during startup. To query for this activity, specific event names, such as Windows Autostart Location, New Scheduled Task, and events containing Windows Defender, were added to a filter in USM Anywhere. An additional filter was applied to display events occurring in the last 24 hours. This expanded event search provided context into attacker activity around the time of the initial Cobalt Strike and Meterpreter alarms.",
                    "html": "<p>During post-exploitation, an attacker may leverage scheduled tasks to run periodically, disable antivirus, or configure malicious applications to execute during startup. To query for this activity, specific event names, such as ‘Windows Autostart Location’, ‘New Scheduled Task’, and events containing ‘Windows Defender’, were added to a filter in USM Anywhere. An additional filter was applied to display events occurring in the last 24 hours. This expanded event search provided context into attacker activity around the time of the initial Cobalt Strike and Meterpreter alarms.</p>"
                },
                {
                    "id": "<sentence_0x2ac2c76d>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<p><img alt=\"context for Cobalt Strike\"/></p>"
                },
                {
                    "id": "<sentence_0x8960123c>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Event deep dive",
                    "html": "<p>Event deep dive</p>"
                },
                {
                    "id": "<sentence_0xecd56e8>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Just after the Cobalt Strike and Meterpreter detections, a scheduled task was created named Monitoring Recovery. This task is identified by Windows Event ID 106:",
                    "html": "<p>Just after the Cobalt Strike and Meterpreter detections, a scheduled task was created named “Monitoring Recovery.” This task is identified by Windows Event ID 106:\n<img alt=\"log Cobalt Strike\"/></p>"
                },
                {
                    "id": "<sentence_0x90eec5c3>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "This scheduled task was used to install two remote monitoring and management (RMM) applications: Atera and Splashtop Streamer.<crlf>Shortly after this task was created and executed, an event was received indicating AteraAgent.exe was added as a Windows auto-start service.",
                    "html": "<p>This scheduled task was used to install two remote monitoring and management (RMM) applications: Atera and Splashtop Streamer.\nShortly after this task was created and executed, an event was received indicating “AteraAgent.exe” was added as a Windows auto-start service.\n<img alt=\"AlteraAgent\"/></p>"
                },
                {
                    "id": "<sentence_0xb92ee1f1>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "AteraAgent.exe is associated with Atera, a legitimate computer management application that allows for remote access, management, and monitoring of computer systems, but has been abused by attackers for command and control of compromised systems.",
                    "html": "<p>AteraAgent.exe is associated with Atera, a legitimate computer management application that allows for remote access, management, and monitoring of computer systems, but has been abused by attackers for command and control of compromised systems.</p>"
                },
                {
                    "id": "<sentence_0xabe37acc>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x9f1da03f>": "https://attack.mitre.org/tactics/TA0003/"
                    },
                    "text": "This change was followed by an event involving SRService.exe being added as a Windows auto-start service on this asset:<crlf>SRService.exe is associated with Splashtop Streamer Service, a remote access application commonly used by IT support, also abused by attackers for C&C communications.<crlf>At this point, the attacker attempted to create multiple channels for command and control using Cobalt Strike, Meterpreter, Atera, and Splashtop Streamer. While the Cobalt Strike and Meterpreter sessions were terminated by Windows Defender, Atera and Spashtop Streamer were successfully added as startup tasks. This allowed the attacker to establish persistence in the customer environment. Persistence, as identified by the MITRE ATT&CK framework, allows the attacker to maintain access to systems across restarts, changed credentials, and other interruptions that could cut off their access.",
                    "html": "<p>This change was followed by an event involving “SRService.exe” being added as a Windows auto-start service on this asset:\n<img alt=\"SRServer\"/>\nSRService.exe is associated with Splashtop Streamer Service, a remote access application commonly used by IT support, also abused by attackers for C&amp;C communications.\nAt this point, the attacker attempted to create multiple channels for command and control using Cobalt Strike, Meterpreter, Atera, and Splashtop Streamer. While the Cobalt Strike and Meterpreter sessions were terminated by Windows Defender, Atera and Spashtop Streamer were successfully added as startup tasks. This allowed the attacker to establish persistence in the customer environment. <a href=\"https://attack.mitre.org/tactics/TA0003/\" rel=\"noopener\" target=\"_blank\">Persistence</a>, as identified by the MITRE ATT&amp;CK framework, allows the attacker to maintain “access to systems across restarts, changed credentials, and other interruptions that could cut off their access.”</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x7992750f>",
            "title": "Response",
            "title_level": 2,
            "sentences": []
        },
        {
            "id": "<chapter_0x2b347a43>",
            "title": "Building the investigation",
            "title_level": 3,
            "sentences": [
                {
                    "id": "<sentence_0x75efe54>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "All alarms and events were carefully recorded in an investigation created in USM Anywhere. The customer was immediately contacted regarding this compromise, which lead to an all-hands-on-deck call to remediate this threat. This compromise was escalated to the customers Threat Hunter, as well as management and Tier 2 analysts.",
                    "html": "<p>All alarms and events were carefully recorded in an investigation created in USM Anywhere. The customer was immediately contacted regarding this compromise, which lead to an ‘all-hands-on-deck’ call to remediate this threat. This compromise was escalated to the customer’s Threat Hunter, as well as management and Tier 2 analysts.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x521911e0>",
            "title": "Customer interaction",
            "title_level": 3,
            "sentences": [
                {
                    "id": "<sentence_0xcb793794>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "The MXDR team worked directly with the customer to contain and remediate this threat. This asset was quarantined from the customer network where it was scanned for malicious indicators using SentinelOne. The customer installed the SentinelOne EDR agent on this asset to protect it from any current threats. Additionally, the unauthorized applications Cobalt Strike, Meterpreter, Atera, and Splashtop Streamer were added to SentinelOnes blacklist to prevent future execution of these programs in the customer environment.",
                    "html": "<p>The MXDR team worked directly with the customer to contain and remediate this threat. This asset was quarantined from the customer network where it was scanned for malicious indicators using SentinelOne. The customer installed the SentinelOne EDR agent on this asset to protect it from any current threats. Additionally, the unauthorized applications Cobalt Strike, Meterpreter, Atera, and Splashtop Streamer were added to SentinelOne’s blacklist to prevent future execution of these programs in the customer environment.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xf57a0faa>",
            "title": "Limitations and opportunities",
            "title_level": 2,
            "sentences": []
        },
        {
            "id": "<chapter_0x5264a9cc>",
            "title": "Limitations",
            "title_level": 3,
            "sentences": [
                {
                    "id": "<sentence_0xbffea933>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "While this compromise was quickly detected and contained, the customer lacked the protection required to prevent the applications Atera and Splashtop Steamer from being installed and added as Windows auto-start programs.",
                    "html": "<p>While this compromise was quickly detected and contained, the customer lacked the protection required to prevent the applications Atera and Splashtop Steamer from being installed and added as Windows auto-start programs.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xfc982838>",
            "title": "Opportunities",
            "title_level": 3,
            "sentences": [
                {
                    "id": "<sentence_0x34de6e3c>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "To protect an enterprise network from current threats, a multi-layered approach must be taken, otherwise known as Defense in Depth. This entails multiple layers of protection, including Endpoint Detection and Response, implementation of a SIEM (Security Information and Event Management System), and additional security controls. With the addition of an EDR agent installed on this asset, this malicious behavior would have been prevented. AT&Ts Managed Endpoint Security (MES) provides endpoint detection and response and can be utilized along with USM Anywhere to actively detect, prevent, and notify the customer of malicious activity in their environment.",
                    "html": "<p>To protect an enterprise network from current threats, a multi-layered approach must be taken, otherwise known as ‘Defense in Depth.’ This entails multiple layers of protection, including Endpoint Detection and Response, implementation of a SIEM (Security Information and Event Management System), and additional security controls. With the addition of an EDR agent installed on this asset, this malicious behavior would have been prevented. AT&amp;T’s Managed Endpoint Security (MES) provides endpoint detection and response and can be utilized along with USM Anywhere to actively detect, prevent, and notify the customer of malicious activity in their environment.</p>"
                }
            ]
        }
    ]
}