{
    "id": "<report_0xa0c02cc9>",
    "url": "https://pylos.co/2022/04/23/industroyer2-in-perspective",
    "title": "Industroyer2 in Perspective. Background",
    "meta": [],
    "chapters": [
        {
            "id": "<chapter_0x9ca916a4>",
            "title": "Background",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0x4492566>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x34e99bfc>": "https://cert.gov.ua/article/39518",
                        "<a_0x3feadb56>": "https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/",
                        "<a_0x164fd3a8>": "https://www.dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf"
                    },
                    "text": "On 12 April 2022, the Ukrainian CERT and ESET disclosed the existence of Industroyer2, a successor to the malware targeting Ukrainian electric distribution and transmission operations in 2016. Industroyer2 arrived after multiple disruptive cyber incidents of varying degrees of success surrounding Russias brutal invasion of Ukraine, as presented in the following timeline:",
                    "html": "<p>On 12 April 2022, the <a href=\"https://cert.gov.ua/article/39518\">Ukrainian CERT</a> and <a href=\"https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/\">ESET</a> disclosed the existence of Industroyer2, a successor to the <a href=\"https://www.dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf\">malware targeting Ukrainian electric distribution and transmission operations in 2016</a>. Industroyer2 arrived after multiple disruptive cyber incidents of varying degrees of success surrounding Russia’s brutal invasion of Ukraine, as presented in the following timeline:</p>"
                },
                {
                    "id": "<sentence_0xd08d9cd0>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x56a1091d>": "https://pylos.co/2022/02/25/contextualizing-cyber-components-in-conventional-conflict/",
                        "<img_0x6e45d587>": "https://lh5.googleusercontent.com/fn-DjaI5OTJcyuatUH7y-ucK-PcBobXVQwNXYKP4vclJiHCdHqbgfmMzS7Jf3M7Nb9zC050bph3KISKiDzbBScnyH60u8h2XxBDNp7Zwos793UM4xYkvlVASCUka4YAfeRSwrI_v"
                    },
                    "text": "Overall, cyber operations targeting Ukraine have ranged from the merely annoying (DDoS) to quite concerning (Industroyer2). Fully contextualizing events will take time and the release of additional information, evidence, and technical background, although some preliminary observations are possible. In the case of Industroyer, we have several mysteries to contend with:",
                    "html": "<p>Overall, cyber operations targeting Ukraine have ranged from the “merely annoying” (DDoS) to “quite concerning” (Industroyer2). Fully contextualizing events will take time and the release of additional information, evidence, and technical background, <a href=\"https://pylos.co/2022/02/25/contextualizing-cyber-components-in-conventional-conflict/\">although some preliminary observations are possible</a>. In the case of Industroyer, we have several mysteries to contend with:<img height=\"813\" src=\"https://lh5.googleusercontent.com/fn-DjaI5OTJcyuatUH7y-ucK-PcBobXVQwNXYKP4vclJiHCdHqbgfmMzS7Jf3M7Nb9zC050bph3KISKiDzbBScnyH60u8h2XxBDNp7Zwos793UM4xYkvlVASCUka4YAfeRSwrI_v\" width=\"624\"/></p>"
                },
                {
                    "id": "<sentence_0xf2be0918>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x6f74869e>": "https://www.technologyreview.com/2022/04/12/1049586/russian-hackers-tried-to-bring-down-ukraines-power-grid-to-help-the-invasion/",
                        "<a_0x3517641f>": "https://twitter.com/dsszzi/status/1517828908284002304?s=20&t=BT4Eqqdlc5SYhVJik_a70Q"
                    },
                    "text": "Leaked reporting indicating potentially successful disruptive events in mid-March, prior to the known Industroyer2 compilation date, across multiple substations.<crlf>The overall timing of Industroyer2 events, well after the start of hostilities (and as Russian performance continued to deteriorate across its invasion).<crlf>Reporting from Ukrainian authorities indicating attempted disruptive operations are quite widespread and may even be ongoing after the Industroyer2 disclosure.",
                    "html": "<ul><li><a href=\"https://www.technologyreview.com/2022/04/12/1049586/russian-hackers-tried-to-bring-down-ukraines-power-grid-to-help-the-invasion/\">Leaked reporting</a> indicating potentially successful disruptive events in mid-March, prior to the known Industroyer2 compilation date, across multiple substations.</li><li>The overall timing of Industroyer2 events, well after the start of hostilities (and as Russian performance continued to deteriorate across its invasion).</li><li><a href=\"https://twitter.com/dsszzi/status/1517828908284002304?s=20&amp;t=BT4Eqqdlc5SYhVJik_a70Q\">Reporting from Ukrainian authorities</a> indicating attempted disruptive operations are quite widespread and may even be ongoing after the Industroyer2 disclosure.</li></ul>"
                },
                {
                    "id": "<sentence_0x69fb5d8a>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "There are many threads to pull to evaluate the Industroyer2 incident, given limited reporting but also the existence of samples in commercial malware repositories. While much remains to be uncovered with events, sufficient information is available at this time to draw some preliminary conclusions and set events in context with the current situation in Ukraine, as well as previous operations.",
                    "html": "<p>There are many threads to pull to evaluate the Industroyer2 incident, given limited reporting but also the existence of samples in commercial malware repositories. While much remains to be uncovered with events, sufficient information is available at this time to draw some preliminary conclusions and set events in context with the current situation in Ukraine, as well as previous operations.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xcb73b958>",
            "title": "Industroyer2 and Past Events",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0xabd7238e>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xc5b100ce>": "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2016/05/20081514/E-ISAC_SANS_Ukraine_DUC_5.pdf"
                    },
                    "text": "Industroyer2 represents the third (but presumably unsuccessful) electric power event targeting Ukrainian civilian infrastructure. The first such event took place in 2015, when three distribution substations were targeted through a combination of direct interaction with operator control systems and a SCADA hijack scenario to open breakers to disrupt the flow of electricity. The disruption was quickly followed by a wiper deployed to operator workstations, as well as disruption to control center Uninterrupted Power Supply (UPS) systems and deploying a malicious firmware update to serial-to-ethernet devices to effectively brick the systems. This also coincided with a DoS to utility telephone lines inhibiting the ability of customers to report outages to operators.",
                    "html": "<p>Industroyer2 represents the third (but presumably unsuccessful) electric power event targeting Ukrainian civilian infrastructure. <a href=\"https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2016/05/20081514/E-ISAC_SANS_Ukraine_DUC_5.pdf\">The first such event took place in 2015</a>, when three distribution substations were targeted through a combination of direct interaction with operator control systems and a “SCADA hijack” scenario to open breakers to disrupt the flow of electricity. The disruption was quickly followed by a wiper deployed to operator workstations, as well as disruption to control center Uninterrupted Power Supply (UPS) systems and deploying a malicious firmware update to serial-to-ethernet devices to effectively “brick” the systems. This also coincided with a DoS to utility telephone lines inhibiting the ability of customers to report outages to operators.</p>"
                },
                {
                    "id": "<sentence_0xcc3552c0>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "The event resulted in an outage lasting several hours impacting over 200,000 customers. Overall, the 2015 event appears to be a success, in terms of the capabilities deployed resulting in an impact scenario commensurate with tools used. While Ukrainian operators were able to restore operations relatively quickly by manually reclosing breakers, anecdotal evidence indicates the system wiping and effective destruction of serial-to-ethernet converters produced damage taking years to effectively correct.",
                    "html": "<p>The event resulted in an outage lasting several hours impacting over 200,000 customers. Overall, the 2015 event appears to be a “success,” in terms of the capabilities deployed resulting in an impact scenario commensurate with tools used. While Ukrainian operators were able to restore operations relatively quickly by manually reclosing breakers, anecdotal evidence indicates the system wiping and effective destruction of serial-to-ethernet converters produced damage taking years to effectively correct.</p>"
                },
                {
                    "id": "<sentence_0xc62d2157>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xe610c30a>": "https://www.welivesecurity.com/wp-content/uploads/2017/06/Win32_Industroyer.pdf",
                        "<a_0xfba54b71>": "https://www.dragos.com/wp-content/uploads/CrashOverride-01.pdf",
                        "<a_0x164fd3a8>": "https://www.dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf",
                        "<a_0x59bc7b1a>": "https://www.dragos.com/wp-content/uploads/Past-and-Future-of-Integrity-Based-ICS-Attacks.pdf"
                    },
                    "text": "The 2015 event was followed roughly a year later by another incident, this time using power system-specific malware referred to as Industroyer or CRASHOVERRIDE. In 2016, a transmission substation was targeted, providing for a potentially larger impact scenario than the 2015 event. However, as detailed in analysis in 2019, the first Industroyer event appears to have been very ambitious as an integrity- and protection-targeting industrial incident, but also a failure due to various mistakes in designing and deploying tools for the (attempted) disruption. Thus the 2016 event resulted in relatively less-significant impact than 2015, largely due to errors on the part of the attackers.",
                    "html": "<p>The 2015 event was followed roughly a year later by another incident, this time using power system-specific malware referred to as <a href=\"https://www.welivesecurity.com/wp-content/uploads/2017/06/Win32_Industroyer.pdf\">Industroyer</a> or <a href=\"https://www.dragos.com/wp-content/uploads/CrashOverride-01.pdf\">CRASHOVERRIDE</a>. In 2016, a transmission substation was targeted, providing for a potentially larger impact scenario than the 2015 event. However, as <a href=\"https://www.dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf\">detailed in analysis in 2019</a>, the first Industroyer event appears to have been very ambitious as an<a href=\"https://www.dragos.com/wp-content/uploads/Past-and-Future-of-Integrity-Based-ICS-Attacks.pdf\"> integrity- and protection-targeting industrial incident</a>, but also a failure due to various mistakes in designing and deploying tools for the (attempted) disruption. Thus the 2016 event resulted in relatively less-significant impact than 2015, largely due to errors on the part of the attackers.</p>"
                },
                {
                    "id": "<sentence_0xc5e03c9d>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xbd6a7665>": "https://www.youtube.com/watch?v=KTczBtb2ReU",
                        "<a_0xaa284616>": "https://www.ipcomm.de/protocol/IEC104/en/sheet.html",
                        "<img_0xbbd425e9>": "https://lh6.googleusercontent.com/Eb5JACFOXGLhYbs7g4glSuMzxN873Tjm70x82LXBZA7yp5_HG5_d5_8CR3t2rYheb-ggGATLH4vLlm5kb-jI6_VmxBV1ByrhriI7IfLWdD51-I8hmXLMIUw2u7BH2f0rNPC9EENs"
                    },
                    "text": "Industroyer2 appears to have learned some lessons from the 2016 incident. As detailed in public presentations, the IEC-104 manipulation module for the original Industroyer failed due to programmatic errors and ignoring proper state change requirements for proper protocol communication. Shown in the following packet capture, Industroyer2 appears to properly implement the IEC-104 protocol in following appropriate state transitions. While findings are preliminary and complete assessment would require testing on equipment similar to what was targeted in victim environments, preliminary analysis would indicate the attackers paid attention to past failures and implemented corrections in their code.",
                    "html": "<p>Industroyer2 appears to have learned some lessons from the 2016 incident. <a href=\"https://www.youtube.com/watch?v=KTczBtb2ReU\">As detailed in public presentations</a>, the <a href=\"https://www.ipcomm.de/protocol/IEC104/en/sheet.html\">IEC-104</a> manipulation module for the original Industroyer failed due to programmatic errors and ignoring proper state change requirements for proper protocol communication. Shown in the following packet capture, Industroyer2 appears to properly implement the IEC-104 protocol in following appropriate state transitions. While findings are preliminary and complete assessment would require testing on equipment similar to what was targeted in victim environments, preliminary analysis would indicate the attackers paid attention to past failures and implemented corrections in their code.<img height=\"328\" src=\"https://lh6.googleusercontent.com/Eb5JACFOXGLhYbs7g4glSuMzxN873Tjm70x82LXBZA7yp5_HG5_d5_8CR3t2rYheb-ggGATLH4vLlm5kb-jI6_VmxBV1ByrhriI7IfLWdD51-I8hmXLMIUw2u7BH2f0rNPC9EENs\" width=\"624\"/></p>"
                },
                {
                    "id": "<sentence_0x4b1b8aa>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "However, other aspects of Industroyer2 are significantly different than past incidents. While several wipers are associated with Industroyer2s deployment, preliminary analysis from ESET and CERT-UA assesses this was likely for destroying intrusion artifacts and evidence, with limited targeting of non-Windows systems that has not yet been thoroughly evaluated in terms of impact and likely adversary intent. Lacking from this event are the sort of physically destructive applications, such as the serial-to-ethernet converter targeting or the attempted removal of line protection in 2016.",
                    "html": "<p>However, other aspects of Industroyer2 are significantly different than past incidents. While several wipers are associated with Industroyer2’s deployment, preliminary analysis from ESET and CERT-UA assesses this was likely for destroying intrusion artifacts and evidence, with limited targeting of non-Windows systems that has not yet been thoroughly evaluated in terms of impact and likely adversary intent. Lacking from this event are the sort of physically destructive applications, such as the serial-to-ethernet converter targeting or the attempted removal of line protection in 2016. </p>"
                },
                {
                    "id": "<sentence_0xc7a6e461>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xa17ca33f>": "https://www.wired.com/story/sandworm-russia-ukraine-blackout-gru/"
                    },
                    "text": "Given currently-available evidence, it would appear that the 2022 attempt, although potentially of much wider scope (up to two million potentially impacted customers, based on Ukrainian assessment), was also potentially less destructive than prior activity. Precisely why this is the case is unknown. Some possibilities include:",
                    "html": "<p>Given currently-available evidence, it would appear that the 2022 attempt, although potentially of much wider scope (<a href=\"https://www.wired.com/story/sandworm-russia-ukraine-blackout-gru/\">up to two million potentially impacted customers</a>, based on Ukrainian assessment), was also potentially less destructive than prior activity. Precisely why this is the case is unknown. Some possibilities include:</p>"
                },
                {
                    "id": "<sentence_0x5d17d380>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Desire on the part of Russian decision-makers to enable relatively quick restoration of the impacted sites as part of an invasion plan.<crlf>Inability to develop a suitable physical destruction capability for the targeted substations in time for deployment because of a rushed decision-making process.<crlf>Failure to deploy a destructive capability because the attack was interrupted by Ukrainian defenders before an impact could occur.",
                    "html": "<ol><li>Desire on the part of Russian decision-makers to enable relatively quick restoration of the impacted sites as part of an invasion plan.</li><li>Inability to develop a suitable physical destruction capability for the targeted substations in time for deployment because of a “rushed” decision-making process.</li><li>Failure to deploy a destructive capability because the attack was interrupted by Ukrainian defenders before an impact could occur.</li></ol>"
                },
                {
                    "id": "<sentence_0xb9961578>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Each of these possibilities require more evidence to evaluate, although the first might be possible to examine if the targeted sites were disclosed. For example, if the sites were tightly correlated with Russian invasion lines of (attempted) advance, having a way to restore electricity service but disrupting it during operations might make sense. The other two possibilities will require information not likely to be available for some time in order to properly assess.",
                    "html": "<p>Each of these possibilities require more evidence to evaluate, although the first might be possible to examine if the targeted sites were disclosed. For example, if the sites were tightly correlated with Russian invasion lines of (attempted) advance, having a way to restore electricity service but disrupting it during operations might make sense. The other two possibilities will require information not likely to be available for some time in order to properly assess.</p>"
                },
                {
                    "id": "<sentence_0x8fde298b>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "In any case, Industroyer2 appears to represent both an advance from earlier operations, in that industrial communication seems to be properly implemented, and a step back in terms of hard-coded configurations (making each sample unique to its victim site) and lack of a post-disruption destructive element.",
                    "html": "<p>In any case, Industroyer2 appears to represent both an advance from earlier operations, in that industrial communication seems to be properly implemented, and a step back in terms of hard-coded configurations (making each sample unique to its victim site) and lack of a post-disruption destructive element.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xf186246f>",
            "title": "BlackEnergy3 Connections",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0xf368200d>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "One curious aspect of Industroyer2 concerns service names used during execution in deployment. In analysis of non-public samples published by ESET and analysis of different (but apparently functionally equivalent) samples in commercial malware repositories, the following set of strings are present for targeting purposes:",
                    "html": "<p>One curious aspect of Industroyer2 concerns service names used during execution in deployment. In analysis of non-public samples published by ESET and analysis of different (but apparently functionally equivalent) samples in commercial malware repositories, the following set of strings are present for targeting purposes:</p>"
                },
                {
                    "id": "<sentence_0xc86f52fe>",
                    "is_empty": true,
                    "have_tags": true,
                    "tags": {
                        "<img_0xb9eb60fb>": "https://i0.wp.com/pylos.co/wp-content/uploads/2022/04/image.png?resize=687%2C187&ssl=1"
                    },
                    "text": "",
                    "html": "<figure class=\"wp-block-image size-full\"><img alt=\"\" class=\"wp-image-644\" height=\"187\" src=\"https://i0.wp.com/pylos.co/wp-content/uploads/2022/04/image.png?resize=687%2C187&amp;ssl=1\" width=\"687\"/></figure>"
                },
                {
                    "id": "<sentence_0x9734200>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xb4383eae>": "https://nsarchive.gwu.edu/sites/default/files/documents/4164304/Department-of-Homeland-Security-NCCIS-ICS-CERT.pdf"
                    },
                    "text": "While seemingly innocuous, those with good memories (or a bit of search engine skill) can rapidly identify where this name PService_PPD.exe previously appeared: in past reporting on BlackEnergy3 use in connection with the 2015 Ukraine power event.",
                    "html": "<p>While seemingly innocuous, those with good memories (or a bit of search engine skill) can rapidly identify where this name – PService_PPD.exe – previously appeared: <a href=\"https://nsarchive.gwu.edu/sites/default/files/documents/4164304/Department-of-Homeland-Security-NCCIS-ICS-CERT.pdf\">in past reporting on BlackEnergy3 use</a> in connection with the 2015 Ukraine power event.</p>"
                },
                {
                    "id": "<sentence_0xdff5b899>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x20a3d95b>": "https://www.mandiant.com/resources/attackers-deploy-new-ics-attack-framework-triton",
                        "<img_0x3bab2de7>": "https://lh4.googleusercontent.com/YL7iImqaZWfvAdubCAu-288z8RI8lXUX1MEcqCHAWzhktW86lwdVoIGlm9h8qKv3NGmbvtby9ruEmeuWHjkmwYTahwDXAz6bh81rZUPPpEfDcTtUBrU2Bf4Q6EE3k0xldALyh7Xi"
                    },
                    "text": "While BlackEnergy3 is not industrial-specific in the same sense as either Industroyer variant or other items such as Triton, it did serve a critical enabling function as part of the overall attack sequence leading up to power disruption. The name has no other significance or notable observations beyond this context.",
                    "html": "<p>While BlackEnergy3 is not “industrial-specific” in the same sense as either Industroyer variant or other items such as <a href=\"https://www.mandiant.com/resources/attackers-deploy-new-ics-attack-framework-triton\">Triton</a>, it did serve a critical enabling function as part of the overall attack sequence leading up to power disruption. The name has no other significance or notable observations beyond this context.<img height=\"783\" src=\"https://lh4.googleusercontent.com/YL7iImqaZWfvAdubCAu-288z8RI8lXUX1MEcqCHAWzhktW86lwdVoIGlm9h8qKv3NGmbvtby9ruEmeuWHjkmwYTahwDXAz6bh81rZUPPpEfDcTtUBrU2Bf4Q6EE3k0xldALyh7Xi\" width=\"624\"/></p>"
                },
                {
                    "id": "<sentence_0xf7adda73>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x1d538d5a>": "https://attack.mitre.org/groups/G0034/",
                        "<a_0xb9747706>": "https://www.justice.gov/opa/pr/six-russian-gru-officers-charged-connection-worldwide-deployment-destructive-malware-and",
                        "<a_0x7e16cefd>": "https://www.mandiant.com/resources/ukraine-and-sandworm-team",
                        "<a_0x93ac5449>": "https://www.cisa.gov/uscert/ncas/alerts/aa22-110a"
                    },
                    "text": "Both ESET and CERT-UA link Industroyer2 (as well as the original Industroyer and at least some of the wiper events in Ukraine in 2022) to the Sandworm actor, linked to GRU post 74455. Previous reporting and government disclosures also linked Sandworm to the 2015 power event, and the use of BlackEnergy3 malware. Re-use of a specific process name or string would therefore appear to be a very strange mistake in operational security or it could represent some degree of victim trolling by threat actors.",
                    "html": "<p>Both ESET and CERT-UA link Industroyer2 (as well as the original Industroyer and at least some of the wiper events in Ukraine in 2022) to the <a href=\"https://attack.mitre.org/groups/G0034/\">Sandworm</a> actor, linked to <a href=\"https://www.justice.gov/opa/pr/six-russian-gru-officers-charged-connection-worldwide-deployment-destructive-malware-and\">GRU post 74455</a>. <a href=\"https://www.mandiant.com/resources/ukraine-and-sandworm-team\">Previous reporting</a> and <a href=\"https://www.cisa.gov/uscert/ncas/alerts/aa22-110a\">government disclosures</a> also linked Sandworm to the 2015 power event, and the use of BlackEnergy3 malware. Re-use of a specific process name or string would therefore appear to be a very strange mistake in operational security – or it could represent some degree of “victim trolling” by threat actors.</p>"
                },
                {
                    "id": "<sentence_0xb63d9be2>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "The name itself has no significance or function beyond the BlackEnergy3-Industroyer2 connection. Why this appears is an open question, and likely one that will never be satisfactorily resolved. However, this instance may be an interesting cyber threat intelligence counter-example of where indicator-like alerting (e.g., on specific filenames or references to specific processes) may actually be a reasonable defensive measure for identifying certain adversaries.",
                    "html": "<p>The name itself has no significance or function beyond the BlackEnergy3-Industroyer2 connection. Why this appears is an open question, and likely one that will never be satisfactorily resolved. However, this instance may be an interesting cyber threat intelligence counter-example of where indicator-like alerting (e.g., on specific filenames or references to specific processes) may actually be a reasonable defensive measure for identifying certain adversaries.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x548ec8c9>",
            "title": "Relationship to Wider Operations and Events",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0xc5a76526>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x56a1091d>": "https://pylos.co/2022/02/25/contextualizing-cyber-components-in-conventional-conflict/",
                        "<a_0xec731801>": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/"
                    },
                    "text": "When Russia initiated its terrible invasion of Ukraine in late February 2022, commentators and analysis anticipated early operations to feature significant cyber components. While some effects certainly were observed and others discovered after collection of more evidence, many expected to observe critical infrastructure disruption along the lines of the 2015 and 2016 power events. That such an impact was attempted but only over a month into the conflict seems exceptionally strange, and defies expectations and assumptions around when to deploy such capabilities in conjunction with more traditional military operations.",
                    "html": "<p>When Russia initiated its terrible invasion of Ukraine in late February 2022, commentators and analysis anticipated early operations to feature significant cyber components. While <a href=\"https://pylos.co/2022/02/25/contextualizing-cyber-components-in-conventional-conflict/\">some effects certainly were observed</a> and <a href=\"https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/\">others discovered after collection of more evidence</a>, many expected to observe critical infrastructure disruption along the lines of the 2015 and 2016 power events. That such an impact was attempted but only over a month into the conflict seems exceptionally strange, and defies expectations and assumptions around when to deploy such capabilities in conjunction with more traditional military operations.</p>"
                },
                {
                    "id": "<sentence_0x7af0446f>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xa9073ecc>": "https://www.wsj.com/articles/russias-shifting-war-plan-threatens-more-suffering-for-eastern-ukraine-11648289112",
                        "<a_0x7660a365>": "https://www.washingtonpost.com/world/2022/03/24/russia-kalibr-cruise-missile-ukraine-weapons/"
                    },
                    "text": "First, while we cannot say this with complete confidence, it does appear that initial Russian plans for invading Ukraine envisioned a relatively quick decapitation of national leadership and centers of gravity, centered around the sack of Kyiv. As part of this operation, one can assume that leaving critical infrastructure largely intact was probably an initial requirement to facilitate occupation and subsequent installation of a puppet regime. As Russias incompetence and Ukraines bravery stymied these plans, a noticeable shift to indiscriminate attacks on population centers and infrastructure was observed. That a latent capability such as power system-targeting malware would be unleashed after such initial aims failed may therefore make sense, along the lines of similar questionable Russian decisions such as using sophisticated anti-ship cruise missiles to target stationary targets on land.",
                    "html": "<p>First, while we cannot say this with complete confidence, it does appear that <a href=\"https://www.wsj.com/articles/russias-shifting-war-plan-threatens-more-suffering-for-eastern-ukraine-11648289112\">initial Russian plans for invading Ukraine envisioned a relatively quick decapitation of national leadership and centers of gravity</a>, centered around the sack of Kyiv. As part of this operation, one can assume that leaving critical infrastructure largely intact was probably an initial requirement to facilitate occupation and subsequent installation of a puppet regime. As Russia’s incompetence and Ukraine’s bravery stymied these plans, a noticeable shift to indiscriminate attacks on population centers and infrastructure was observed. That a latent capability such as power system-targeting malware would be unleashed after such initial aims failed may therefore make sense, along the lines of similar questionable Russian decisions such as using <a href=\"https://www.washingtonpost.com/world/2022/03/24/russia-kalibr-cruise-missile-ukraine-weapons/\">sophisticated anti-ship cruise missiles to target stationary targets on land</a>.</p>"
                },
                {
                    "id": "<sentence_0xba0b3aa2>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xa4428eed>": "https://www.csis.org/analysis/power-struggle-over-ukraines-electrical-grid",
                        "<a_0xb9b3dc6>": "https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_1525",
                        "<a_0xaeaebbf3>": "https://www.nytimes.com/2022/03/04/science/ukraine-nuclear-power-plant.html"
                    },
                    "text": "Changing war aims aside, at the start of the conflict Ukraines electric sector remained linked to Russian grid operations. Coinciding with the start of Russias invasion, Ukrainian operators initiated an isolation test from Russian grid operations, and subsequently decided to not reconnect. While separating Ukraine from Russian grid operations, this also left Ukraines grid isolated and thus more easily susceptible to disruption. Russian operations to capture electric infrastructure, such as events in Chernobyl and Zaporizhzhia, could thus give Russia ready control over Ukrainian electric operations, or at least significant influence over them.",
                    "html": "<p>Changing war aims aside, at the start of the conflict Ukraine’s electric sector <a href=\"https://www.csis.org/analysis/power-struggle-over-ukraines-electrical-grid\">remained linked to Russian grid operations</a>. Coinciding with the start of Russia’s invasion, Ukrainian operators initiated an <a href=\"https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_1525\">isolation test from Russian grid operations</a>, and subsequently decided to not reconnect. While separating Ukraine from Russian grid operations, this also left Ukraine’s grid isolated and thus more easily susceptible to disruption. Russian operations to capture electric infrastructure, such as events in Chernobyl and <a href=\"https://www.nytimes.com/2022/03/04/science/ukraine-nuclear-power-plant.html\">Zaporizhzhia</a>, could thus give Russia ready control over Ukrainian electric operations, or at least significant influence over them.</p>"
                },
                {
                    "id": "<sentence_0x98a0cef9>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x5ab08344>": "https://www.scientificamerican.com/article/how-ukraine-unplugged-from-russia-and-joined-europes-power-grid-with-unprecedented-speed/",
                        "<a_0xc8d9d5b8>": "https://www.entsoe.eu/data/map/"
                    },
                    "text": "This changed in mid-March, when Ukraine (and Moldova) successfully connected to the European electric grid under ENTSO-E. As stated previously, this timing is interesting as some suspected disruptive events appeared to take place immediately after this switchover. But with Ukraine now part of the wider European electric system, unilateral options for Russia to control or manipulate Ukrainian electric operations were removed, or significantly reduced. Thus the timing of Industroyer2 after not just the start of the conflict, but also after integration with ENTSO-E, makes more sense in light of these changes.",
                    "html": "<p>This changed in mid-March, when <a href=\"https://www.scientificamerican.com/article/how-ukraine-unplugged-from-russia-and-joined-europes-power-grid-with-unprecedented-speed/\">Ukraine (and Moldova) successfully connected to the European electric grid under ENTSO-E</a>. As stated previously, this timing is interesting as some suspected disruptive events appeared to take place immediately after this switchover. But with Ukraine now part of the wider European electric system, unilateral options for Russia to control or manipulate Ukrainian electric operations were removed, or significantly reduced. Thus the timing of Industroyer2 after not just the start of the conflict, but also after integration with <a href=\"https://www.entsoe.eu/data/map/\">ENTSO-E</a>, makes more sense in light of these changes.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x91a44966>",
            "title": "Conclusions",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0x9784cc93>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Many details surrounding Industroyer2 and related (attempted) attacks on Ukrainian electric infrastructure are unavailable, but sufficient information has emerged to allow for the preliminary observations above. Overall, the evolution of operations in Russias invasion of Ukraine show that many assumptions surrounding the use of cyber capabilities as part of a conventional conflict require revision but at the same time, we should also note that cyber has been far from absent as part of hostilities. While paling in comparison to Russias physical brutality, cyber operations appear to form a continuing area of interest and investment for Russia in attempting to achieve its goals in Ukraine.",
                    "html": "<p>Many details surrounding Industroyer2 and related (attempted) attacks on Ukrainian electric infrastructure are unavailable, but sufficient information has emerged to allow for the preliminary observations above. Overall, the evolution of operations in Russia’s invasion of Ukraine show that many assumptions surrounding the use of cyber capabilities as part of a conventional conflict require revision – but at the same time, we should also note that cyber has been far from absent as part of hostilities. While paling in comparison to Russia’s physical brutality, cyber operations appear to form a continuing area of interest and investment for Russia in attempting to achieve its goals in Ukraine.</p>"
                },
                {
                    "id": "<sentence_0x8dd5162e>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "With time and additional data, the items above can be revisited and improved. I would caution anyone reading this, or any other, analysis that in the case of both the 2015 and especially the 2016 power incidents in Ukraine, reasonably complete understanding of these events did not occur until years after the events in question. Especially given the difficulties of network defense, forensics, and electric system operations in the middle of an invasion, researchers would do well to be patient with matters such as this, and maintain a willingness to revise conclusions appropriately as more information emerges.",
                    "html": "<p>With time and additional data, the items above can be revisited and improved. I would caution anyone reading this, or any other, analysis that in the case of both the 2015 and especially the 2016 power incidents in Ukraine, reasonably complete understanding of these events did not occur until years after the events in question. Especially given the difficulties of network defense, forensics, and electric system operations in the middle of an invasion, researchers would do well to be patient with matters such as this, and maintain a willingness to revise conclusions appropriately as more information emerges.</p>"
                },
                {
                    "id": "<sentence_0xdec97d9f>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Overall, Industroyer2 represents an interesting and important development surrounding the broader violence Russia is inflicting upon Ukraine. Given that the malware did not result in a disruption of service, other asset owners and operators should take note that robust, alert operations are critical in maintaining sufficient defense and resilience in the face of critical infrastructure threats. We can learn much from Ukraines efforts in this conflict, not the least of which being how to maintain fundamental civilian services even in the face of a brutal, all-out assault.",
                    "html": "<p>Overall, Industroyer2 represents an interesting and important development surrounding the broader violence Russia is inflicting upon Ukraine. Given that the malware did not result in a disruption of service, other asset owners and operators should take note that robust, alert operations are critical in maintaining sufficient defense and resilience in the face of critical infrastructure threats. We can learn much from Ukraine’s efforts in this conflict, not the least of which being how to maintain fundamental civilian services even in the face of a brutal, all-out assault.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xa01bcd8c>",
            "title": "Technical Details",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0x9d1a8821>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "While CERT-UA and ESET published some indicators related to Industroyer2, some other samples appeared with equivalent functionality that were not previously identified in original reports. The following table provides a list of known Industroyer2 samples and potential variants.",
                    "html": "<p>While CERT-UA and ESET published some indicators related to Industroyer2, some other samples appeared with equivalent functionality that were not previously identified in original reports. The following table provides a list of known Industroyer2 samples and potential variants.</p>"
                },
                {
                    "id": "<sentence_0x4d2238ef>",
                    "is_empty": true,
                    "have_tags": true,
                    "tags": {
                        "<table_0x1afc1b73>": {
                            "0": {
                                "0": "File Name",
                                "1": "108_100.exe",
                                "2": "40_115.exe",
                                "3": "",
                                "4": ""
                            },
                            "1": {
                                "0": "SHA1",
                                "1": "FD9C17C35A68FC505235E20C6E50C622AED8DEA0",
                                "2": "FDEB96BC3D4AB32EF826E7E53F4FE1C72E580379",
                                "3": "39B27DE81915B748EC56D1C5DF7E017B4A20323B",
                                "4": "1574A402E5604F17BC0068F196D8BCDCB05286E7"
                            },
                            "2": {
                                "0": "Note",
                                "1": "Industroyer2 variant listed by ESET, CERT-UA.",
                                "2": "Industroyer2 variant discovered on VirusTotal.",
                                "3": "Possible researcher modification of available sample.",
                                "4": "Possible researcher modification of available sample."
                            }
                        }
                    },
                    "text": "",
                    "html": "<figure class=\"wp-block-table is-style-stripes\"><table><tbody><tr><td>File Name</td><td>SHA1</td><td>Note</td></tr><tr><td>108_100.exe</td><td>FD9C17C35A68FC505235E20C6E50C622AED8DEA0</td><td>Industroyer2 variant listed by ESET, CERT-UA.</td></tr><tr><td>40_115.exe</td><td>FDEB96BC3D4AB32EF826E7E53F4FE1C72E580379</td><td>Industroyer2 variant discovered on VirusTotal.</td></tr><tr><td>N/A</td><td>39B27DE81915B748EC56D1C5DF7E017B4A20323B</td><td>Possible researcher modification of available sample.</td></tr><tr><td>N/A</td><td>1574A402E5604F17BC0068F196D8BCDCB05286E7</td><td>Possible researcher modification of available sample.</td></tr></tbody></table></figure>"
                }
            ]
        },
        {
            "id": "<chapter_0x6c944202>",
            "title": "Acknowledgments",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0xb3eb6ef1>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xf39bdd5b>": "https://www.microsoft.com/security/blog/microsoft-security-intelligence/",
                        "<a_0x69129aa1>": "https://twitter.com/dan_gunter",
                        "<a_0x78392a61>": "https://insaneforensics.com/"
                    },
                    "text": "Huge thanks to the teams at ESET and CERT-UA for disclosing information for defenders and enabling this analysis, as well as the team at MSTIC for their continued support of Ukrainian defenders. Special thanks to Dan Gunter and InsaneForensics for enabling protocol analysis of available Industroyer2 samples in a functioning lab environment.",
                    "html": "<p>Huge thanks to the teams at ESET and CERT-UA for disclosing information for defenders and enabling this analysis, as well as the team at <a href=\"https://www.microsoft.com/security/blog/microsoft-security-intelligence/\">MSTIC</a> for their continued support of Ukrainian defenders. Special thanks to <a href=\"https://twitter.com/dan_gunter\">Dan Gunter</a> and <a href=\"https://insaneforensics.com/\">InsaneForensics</a> for enabling protocol analysis of available Industroyer2 samples in a functioning lab environment.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x33813289>",
            "title": "Industroyer2 in Perspective",
            "title_level": 1,
            "sentences": []
        },
        {
            "id": "<chapter_0x9ec22570>",
            "title": "Like this:",
            "title_level": 3,
            "sentences": [
                {
                    "id": "<sentence_0xc4b8ddc5>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Like Loading...",
                    "html": "Like Loading..."
                },
                {
                    "id": "<sentence_0x9c51a4a9>",
                    "is_empty": true,
                    "have_tags": false,
                    "tags": {},
                    "text": "",
                    "html": "<a class=\"sd-link-color\"></a>"
                },
                {
                    "id": "<sentence_0xa080f1b8>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Categories:",
                    "html": "\nCategories:\t\t\t\t\t\t"
                },
                {
                    "id": "<sentence_0xfa5f540e>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xfbc3a618>": "https://pylos.co/category/ics/"
                    },
                    "text": "ICS",
                    "html": "<a href=\"https://pylos.co/category/ics/\">ICS</a>"
                },
                {
                    "id": "<sentence_0xab3ac7fb>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x61948766>": "https://pylos.co/category/information-warfare/"
                    },
                    "text": "Information Warfare",
                    "html": "<a href=\"https://pylos.co/category/information-warfare/\">Information Warfare</a>"
                },
                {
                    "id": "<sentence_0x80b8b6bf>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xaf3f7cfb>": "https://pylos.co/category/network-defense/"
                    },
                    "text": "Network Defense",
                    "html": "<a href=\"https://pylos.co/category/network-defense/\">Network Defense</a>"
                },
                {
                    "id": "<sentence_0x5219b413>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x18119221>": "https://pylos.co/category/threat-intelligence/"
                    },
                    "text": "Threat Intelligence",
                    "html": "<a href=\"https://pylos.co/category/threat-intelligence/\">Threat Intelligence</a>"
                },
                {
                    "id": "<sentence_0x7e24a868>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Tags:",
                    "html": " \nTags: "
                },
                {
                    "id": "<sentence_0xf433fc5>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x5e95c667>": "https://pylos.co/tag/ics/"
                    },
                    "text": "ICS",
                    "html": "<a href=\"https://pylos.co/tag/ics/\" rel=\"tag\">ICS</a>"
                },
                {
                    "id": "<sentence_0xcab966b1>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x51312b3d>": "https://pylos.co/tag/information-warfare/"
                    },
                    "text": "Information Warfare",
                    "html": "<a href=\"https://pylos.co/tag/information-warfare/\" rel=\"tag\">Information Warfare</a>"
                },
                {
                    "id": "<sentence_0x5cc2a16c>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0x2e5f8a1f>": "https://pylos.co/tag/network-defense/"
                    },
                    "text": "Network Defense",
                    "html": "<a href=\"https://pylos.co/tag/network-defense/\" rel=\"tag\">Network Defense</a>"
                },
                {
                    "id": "<sentence_0x34be1de2>",
                    "is_empty": false,
                    "have_tags": true,
                    "tags": {
                        "<a_0xc63f4abe>": "https://pylos.co/tag/threat-intelligence/"
                    },
                    "text": "Threat Intelligence",
                    "html": "<a href=\"https://pylos.co/tag/threat-intelligence/\" rel=\"tag\">Threat Intelligence</a>"
                },
                {
                    "id": "<sentence_0x1d8eb7fa>",
                    "is_empty": true,
                    "have_tags": true,
                    "tags": {
                        "<a_0xa2fd05f1>": "https://www.facebook.com/sharer.php?u=https://pylos.co/2022/04/23/industroyer2-in-perspective/"
                    },
                    "text": "",
                    "html": "<a class=\"btn btn-just-icon btn-round btn-facebook\" href=\"https://www.facebook.com/sharer.php?u=https://pylos.co/2022/04/23/industroyer2-in-perspective/\" rel=\"tooltip\" target=\"_blank\">\n</a>"
                },
                {
                    "id": "<sentence_0xb60c0163>",
                    "is_empty": true,
                    "have_tags": true,
                    "tags": {
                        "<a_0x48147a27>": "http://twitter.com/share?url=https://pylos.co/2022/04/23/industroyer2-in-perspective/&text=Industroyer2%20in%20Perspective"
                    },
                    "text": "",
                    "html": "<a class=\"btn btn-just-icon btn-round btn-twitter\" href=\"http://twitter.com/share?url=https://pylos.co/2022/04/23/industroyer2-in-perspective/&amp;text=Industroyer2%20in%20Perspective\" rel=\"tooltip\" target=\"_blank\">\n</a>"
                },
                {
                    "id": "<sentence_0xfa81c9e8>",
                    "is_empty": true,
                    "have_tags": true,
                    "tags": {
                        "<a_0xc6a9136b>": "mailto:?subject=Industroyer2%20in%20Perspective&body=https://pylos.co/2022/04/23/industroyer2-in-perspective/"
                    },
                    "text": "",
                    "html": "<a class=\"btn btn-just-icon btn-round\" href=\"mailto:?subject=Industroyer2%20in%20Perspective&amp;body=https://pylos.co/2022/04/23/industroyer2-in-perspective/\" rel=\"tooltip\">\n</a>"
                }
            ]
        }
    ]
}