[
    {
        "report": {
            "id": "report_0x87a3f8a0",
            "date": "20220326",
            "title": "Escobar Malware: An emerging threat to stealing credentials from your Phone. Indicators Of Compromise",
            "url": "https://www.secureblink.com/threat-research/escobar-malware:-an-emerging-threat-to-stealing-credentials-from-your-phone"
        },
        "chapter": {
            "id": "chapter_0xbee285f7",
            "title": "Escobar Malware: An emerging threat to stealing credentials from your Phone",
            "text": "Infamous Aberebot android banking trojan has returned as Escobar with new features, including stealing Google Authenticator multi-factor authentication code.\nThe new feature in the latest Escobar version includes remote control of the infected Android devices using VNC, recording audio, and taking photos, while also expanding the set of targeted apps for credential theft. The main goal of this trojan is to steal bank account details, check available balances and perform unauthorized banking transactions.\nThe owner of the malware is renting its beta version for $3000 per month for a max of five customers and also they are planning to raise its price to $5000. One can use its free version for free for three days.\nDuring the investigation by the Cyble team, security researchers came across twitter posts. In that researcher has mentioned a malware whose name and icon are similar to legitimate antivirus McAfee. The researcher also found that this malware is the latest variant of the popular banking Trojan, Aberebot. This new variant is capable of stealing 2FA Code.\nTechnical Analysis\nAPK Metadata Information\nName: McAfee\nPackage: com.escobar.pablo\nSHA256 Hash: a9d1561ed0d23a5473d68069337e2f8e7862f7b72b74251eb63ccc883ba9459f\nThe malware requests users for 25 different permissions, some of that permission is listed below.\nPermissions Description\nREAD_SMS Access and read SMS from the victims device.\nRECEIVE_SMS Intercept SMS received on the victims device\nREADCALLLOG Give access Call details\nREAD_CONTACTS Give access phone contact.\nREADPHONESTATE Give access to phone state, including the current cellular network information, the phone number and the serial number of the phone, the status of any ongoing calls, and a list of any Phone Accounts registered on the device.\nRECORD_AUDIO Give access the app to record audio with the microphone, which has the potential to be misused by attackers\nACCESSFINELOCATION Give access to the devices precise location to be detected by using the Global Positioning System (GPS).\nSEND_SMS Give access to the application to send SMS messages.\nCALL_PHONE Give access to an application to initiate a phone call without going through the Dialer user interface for the user to confirm the call.\nWRITEEXTERNALSTORAGE Give access the app to write or delete files in the devices external storage\nREADEXTERNALSTORAGE Give access the app to read the contents of the devices external storage\nWRITE_SMS Give access to the app to modify or delete SMS.\nSource code review -\nThe researcher has observed a defined launcher activity in the malicious apps manifest file, which loads the first screen of the app, as shown in the below figure\nBelow are a few commands used by the application to control the infected device.\nCommand Description\nTake Photo Capture images from the devices camera\nSend SMS Send any SMS to a particular number\nSend SMS to All Contacts Automatically send SMS to all the contact numbers saved in the device\nInject a web page Inject a malicious URL\nDownload File Let download media files from the victims device\nKill Bot Delete itself\nUninstall an app Uninstall an application"
        }
    },
    {
        "report": {
            "id": "report_0x87a3f8a0",
            "date": "20220326",
            "title": "Escobar Malware: An emerging threat to stealing credentials from your Phone. Indicators Of Compromise",
            "url": "https://www.secureblink.com/threat-research/escobar-malware:-an-emerging-threat-to-stealing-credentials-from-your-phone"
        },
        "chapter": {
            "id": "chapter_0x498d11bd",
            "title": "How To Prevent Malware Infection",
            "text": "Download and install software only from official app stores like Google Play Store or the iOS App Store.\nUse reputed anti-virus software.\nUse strong passwords and enforce multi-factor authentication(2FA).\nEnable biometric security features such as fingerprint or face recognition for unlocking the mobile device where possible.\nBe wary of opening any links received via SMS or emails delivered to your phone.\nBe careful while enabling any permissions."
        }
    },
    {
        "report": {
            "id": "report_0x87a3f8a0",
            "date": "20220326",
            "title": "Escobar Malware: An emerging threat to stealing credentials from your Phone. Indicators Of Compromise",
            "url": "https://www.secureblink.com/threat-research/escobar-malware:-an-emerging-threat-to-stealing-credentials-from-your-phone"
        },
        "chapter": {
            "id": "chapter_0x85d61c47",
            "title": "How To Identify Whether You Are Infected",
            "text": "Regularly check the Mobile/Wi-Fi data usage and battery usage of applications installed in mobile devices."
        }
    },
    {
        "report": {
            "id": "report_0x87a3f8a0",
            "date": "20220326",
            "title": "Escobar Malware: An emerging threat to stealing credentials from your Phone. Indicators Of Compromise",
            "url": "https://www.secureblink.com/threat-research/escobar-malware:-an-emerging-threat-to-stealing-credentials-from-your-phone"
        },
        "chapter": {
            "id": "chapter_0x8cee9a18",
            "title": "What To Do When You Are Infected",
            "text": "Disable Wi-Fi/Mobile data and remove SIM card as in some cases, the malware can re-enable the Mobile Data.\nRemove the application in case a factory reset is not possible.\nPerform a factory reset."
        }
    }
]