[
    {
        "report": {
            "id": "report_0x3dbf8168",
            "date": "20220422",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-alert-pegasus-spyware-active-iocs-2"
        },
        "chapter": {
            "id": "chapter_0x13c5d86b",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x3dbf8168",
            "date": "20220422",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-alert-pegasus-spyware-active-iocs-2"
        },
        "chapter": {
            "id": "chapter_0xee988d5d",
            "title": "Severity",
            "text": "High"
        }
    },
    {
        "report": {
            "id": "report_0x3dbf8168",
            "date": "20220422",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-alert-pegasus-spyware-active-iocs-2"
        },
        "chapter": {
            "id": "chapter_0x3646f8c2",
            "title": "Analysis Summary",
            "text": "Finlands Ministry of Foreign Affairs revealed that Pegasus Spyware has infected devices of many Finnish Diplomats.\nFinnish diplomats have been targets of cyber espionage by means of the Pegasus spyware, developed by NSO Group Technologies, which has received wide publicity. The highly sophisticated malware has infected users Apple or Android telephones without their noticing and without any action from the users part. Through the spyware, the perpetrators may have been able to harvest data from the device and exploit its features. reads a statement published by the Ministry.\nThe NSO Group is a leading Israeli cyber- company which made it to the news after 50,000 phone numbers worldwide on a leaked list were linked to its notorious spyware Pegasus. The spyware was used to monitor high-profile targets, including but not limited to the heads of states, journalists, human rights activists, and political rivals, and in this case, Finnish Diplomats.\nThe Ministry for Foreign Affairs is continually monitoring events and activities in its operating environment and assessing related risks. The Ministry for Foreign Affairs monitors its services and strives to prevent harmful activities. The preparation of and decisions on foreign and security policy, in particular, are matters that attract much interest, which may also manifest itself as unlawful intelligence. concludes the Ministry. The Ministry responds to the risk by various means, but complete protection against unlawful intelligence is impossible.\nThe key futuristic feature of Pegasus spyware is that it can be installed on a targeted phone with just a missed call or text message; it uses a zero-click iMessage exploit to deliver a chain of zero-day exploits to invade security features on the smartphone. The evasion will install the Pegasus spyware without the users permission and knowledge.\nThe critical data that is being extracted using Pegasus spyware is:\nPhotos and Screenshots\nMicrophone recordings\nVideo recordings\nEmail and SMS\nLive GPS data\nNetwork Details\nDevice Settings Info\nBrowsing History\nContact Details\nSocial Networks\nPhone Calls\nFile Retrievals\nKeystrokes\nMessaging data exfiltration from common applications including WhatsApp, Skype, Facebook, Twitter, Viber, Kakao\nEmail exfiltration from Androids Native Email client\nContacts and text messages.\nThe silver lining is that the information has been classified as Level 4 (the lowest level of classified information) or public. However, its sources may be subject to diplomatic confidentiality."
        }
    },
    {
        "report": {
            "id": "report_0x3dbf8168",
            "date": "20220422",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-alert-pegasus-spyware-active-iocs-2"
        },
        "chapter": {
            "id": "chapter_0x9e74fc07",
            "title": "Impact",
            "text": "Information Theft\nPerformance Degradation\nMisuse of Data\nFinancial Loss"
        }
    },
    {
        "report": {
            "id": "report_0x3dbf8168",
            "date": "20220422",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-alert-pegasus-spyware-active-iocs-2"
        },
        "chapter": {
            "id": "chapter_0xc9fb9109",
            "title": "Indicators of Compromise",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x3dbf8168",
            "date": "20220422",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-alert-pegasus-spyware-active-iocs-2"
        },
        "chapter": {
            "id": "chapter_0xdc5a82bb",
            "title": "Domain Name",
            "text": "informados24h[.]com\ninfo-urbano[.]com\nmobile-analytics[.]netweb-cloud-services[.]com\nsolo-hoy[.]com\ndeportes24-7[.]com"
        }
    },
    {
        "report": {
            "id": "report_0x3dbf8168",
            "date": "20220422",
            "title": "Rewterz Threat Alert Pegasus Spyware Active IOCs",
            "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-alert-pegasus-spyware-active-iocs-2"
        },
        "chapter": {
            "id": "chapter_0x5b31f77f",
            "title": "Remediation",
            "text": "It is exceptionally difficult to protect against such sophisticated attacks due to the extensive use of zero-day exploits, but not impossible. Mentioned below are some best practices that can be adopted to safeguard oneself against Pegasus & such attacks to the optimum level of security.\nUse mobile phone EDR aka mobile endpoint detection and response.\nUse a reputable password manager app.\nUse Authenticator app (i.e., Google authenticator app, Microsoft authenticator app).\nFor extra security, get a physical authenticator key like YubiKey, that can be used on the\nPhone and laptop.\nSwitch to an uncommon but safe web browser.\nDo not use an outlook mail client or any email server thats inbuilt on your OS. Switch to uncommon but reputable and\nsecure email clients.\nEnsure that all your devices and logins are stored in your password manager and use the password generator\nEnsure all your logins are connected to your authenticator app/device.\nYour anti-virus software should be enabled to lock and erase your device if its stolen.\nUse Securedrop for document sharing, etc.\nUse a different SMS app (Disable iMessage, or if possible, delete it since it has been abused by Pegasus & other threat\nactors multiple times exploiting zero-day providing the Pegasus an initial access point. It will be not wrong to say its\ntheir favorite attack spot).\nOnly open links from known and trusted contacts and sources when using your device.\nMake sure your device is updated with any relevant patches and upgrades.\nAvoid public and free Wi-Fi services (including hotels), especially when accessing sensitive information.\nDo not blindly approve app permission requests.\nKeep checking app permissions."
        }
    }
]