[
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x30e0497b",
            "title": "Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "text": "access_timeMarch 25, 2022\nperson_outlineTrustwave SpiderLabs\nshare\nThe Trustwave SpiderLabs email security team has been monitoring the ongoing Russia-Ukraine crisis to ensure that our clients are protected and aware of any imminent threats. This research blog captures some of the phishing email threats we have discovered.\nWhenever there is a global event, threat actors are sure to take advantage of the situation. As the war between Russia and Ukraine continues, cybercriminals are pumping out spam emails that use the crisis as a lure.\nWe have observed attackers sending various spam types ranging from crypto scams, malware emails, and phishing.\nThis activity is not unusual. Over the years, we have seen social engineering emails attempt to take advantage of world events such as the Olympics, the COVID-19 pandemic, natural disasters and more. So, it is not surprising that Trustwave SpiderLabs researchers are coming across phishing emails that use the Russian-Ukrainian war as a lure.\nOver the first several weeks of the conflict, we uncovered several attack schemes. Some emails intend to spread malware, while others gather personally identifiable information (PII). In all cases, the phishing attempts try to take advantage of the empathy the world has for the human suffering that is taking place in Ukraine."
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x1b66b60b",
            "title": "SpiderLabs Blog",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x98dfe803",
            "title": "Phishing in a Time of War",
            "text": "The invasion has caused a humanitarian disaster and displaced millions of Ukrainian citizens from their homes. In response, people from around the world responded by organizing aid and donations. Scammers, unfortunately, have taken note of this activity and, in an attempt to take advantage of these good-hearted people, are sending fraudulent emails asking for donations via cryptocurrency.\nScammers are playing with peoples emotions and are using fake heart-wrenching cries for help in this example below:\nThis message appears to be sent by a Ukrainian who has fled to Poland. The sender details the agonizing experience their family has suffered and falsely claims that Poland is charging refugees an entry fee to enter the country. The email also states that Bitcoin is their only means of acquiring financial assistance. One indicator that this email is fraudulent is that the sender address is from a free email service in Ukraine, but the reply-to field contains an entirely different email address. Upon closer inspection, we can see that the sender's IP came from the United States.\nAnother scam attempts to take advantage of the refugees fleeing the war zone. In this case, a social engineering scheme was designed to take advantage of the very real evacuations now taking place throughout Ukraine by passing along fake evacuation information in an attempt to obtain personal information.\nEvacuation plan from: SBU\n(Urgent) -28.02.2022\noriginal: 399029\nSecurity Service of Ukraine\nGood afternoon, you need to get acquainted with the electronic evacuation plan from March 1, 2022, provide data on the number of staff, fill out the document on the form 198 \\ 00-22 SBU-98.\nTo ensure the confidentiality of transmitted data, the password is set to the attachment: 2267903645\nOne of the most common tactics threat actors use while conducting phishing campaigns is brand impersonation. Here an email is used to impersonate a trusted entity. By disguising the message as coming from a recognizable organization, attackers are more likely to trick the users into divulging information or transferring money to a fraudulent account.\nIn the examples below, the message appears to be sent by the Ukrainian government.\nThe sender appears to have a legitimate government email address, but a further examination of the email header shows that the email originated from Lithuania. Another red flag is the fact that the domain Ukraine.gov is not officially listed under the ownership of the Ukrainian government."
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x9c254f69",
            "title": "Investment Scam",
            "text": "Aside from the crypto scam, attackers are sending fraudulent messages regarding investment schemes. These spam messages are basically a spin-off of the classic Nigerian Prince scam and offer the victim the false promise of investment or inheritance to trick them into disclosing their bank information or remitting money directly to the scammers.\nOn the surface, this message appears to be sent by a Ukrainian who fled the country for safety. The person is asking for help to transfer a considerable amount of money to the recipient's country for investment purposes.\nThe email contains several tells that it is fake, besides the story itself.\nThe email address in the \"from\" field belongs to a company that is not based in Ukraine. The email also contains a separate email address, which is entirely different from the sender's address and instead belongs to a free mail service. This particular red flag is a common scammer tactic. The scammer spoofs the sender's address because people are more likely to engage with the content of the email if the sender appears to be legitimate. The attacker also created a false sense of urgency as the sender claims to be in danger."
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x37a957c4",
            "title": "Malware Attachments in Spam Emails",
            "text": "Along with scam emails, malware-related spam is also being sent out to users. A common pretext being used in these messages is the cancellation or postponement of business transactions due to the shutdown of many Ukrainian establishments.\nThe email shown above uses an order shipment suspension to bait the user into opening the attachment. The attached Excel file supposedly contains the details of the transaction that they want to suspend.\nThe malicious Excel file exploits a vulnerability in Microsoft Office Equation editor called CVE-2017-11882. It downloads an executable from http://136[.]144[.]41[.]109/HRE[.]exe. Finally, this executable file downloads the final payload, which is Remcos. Remcos is a remote access Trojan (RAT) that can give an attacker full control over its targets system."
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x7968b689",
            "title": "IOC",
            "text": "SUCT220002.xlsx\n4907309437e12932d437f8c3ae03fbfde7d4e196b6f1dc7f2d98e3a388ce585c\nhttp://136[.]144[.]41[.]109/HRE[.]exe\nfaef8505886bc30e045f0eb3f1422528cdab1fedc8e02c601605b41bd205d348\n0a9babd846b1edf99e75f3c9de492c6341f9ca9a8e91851ad323bf8f325f9799"
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x386865e",
            "title": "Log-In Attempt Phishing Emails",
            "text": "Amidst the news of cyberattacks conducted by groups backing Russia, threat actors are pushing out phishing emails disguised as a sign-in attempt notification.\nIn this sample, the sender, who claims to be from the victims email security team, says there was a sign-in attempt originating from Russia. The victim is required to verify their account and activate two-step verification. First, the attackers mimic the victims company domain and forges the sender's address making it appears like a legitimate notification email.\nThe embedded URL belongs to a web hosting platform and leads to a fake login site, also known as a Chameleon phishing page, that can mimic the logo of the company domain of the victims email address. It even has a countdown timer to heighten the sense of urgency of the victim and make them divulge their credentials."
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0xd8c7ca44",
            "title": "The Very Real Threat of Phishing Attacks",
            "text": "Once an employee clicks on a link in a phishing email, malicious activities can occur that could affect an organization malware, ransomware, credential theft and more.\nFor example, Trustwave has spotted attackers distributing malware, including AgentTesla, through phishing campaigns focused on Ukraine. AgentTesla has several features. A threat actor can use it as a keylogger, a downloader, a password-stealer, and a screen-capturing malware. These abilities give it the power to record various data, including login credentials, or download and execute malware.\nTrustwave MailMarshal Secure Email Gateway can block these types of phishing and scam emails."
        }
    },
    {
        "report": {
            "id": "report_0xd9b2f358",
            "date": "20220325",
            "title": "SpiderLabs Blog. Cyber Attackers Leverage Russia-Ukraine Conflict in Multiple Spam Campaigns",
            "url": "https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/cyber-attackers-leverage-russia-ukraine-conflict-in-multiple-spam-campaigns"
        },
        "chapter": {
            "id": "chapter_0x7f002b7c",
            "title": "The Trustwave SpiderLabs Email Security Team Continues to Stay Vigilant",
            "text": "Certainly, these Ukrainian-related malicious mails wont be the last that well see. Cybercriminals will always piggyback on the current global crisis to make their profits. As always, we strongly advise users to never open emails, access links or click on attachments from unknown or unsolicited sources."
        }
    }
]