[
    {
        "report": {
            "id": "report_0x8f051cfa",
            "date": "20220412",
            "title": "Expect Aftershocks from the Ongoing Russian-Allied Cyber Threats",
            "url": "https://www.esentire.com/blog/expect-aftershocks-from-the-ongoing-russian-allied-cyber-threats"
        },
        "chapter": {
            "id": "chapter_0x733d3f0f",
            "title": "Expect Aftershocks from the Ongoing Russian-Allied Cyber Threats",
            "text": "In January, the Cybersecurity and Infrastructure Security Agency (CISA) released an Alert (AA22-011A) outlining the risk of Russian state-sponsored threats on the US. Whats playing out now is a culmination of tested Russian cyber tactics developed through state-sponsored and cybercriminal organizations which operated within friendly territories for years with impunity.\nAlthough the global community began to condemn the invasion, countering with sanctions and financial expulsion, it has only emboldened cybercriminals that pledge loyalty to Putins actions to target these nations with cyberattacks. Their pedigree includes the ability to maintain an undetected persistent and long-term access to compromised environments across networks, devices, and cloud services.\nThe primary objective of these cyberattacks is to disrupt critical business operations by compromising third-party and supply chain infrastructure, deploying custom malware (including ransomware) and leveraging Distributed Denial of Service (DDoS) attacks.\nThese tactics and capabilities were leveraged against Ukrainian banks, government services and media outlets.\nBased on an updated list of known vulnerabilities linked to Russian cybercriminal syndicates and lessons learned during counter offenses against Russian threat actors, eSentires Threat Response Unit (TRU)\nand 24/7 Security Operations team have conducted over 67,000 threat hunts across 2,000 clients, discovered a handful of active malware attacks, and added over 2,000 indicators of compromise (IoCs).\nIn an ironic turn of events, one of the most prolific ransomware gangs, Conti, appears to be in a civil war of its own. Having initially pledged allegiance to Putin's invasion of Ukraine, 13 months of chat logs between affiliates of Conti were leaked and published with the message Glory to Ukraine. The shared conversations expose the ransomware gangs operations and tactics used to develop defense-evading malware, including using fake companies to arrange meetings with prominent cybersecurity firms."
        }
    },
    {
        "report": {
            "id": "report_0x8f051cfa",
            "date": "20220412",
            "title": "Expect Aftershocks from the Ongoing Russian-Allied Cyber Threats",
            "url": "https://www.esentire.com/blog/expect-aftershocks-from-the-ongoing-russian-allied-cyber-threats"
        },
        "chapter": {
            "id": "chapter_0x308d0ca9",
            "title": "Know thy enemy",
            "text": "When it comes to preparing for the potential aftershocks of geopolitical events and economic sanctions, the first step is to understand your adversary and their tactics. Russian-aligned cybercrime groups employ clever phishing campaigns and poisoned search results to harvest credentials and gain initial access to targeted organizations.\nIn fact, eSentire TRU discovered a prominent ransomware gang using SEO poisoning to spread the GootLoader malware through third-party websites that hosted infected downloadable resources like templates and contracts designed to attract executives from various business services.\nThese cybercriminal groups establish persistent access through remote access tools and leverage vulnerabilities in unpatched FortiGate, Cisco, Oracle, Pulse, Citrix, and Microsoft Exchange services to move in and out of the environment undetected.\nTheir ultimate goals vary. Once they have established persistent access to your environment, they can disable back-up systems and deploy ransomware to disrupt operations, use wipers to permanently destroy data as a scorched earth tactic, or use DDoS attacks to bombard websites with erroneous requests to overload servers and shut down public facing services."
        }
    }
]