{"id": "report_0x46d6f0b2", "report_date": "2022-05-06T00:00:00Z", "report_title": "Emotet: New Delivery Mechanism to Bypass VBA Protection", "report_url": "https://www.netskope.com/blog/emotet-new-delivery-mechanism-to-bypass-vba-protection", "chapter": ["Emotet: New Delivery Mechanism to Bypass VBA Protection", "Netskope delivers a modern cloud security stack, with unified capabilities for data and threat protection, plus secure private access.", "Netskope Named a Leader in the 2022 Gartner Magic Quadrant for SSE Report", "Make the move to market-leading cloud security services with minimal latency and high reliability.", "Prevent threats that often evade other security solutions using a single-pass SSE framework.", "Zero trust solutions for SSE and SASE deployments", "Netskope enables a safe, cloud-smart, and fast journey to adopt cloud services, apps, and public cloud infrastructure.", "Trust Netskope to help you address evolving threats, new risks, technology shifts, organizational and network changes, and new regulatory requirements.", "We have qualified engineers worldwide, with diverse backgrounds in cloud security, networking, virtualization, content delivery, and software development, ready to give you timely, high-quality technical assistance.", "Security Visionaries Podcast", "Read the latest on how Netskope can enable the Zero Trust and SASE journey through security service edge (SSE) capabilities.", "Join us for a complimentary, hands-on cloud security workshop thatll teach you how to securely adopt cloud services within the enterprise.", "What is Security Service Edge?", "Netskope enables the future of work.", "Netskope is redefining cloud, data, and network security to help organizations apply Zero Trust principles to protect data.", "Thinkers, builders, dreamers, innovators. Together, we deliver cutting-edge cloud security solutions to help our customers protect their data and people.", "Netskopes partner-centric go-to-market strategy enables our partners to maximize their growth and profitability while transforming enterprise security."], "threat": ["emotet", "trickbot", "spring4shell"], "category": ["trojan", "malware", "c2", "rat", "botnet", "fraud", "phishing", "vpn"], "industry": ["financial", "government", "healthcare", "education", "retail"], "geo": [], "cve": [], "ttp": [], "detect": ["yara"]}