[
    {
        "report": {
            "id": "report_0x8b3693f2",
            "date": "20220331",
            "title": "Security ROI: Time & Resource Savings for IR/SOC Teams",
            "url": "https://www.intezer.com/blog/incident-response/automation-for-incident-response-and-soc"
        },
        "chapter": {
            "id": "chapter_0x456e8bfa",
            "title": "Security ROI: Time & Resource Savings for IR/SOC Teams",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x8b3693f2",
            "date": "20220331",
            "title": "Security ROI: Time & Resource Savings for IR/SOC Teams",
            "url": "https://www.intezer.com/blog/incident-response/automation-for-incident-response-and-soc"
        },
        "chapter": {
            "id": "chapter_0xbdb999ee",
            "title": "4 Ways to Save Time and Resources for Your SOC/IR Team",
            "text": "Alert triage Automatically analyze files, URLs, and machines to classify threats and threat actors. Intezer has a false positive rate of 0.2%, effectively eliminating false positives triggered by EDR or other detection systems to ensure your team can focus on real threats.\nIncident Response Teams can see an immediate improvement in Mean Time to Respond (MTTR), with automated extraction of IoCs and detection content. Teams using Intezer see alert triage time reduced by up to 90%.\nThreat Hunting With 10,124 mapped threat actors and malware families (and growing daily), Intezer allows your team to track threats of interest and leverage a feed of high-quality detection opportunities based on genetic code analysis.\nKnowledge Retention The cost of lost knowledge due to turnover is high, so teams need a way to preserve data over time. With access to a central source of knowledge for all micro-artifacts ever seen in the past, IR teams can easily make connections between separate incidents and even new analysts can provide deeper, historic context.\nCollectively these time and resources savings from automation allow IR/SOC teams to manage an increasing volume of detection alerts while rapidly identifying critical threats. Intezer also provides the toolset for teams to take advantage of these time savings by proactively hunting for new, undetected threats.\nGetting Intezer was like adding two reverse engineers to our team for a much lower cost. Head of Security Operations\nIntezer contributes to our incident response and forensics investigations daily. Knowing what we are dealing with in the middle of an attack in less than 30 seconds directly impacts our clients risk mitigation and recovery time.Head of Forensics and Incident Response Team"
        }
    },
    {
        "report": {
            "id": "report_0x8b3693f2",
            "date": "20220331",
            "title": "Security ROI: Time & Resource Savings for IR/SOC Teams",
            "url": "https://www.intezer.com/blog/incident-response/automation-for-incident-response-and-soc"
        },
        "chapter": {
            "id": "chapter_0x9ccd0ed4",
            "title": "Key Points: Quantifying Time and Cost Savings on Incident Response",
            "text": "Time on False Positives: Today, security teams can waste up to 90% of their time investigating false positives. Meanwhile, teams using Intezer only spend on average 9% percent of that time on false positives.\nMean Time to Respond: MTTR decreases by 89% for teams using Intezer, compared to their previous MTTR before using Intezer.\nCost Savings of Potential Incident Data breach costs hit $4.24 million on average in 2021, a record high. The same research noted that costs were significantly lower than that average for some organizations which had a more mature security posture, while organizations that lagged in security areas such as automation experienced higher costs. With automation from Intezer, security teams increase their capacity and can focus on real alerts, helping to prevent data breaches."
        }
    },
    {
        "report": {
            "id": "report_0x8b3693f2",
            "date": "20220331",
            "title": "Security ROI: Time & Resource Savings for IR/SOC Teams",
            "url": "https://www.intezer.com/blog/incident-response/automation-for-incident-response-and-soc"
        },
        "chapter": {
            "id": "chapter_0x5ae370a",
            "title": "Automation for Deeper Insights Than Traditional Tools, Faster",
            "text": "Using a traditional toolset of paid or free tools takes an analyst at least 30-60 minutes to classify and identify each new alert or threat. Validating, investigating, identifying detection content, and creating detection rules for each threat could require a set of complex tools and unavailable skills, including virtual machines, behavioral analysis, and code analysis tools like disassemblers, debuggers, and memory forensics.\nIntezer provides higher quality results in less time by utilizing automation to sift out false positives, while reducing the number of tools that analysts must switch between. Automation and consolidation of tools present the best options for addressing the rising volume of alerts and threats that SOC/IR teams face.\nTraditionally, an incident would have to go through an investigation process where we get the images and investigate each of the workstations. Typically, that means were going to have results in a couple of days. Being able to run Intezer allows us to speed up this investigation process to get immediate initial results. Chris Stewart | Director of Security Operations | iSecurity",
            "table": "0\nPercentage of Team Time Spent on Threat Analysis\nBetween 37-75% without Intezer\n6% or less with Intezer\n"
        }
    },
    {
        "report": {
            "id": "report_0x8b3693f2",
            "date": "20220331",
            "title": "Security ROI: Time & Resource Savings for IR/SOC Teams",
            "url": "https://www.intezer.com/blog/incident-response/automation-for-incident-response-and-soc"
        },
        "chapter": {
            "id": "chapter_0xc8c6c26a",
            "title": "Automation for Quick Time-To-Value",
            "text": "Intezers cloud-based SaaS model and out-of-the-box integrations with most EDR and SOAR tools allow companies to start seeing immediate value on Day 1. Security teams dont have time to spend on long implementation projects and waiting around for data ingestion. By allows your team to focus on unique threats, not repetitive alerts and noise.\nFree your team from false positives, automate alert response, kickstart investigations with reverse engineer-level insights, and expand your threat hunting. Talk with us.\nIntezer\nTrack the latest malware variants and threat actors analyze.intezer.com\nAlert Triage\ncybersecurity skill gaps\nfalse positives\nIncident Response\nMTTR\nsoc teams\nThreat Hunting"
        }
    }
]