[
    {
        "report": {
            "id": "report_0xc88f62d4",
            "date": "20220418",
            "title": "How to recover files encrypted by Yanlouwang",
            "url": "https://securelist.com/how-to-recover-files-encrypted-by-yanlouwang/106332"
        },
        "chapter": {
            "id": "chapter_0xd10ad8c7",
            "title": "How to recover files encrypted by Yanlouwang",
            "text": "Malware descriptions\n18 Apr 2022\n3 minute read\nTable of Contents\nYanluowang description\nFiles decryption\nIndicators of Compromise\nPiece of advice\nAuthors\nAMR\nYanluowang is a type of targeted ransomware discovered by the Symantec Threat Hunter team as they were investigating an incident on a large corporate network. Kaspersky experts have found a vulnerability in the Yanluowang encryption algorithm and created a free decryptor to help victims of this ransomware with recovering their files."
        }
    },
    {
        "report": {
            "id": "report_0xc88f62d4",
            "date": "20220418",
            "title": "How to recover files encrypted by Yanlouwang",
            "url": "https://securelist.com/how-to-recover-files-encrypted-by-yanlouwang/106332"
        },
        "chapter": {
            "id": "chapter_0x1a68d7c",
            "title": "How to recover files encrypted by Yanlouwang",
            "text": "Malware descriptions"
        }
    },
    {
        "report": {
            "id": "report_0xc88f62d4",
            "date": "20220418",
            "title": "How to recover files encrypted by Yanlouwang",
            "url": "https://securelist.com/how-to-recover-files-encrypted-by-yanlouwang/106332"
        },
        "chapter": {
            "id": "chapter_0xcbb1c0d2",
            "title": "Yanluowang description",
            "text": "The ransomware is relatively recent, its name a reference to the Chinese deity Yanluo Wang, one of the Ten Kings of Hell. Unfortunately, we do not know much about the victims. According to Kaspersky Security Network data, attacks have been carried out in the United States, Brazil, Turkey and a few other countries. The low number of infections is due to the targeted nature of the ransomware: threat actors prepare and implement attacks on specific companies only.\nGeography of the Yanluowang attacks, December 4th, 2021 April 8th, 2022 (download)\nIn the ransom note, the cybercriminals demand not to contact law enforcement and not keep them for fools:\nThe ransomware program has the functionality to terminate virtual machines, processes and services. This is necessary to make files used by other programs available for encryption. The main parts of stopped services and processes include databases, email services, browsers, programs for working with documents, security solutions, backups and shadow copy services.\nLists of stopped services and processes\nAccording to public information about the ransomware, it is only used in targeted attacks rather than in other RaaS families. Yanluowang itself needs parameters to be executed in the system, meaning it will be executed either manually or through a combination of scripts in the compromised system. The available syntax in the ransomware is:\nThe Sosemanuk stream cipher is used to encrypt files, its key then encrypted using the RSA-1024 asymmetric algorithm. The RSA public key itself is embedded in the program but additionally encrypted with the RC4 stream cipher whose key is a string and also embedded in ransomware. Files before and after encryption:\nWhen the encryption process is completed, the file extensions will be changed to .yanluowang\nYanluowang divides files into big and small along a 3 GB threshold. Small files are encrypted completely from beginning to end, big files are encrypted in stripes: 5 megabytes after every 200 megabytes.\nThe encryption code for big files\nAfter a file is encrypted, an RSA-encrypted Sosemanuk key is written to the end of it. The encrypted endfile block has a size of 1024 bytes.\nAn encrypted block with a Sosemanuk key",
            "table": "0;1\n1;encrypt.exe [(-p,-path,--path)<path>]\n"
        }
    },
    {
        "report": {
            "id": "report_0xc88f62d4",
            "date": "20220418",
            "title": "How to recover files encrypted by Yanlouwang",
            "url": "https://securelist.com/how-to-recover-files-encrypted-by-yanlouwang/106332"
        },
        "chapter": {
            "id": "chapter_0x122b3799",
            "title": "Files decryption",
            "text": "Kaspersky experts have analyzed the ransomware and found a vulnerability that allows decrypting files of affected users via a known-plaintext attack. All that was required for this to work was added to the Rannoh decryption tool.\nTo decrypt a file, you should have at least one original file. As mentioned earlier, the Yanluowang ransomware divides files into big and small files along a 3 gigabyte threshold. This creates a number of conditions that must be met in order to decrypt certain files:\nTo decrypt small files (less than or equal to 3 GB), you need a pair of files with a size of 1024 bytes or more. This is enough to decrypt all other small files.\nTo decrypt big files (more than 3 GB), you need a pair of files (encrypted and original) no less than 3 GB in size each. This will be enough to decrypt both big and small files.\nBy virtue of the above points, if the original file is larger than 3 GB, it is possible to decrypt all files on the infected system, both big and small. But if there is an original file smaller than 3 GB, then only small files can be decrypted."
        }
    },
    {
        "report": {
            "id": "report_0xc88f62d4",
            "date": "20220418",
            "title": "How to recover files encrypted by Yanlouwang",
            "url": "https://securelist.com/how-to-recover-files-encrypted-by-yanlouwang/106332"
        },
        "chapter": {
            "id": "chapter_0xf3bf00b1",
            "title": "Indicators of Compromise",
            "text": "Kaspersky solutions detect and protect against this ransomware, detecting it as Trojan-Ransom.Win32.Yanluowang with File Threat Protection and proactively as PDM:Trojan.Win32.Generic with Behavior Detection.\nMD5\nafaf2d4ebb6dc47e79a955df5ad1fc8a\nba95a2f1f1f39a24687ebe3a7a7f7295"
        }
    },
    {
        "report": {
            "id": "report_0xc88f62d4",
            "date": "20220418",
            "title": "How to recover files encrypted by Yanlouwang",
            "url": "https://securelist.com/how-to-recover-files-encrypted-by-yanlouwang/106332"
        },
        "chapter": {
            "id": "chapter_0x5bbb56f4",
            "title": "Piece of advice",
            "text": "Still, it is important for a company to have a security solution that would enable instant response to such ransomware threats in order to avoid large financial losses. Yanluowang was deployed in targeted human-operated attacks. As usual in such cases, we would like to remind you that a comprehensive cybersecurity strategy is required to protect against this type of threats.\nHere are Kasperskys recommendations for staying safe from ransomware attacks:\nDo not expose remote desktop services (such as RDP) to public networks unless absolutely necessary, and always use strong passwords.\nPromptly install available patches for commercial VPN solutions that provide access for remote employees and act as gateways to your network.\nAlways keep software up to date on all your devices to prevent ransomware from exploiting vulnerabilities.\nFocus your defense strategy on detecting lateral movement and data exfiltration to the Internet. Pay special attention to outgoing traffic to detect cybercriminals connections.\nBack up data regularly. Make sure you can quickly access your backups in an emergency.\nTo protect the corporate environment, educate your employees. Dedicated training courses can help, such as the ones provided on Kaspersky Automated Security Awareness Platform.\nUse the latest Threat Intelligence information to stay on top of actual TTPs used by threat actors.\nUse solutions like Kaspersky Endpoint Detection and Response and Kaspersky Managed Detection and Response service which help to identify and stop an attack in the early stages, before attackers can achieve their objectives.\nUse a reliable endpoint security solution, such as Kaspersky Endpoint Security for Business, that is powered by exploit prevention, behavior detection and a remediation engine capable of rolling back malicious actions. KESB also has self-defense mechanisms that can prevent its removal by cybercriminals.\nCybercrime\nMalware Technologies\nRansomware\nTrojan\nAuthors\nAMR"
        }
    }
]