[
    {
        "report": {
            "id": "report_0x47610748",
            "date": "20220421",
            "title": "Android/Bianlian Botnet Trying to Bypass Photo TAN Used for Mobile Banking",
            "url": "https://www.fortinet.com/blog/threat-research/android-bianlian-botnet-mobile-banking"
        },
        "chapter": {
            "id": "chapter_0xe62eb089",
            "title": "Android/Bianlian Botnet Trying to Bypass Photo TAN Used for Mobile Banking",
            "text": "Affected Platforms: Android\nImpacted Users: Android End-Users\nImpact: Banking Credential Leak + Remote Control\nSeverity Level: Medium\nWe have been closely investigating the Android BianLian botnet (also known as Hydra). This botnet emerged in 2018. It is still very alive in 2022, particularly active since the beginning of 2022, where we are closely monitoring at least three independent campaigns.\nThe Android malware typically poses as a video player, Google Play app, or a mobile banking application. Once installed, it asks the victim to activate Accessibility Services for the app to work correctly. In reality, this is needed by the malware to overlay images and validate forms without user interaction. Asking for Accessibility Services activation should raise an alarm in the victims mind. Unfortunately, many wont understand this is not legitimate.\nFigure 1: Malware asking to activate Accessibility Services. Unfortunately, many users will accept and wont understand this helps the malware capture gestures, click on forms without users consent, etc.\nOnce this is done. It is game over. The installed application apparently disappears from the smartphone, leaving the victim under the impression that it did not work or crashed. In reality, the malware is running in the background and contacting a C2 for apps to monitor.\nWhenever the victim launches an app monitored by the threat actors, the malware downloads up-to-date HTML and images to inject on the smartphone. The injected web page is displayed as an overlay of the real app, but the victim has no way to see the trick. This is how threat actors get the mobile banking credentials of their victims. It is important to note that this malware does not affect the targeted applications or exploit them in any way. Instead, it inserts itself between the user and the application to intercept the user's credentials, much like a man-in-the-middle attack.\nVideo Overview: Example of infection with Android Bian Lian malware. In this video, we mimic an existing C2 taken from another campaign (left hand side). On the right, a smartphone is infected with Bian Lian. Our fake C2 shows communication with the infected smartphone. The end-user activates Accessibility Services.\nNote the infected Video Player disappears from the list of applications: the end-user cant see it any longer. Then, the end-user launches an application. See how the malware injects a fake login page. This login page actually sits on top of the existing banks app. The Bian Lian malware, running in the background, takes regular screenshots of the victims smartphone. This is a way the malware can steal banking credentials.\nNote the mobile banking apps are genuine and have no security flaw. The attack is conducted by the Bian Lian malware. (This research video has no sound.)\nDuring our investigations, we noticed the C2 is targeting European banks. It is also currently developing support for the Photo TAN some banks use. Photo TAN is a popular two-factor authentication method where the user scans a matrix shown on their PC, laptop, or tablet with the smartphone. This generates a TAN to verify online orders.\nWe have downloaded the corresponding injected pages:\nFigure 2: Corresponding injected pages.\nFortunately, the web pages are not ready yet:\nCopy\nFortinet customers are protected:\nThe malware is detected as Android/BianLian.10484!tr or Android/Agent.FRJ!tr\nThe malicious URLs of the C2 are blocked by our Web Filtering services\nThe threat is being actively monitored by Fortinets Central Threat System and our FortiRecon team.\nAs much as possible, we are reaching out to concerned banks and trying to bring the botnet down."
        }
    },
    {
        "report": {
            "id": "report_0x47610748",
            "date": "20220421",
            "title": "Android/Bianlian Botnet Trying to Bypass Photo TAN Used for Mobile Banking",
            "url": "https://www.fortinet.com/blog/threat-research/android-bianlian-botnet-mobile-banking"
        },
        "chapter": {
            "id": "chapter_0xe4ed7f80",
            "title": "IOC",
            "text": "a3b826de0c445f0924c50939494a26b0d99ef3ccac80faacca98673625656278\nhxxp://loa5ta2rso7xahp7lubajje6txt366hr3ovjgthzmdy7gav23xdqwnid[.]onion/api/mirrors\nhxxp://zhgggga[.]in"
        }
    },
    {
        "report": {
            "id": "report_0x47610748",
            "date": "20220421",
            "title": "Android/Bianlian Botnet Trying to Bypass Photo TAN Used for Mobile Banking",
            "url": "https://www.fortinet.com/blog/threat-research/android-bianlian-botnet-mobile-banking"
        },
        "chapter": {
            "id": "chapter_0x12cc1a04",
            "title": "Targeted applications",
            "text": "The following applications are currently targeted by the C2. Note the list may change at any moment.\nAt.aerztebank.aerztebankmobile\nAt.bank99.meine.meine\nAt.ing.diba.client.onlinebanking\nAt.volksbank.volksbankmobile\nCom.bankaustria.android.olb\nCom.bawagpsk.bawagpsk\nCom.commerzbank.photoTAN\nCom.db.pbc.phototan.db\nCom.db.pwcc.dbmobile\nCom.easybank.easybank\nDe.comdirect.app\nMobile.santander.de.smartsign\nIn addition to those banking apps, the C2 also monitors a few vendor PIN applications like samsung.settings.pas or huawei.settings.pin. Those appear in all Android Bian Lian malware to help malware authors grab the PIN or unlock the screen.\nMany thanks to several colleagues who are helping for this investigation, in particular: David Malcher, Aamir Lakhani, Bhumit Mali, and Anil Aphale.\nLearn more about Fortinets FortiGuard Labs threat research and intelligence organization and the FortiGuard Security Subscriptions and Services portfolio."
        }
    }
]