[
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0xc193d073",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "text": "Juan Andrs Guerrero-Saade\n/\nMarch 31, 2022\nBy Juan Andres Guerrero-Saade (@juanandres_gs) and Max van Amerongen (@maxpl0it)"
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0xacbe1603",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "text": "Adversary"
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0xcddbefee",
            "title": "Executive Summary",
            "text": "On Thursday, February 24th, 2022, a cyber attack rendered Viasat KA-SAT modems inoperable in Ukraine.\nSpillover from this attack rendered 5,800 Enercon wind turbines in Germany unable to communicate for remote monitoring or control.\nViasats statement on Wednesday, March 30th, 2022 provides a somewhat plausible but incomplete description of the attack.\nSentinelLabs researchers discovered new malware that we named AcidRain.\nAcidRain is an ELF MIPS malware designed to wipe modems and routers.\nWe assess with medium-confidence that there are developmental similarities between AcidRain and a VPNFilter stage 3 destructive plugin. In 2018, the FBI and Department of Justice attributed the VPNFilter campaign to the Russian government\nAcidRain is the 7th wiper malware associated with the Russian invasion of Ukraine.\nUpdate: In a statement disseminated to journalists, Viasat confirmed the use of the AcidRain wiper in the February 24th attack against their modems."
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0xd2e60388",
            "title": "Context",
            "text": "The Russian invasion of Ukraine has included a wealth of cyber operations that have tested our collective assumptions about the role that cyber plays in modern warfare. Some commentators have voiced a bizarre disappointment at the lack of cyber while those at the coalface are overwhelmed by the abundance of cyber operations accompanying conventional warfare. From the beginning of 2022, we have dealt with six different strains of wiper malware targeting Ukraine: WhisperKill, WhisperGate, HermeticWiper, IsaacWiper, CaddyWiper, and DoubleZero. These attacks are notable on their own. But theres been an elephant in the room by way of the rumored satellite modem hack. This particular attack goes beyond Ukraine.\nWe first became aware of an issue with Viasat KA-SAT routers due to a reported outage of 5,800 Enercon wind turbines in Germany. To clarify, the wind turbines themselves were not rendered inoperable but remote monitoring and control of the wind turbines became unavailable due to issues with satellite communications. The timing coincided with the Russian invasion of Ukraine and suspicions arose that an attempt to take out Ukrainian military command-and-control capabilities by hindering satellite connectivity spilled over to affect German critical infrastructure. No technical details became available; technical speculation has been rampant.\nOn Wednesday, March 30th, 2022, Viasat finally released a statement stating that the attack took place in two phases: First, a denial of service attack coming from several SurfBeam2 and SurfBeam2+ modems and [other on-prem equipment] physically located within Ukraine that temporarily knocked KA-SAT modems offline. Then, the gradual disappearance of modems from the Viasat service. The actual service provider is in the midst of a complex arrangement where Eutalsat provides the service, but its administered by an Italian company called Skylogic as part of a transition plan."
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0x3663a157",
            "title": "The Viasat Explanation",
            "text": "At the time of writing, Viasat has not provided any technical indicators nor an incident response report. They did provide a general sense of the attack chain with conclusions that are difficult to reconcile.\nViasat reports that the attackers exploited a misconfigured VPN appliance, gained access to the trust management segment of the KA-SAT network, moved laterally, then used their access to execute legitimate, targeted management commands on a large number of residential modems simultaneously. Viasat goes on to add that these destructive commands overwrote key data in flash memory on the modems, rendering the modems unable to access the network, but not permanently unusable.\nIt remains unclear how legitimate commands could have such a disruptive effect on the modems. Scalable disruption is more plausibly achieved by pushing an update, script, or executable. Its also hard to envision how legitimate commands would enable either the DoS effects or render the devices unusable but not permanently bricked.\nIn effect, the preliminary Viasat incident report posits the following requirements:\nCould be pushed via the KA-SAT management segment onto modems en masse\nWould overwrite key data in the modems flash memory\nRender the devices unusable, in need of a factory reset or replacement but not permanently unusable.\nWith those requirements in mind, we postulate an alternative hypothesis: The threat actor used the KA-SAT management mechanism in a supply-chain attack to push a wiper designed for modems and routers. A wiper for this kind of device would overwrite key data in the modems flash memory, rendering it inoperable and in need of reflashing or replacing.\nSubsequent to this post being published, Viasat confirmed to journalists that our analysis was consistent with their reports.\nViasat told BleepingComputer that The analysis in the SentinelLabs report regarding the ukrop binary is consistent with the facts in our report specifically, SentinelLabs identifies the destructive executable that was run on the modems using a legitimate management command as Viasat previously described."
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0x45a62aa8",
            "title": "The AcidRain Wiper",
            "text": "On Tuesday, March 15th, 2022, a suspicious upload caught our attention. A MIPS ELF binary was uploaded to VirusTotal from Italy with the name ukrop. We didnt know how to parse the name accurately. Possible interpretations include a shorthand for ukraine operation, the acronym for the Ukrainian Association of Patriots, or a Russian ethnic slur for Ukrainians . Only the incident responders in the Viasat case could say definitively whether this was in fact the malware used in this particular incident. We posit its use as a fitting hypothesis and will describe its functionality, quirky development traits, and possible overlaps with previous Russian operations in need of further research."
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0x5ed6bf26",
            "title": "Technical Overview",
            "text": "AcidRains functionality is relatively straightforward and takes a bruteforce attempt that possibly signifies that the attackers were either unfamiliar with the particulars of the target firmware or wanted the tool to remain generic and reusable. The binary performs an in-depth wipe of the filesystem and various known storage device files. If the code is running as root, AcidRain performs an initial recursive overwrite and delete of non-standard files in the filesystem.\nRecursively delete files in nonstandard folders\nFollowing this, it attempts to destroy the data in the following storage device files:\nThis wiper iterates over all possible device file identifiers (e.g., mtdblock0 mtdblock99), opens the device file, and either overwrites it with up to 0x40000 bytes of data or (in the case of the /dev/mtd* device file) uses the following IOCTLS to erase it: MEMGETINFO, MEMUNLOCK, MEMERASE, and MEMWRITEOOB. In order to make sure that these writes have been committed, the developers run an fsync syscall.\nThe code that generates the malicious data used to overwrite storage\nWhen the overwriting method is used instead of the IOCTLs, it copies from a memory region initialized as an array of 4-byte integers starting at 0xffffffff and decrementing at each index. This matches what others had seen after the exploit had taken place.\nSide-by-side comparison of a Surfbeam2 modem pre- and post-attack\nThe code for both erasure methods can be seen below:\nMechanisms to erase devices: write 0x40000 (left) or use MEM* IOCTLS (right)\nOnce the various wiping processes are complete, the device is rebooted.\nRedundant attempts to reboot the device\nThis results in the device being rendered inoperable.",
            "table": "0;1\nTargeted Device(s);Description\n/dev/sd*;A generic block device\n/dev/mtdblock*;Flash memory (common in routers and IoT devices)\n/dev/block/mtdblock*;Another potential way of accessing flash memory\n/dev/mtd*;The device file for flash memory that supports fileops\n/dev/mmcblk*;For SD/MMC cards\n/dev/block/mmcblk*;Another potential way of accessing SD/MMC cards\n/dev/loop*;Virtual block devices\n"
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0x53fe9bba",
            "title": "An Interesting Oddity",
            "text": "Despite what the Ukraine invasion has taught us, wiper malware is relatively rare. More so wiper malware aimed at routers, modems, or IoT devices. The most notable case is VPNFilter, a modular malware aimed at SOHO routers and QNAP storage devices, discovered by Talos. This was followed by an FBI indictment attributing the operation to Russia (APT28, in particular). More recently, the NSA and CISA attributed VPNFilter to Sandworm (a different threat actor attributed to the same organization, the Russian GRU) as the U.K.s National Cyber Security Centre (NCSC) described VPNFilters successor, Cyclops Blink.\nVPNFilter included an impressive array of functionality in the form of multi-stage plugins selectively deployed to the infected devices. The functionality ranges from credential theft to monitoring Modbus SCADA protocols. Among its many plugins, it also included functionality to wipe and brick devices as well as DDoS a target.\nThe reason we bring up the specter of VPNFilter is not because of its superficial similarities to AcidRain but rather because of an interesting (but inconclusive) code overlap between a specific VPNFilter plugin and AcidRain."
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0x63e3ae96",
            "title": "VPNFilter Stage 3 Plugin dstr",
            "text": "After the initial discovery of VPNFilter, additional plugins were revealed by researchers attempting to understand the massive spread of the botnet and its many intricacies. Among these were previously unknown plugins, including dstr. As the mangled name suggests, its a destruction module meant to supplement stage 2 plugins that lacked the kill command meant to wipe the devices.\nThis plugin was brought to our attention initially by tlsh fuzzy hashing, a more recent matching library thats proven far more effective than ssdeep or imphash in identifying similar samples. The similarity was at 55% to AcidRain with no other samples being flagged in the VT corpus. This alone is not nearly enough to conclusively judge the two samples as tied, but it did warrant further investigation.\nVPNFilter and AcidRain are both notably similar and dissimilar. Theyre both MIPS ELF binaries and the bulk of their shared code appears to stem from statically-linked libc. It appears that they may also share a compiler, most clearly evidenced by the identical Section Headers Strings Tables.\nSection Headers Strings Tables for VPNFilter and AcidRain\nAnd there are other development quirks, such as the storing of the previous syscall number to a global location before a new syscall. At this time, we cant judge whether this is a shared compiler optimization or a strange developer quirk.\nMore notably, while VPNFilter and AcidRain work in very different ways, both binaries make use of the MEMGETINFO, MEMUNLOCK, and MEMERASE IOCTLS to erase mtd device files.\nOn the left, AcidRain; on the right, VPNFilter\nThere are also notable differences between VPNFilters dstr plugin and AcidRain. The latter appears to be a far sloppier product that doesnt consistently rise to the coding standards of the former. For example, note the redundant use of process forking and needless repetition of operations.\nThey also appear to serve different purposes, with the VPNFilter plugin targeting specific devices with hardcoded paths, and AcidRain taking more of a one-binary-fits-all approach to wiping devices. By brute forcing device filenames, the attackers can more readily reuse AcidRain against more diverse targets.\nWe invite the research community to stress test this developmental overlap and contribute their own findings.",
            "table": "0;1\nSHA256;47f521bd6be19f823bfd3a72d851d6f3440a6c4cc3d940190bdc9b6dd53a83d6\nSHA1;261d012caa96d3e3b059a98388f743fb8d39fbd5\nMD5;20ea405d79b4de1b90de54a442952a45\nDescription;VPNFilter Stage 3, ‘dstr’ module\nMagic;ELF 32-bit MSB executable, MIPS, MIPS-I version 1 (SYSV), statically linked, stripped\nFirst Seen;2018-06-06 13:02:56 UTC\n"
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0xcb66d95e",
            "title": "Conclusions",
            "text": "As we consider whats possibly the most important cyber attack in the ongoing Russian invasion of Ukraine, there are many open questions. Despite Viasats statement claiming that there was no supply-chain attack or use of malicious code on the affected routers, we posit the more plausible hypothesis that the attackers deployed AcidRain (and perhaps other binaries and scripts) to these devices in order to conduct their operation.\nWhile we cannot definitively tie AcidRain to VPNFilter (or the larger Sandworm threat cluster), we note a medium-confidence assessment of non-trivial developmental similarities between their components and hope the research community will continue to contribute their findings in the spirit of collaboration that has permeated the threat intelligence industry over the past month."
        }
    },
    {
        "report": {
            "id": "report_0xa71bb7c0",
            "date": "20220401",
            "title": "AcidRain | A Modem Wiper Rains Down on Europe",
            "url": "https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe"
        },
        "chapter": {
            "id": "chapter_0x3e360909",
            "title": "References",
            "text": "https://www.wired.com/story/viasat-internet-hack-ukraine-russia/\nhttps://www.cisa.gov/uscert/ncas/alerts/aa22-076a\nhttps://media.defense.gov/2022/Jan/25/2002927101/-1/-1/0/CSA_PROTECTING_VSAT_COMMUNICATIONS_01252022.PDF\nhttps://www.airforcemag.com/hackers-attacked-satellite-terminals-through-management-network-viasat-officials-say/\nhttps://nps.edu/documents/104517539/104522593/RELIEF12-4_QLR.pdf/9cc03d09-9af4-410e-b601-a8bffdae0c30\nhttps://www.reuters.com/business/media-telecom/exclusive-hackers-who-crippled-viasat-modems-ukraine-are-still-active-company-2022-03-30/\nhttps://www.viasat.com/about/newsroom/blog/ka-sat-network-cyber-attack-overview/\nhttps://blog.talosintelligence.com/2018/05/VPNFilter.html\nhttps://blog.talosintelligence.com/2018/06/vpnfilter-update.html?m=1\nhttps://blog.talosintelligence.com/2018/09/vpnfilter-part-3.html\nhttps://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf\nhttps://www.trendmicro.com/en_us/research/21/a/vpnfilter-two-years-later-routers-still-compromised-.html"
        }
    }
]