[
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0x53de4262",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "text": "Thanks to Val Saengphaibul and Fred Gutierrez who helped contribute to this blog.\nAffected Platforms: Windows\nImpacted Users: Windows users\nImpact: Compromised machines are under the control of the threat actor\nSeverity Level: Medium\nSpearphishing crafted with industry-specific terms derived from intelligence gathering techniques to trick a recipient into opening a file is especially difficult to identify. This is especially true when an adversary has knowledge of how a business works and the processes that underpin it. Using this knowledge, a lure can be crafted that takes advantage of these day-to-day processes for example, settling the cost of a fuel transaction.\nFortiGuard Labs recently encountered such a scenario, where a fuel company in Kyiv, Ukraine received a spearphishing e-mail that contained an attached invoiceseemingly from another fuel providerthat was spoofed. The attachment is a zip file that contains the IcedID Trojan.\nIcedID has been observed as far back as 2017. Its primary function is to steal banking credentials and personal information. It is also capable of deploying additional malware from the same group or partner organizations.\nThis instance also uses an interesting deployment method. It uses the ISO format, which is mounted automatically as a disk in Windows. ISO files can also be used to create bootable CD-ROMs or install an operating system or virtual machine. It also contains a LNK (shortcut file) used to launch a DLL (Dynamic-link Library).\nThis blog details the infection process and subsequent malware deployment by the threat actors behind IcedID."
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0xae4adbce",
            "title": "The Phishing E-mail",
            "text": "The e-mail originated from an IP address in Belize, at 179[.]60[.]150[.]96. It spoofs the originating e-mail address to appear to have been sent from another fuel provider in Ukraine. The e-mail contains both English and Ukrainian elements and looks realistic given the mention of extra security measures regarding the attachment.\nFigure 1. Phishing e-mail.\nAttached to the e-mail is a file named invoice_15.zip. Extracting the Zip file will drop invoice_15.iso and begin the first phase of infection."
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0xbb01eb91",
            "title": "ISO",
            "text": "Windows is capable of mounting iso files as external disks. Doing so will present the user with a shortcut called document. In most cases, the file extension will be hidden from the user, making it appear as an actual document.\nFigure 2. ISO file with contents hidden.\nWhen the full contents of the iso container are revealed, a DLL file can also be seen.\nFigure 3. Full contents of the ISO file."
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0x54a249af",
            "title": "LNK",
            "text": "Figure 4. Shortcut details.\nAs seen in Figure 4, the shortcut file was created some time prior to the sending of the phishing e-mail. Additionally, the highlighted area shows what will occur should the shortcut be clicked on by a user.\nIn this case, Regsvr32 is used to register main.dll with the Windows registry and launch the code contained within. This action begins the next phase of infection."
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0xd6fbe8ef",
            "title": "Dropper",
            "text": "main.dll acts as a dropper for IcedID. Static analysis of the file reveals an interesting point.\nFigure 5. Example of strings embedded in main.dll\nWhat at appears at first glance to be an easy win for IOCs (Indicators of Compromise) because it contains a domain and IP address, turns out to be slightly more complicated.\nFigure 6. Code represented in IDA Pro showing the information from Figure 5.\nIn comparing the area of code where the strings in Figure 5 are stored, we find that this area is not called by any functions within main.dll. To illustrate this, the right-hand side of the very first line in Figure 6 contains Data XREF:. This indicates that it is referenced elsewhere in the code. The strings from Figure 5, however, do not include this information, indicating they are not.\nBy investigating further, the story becomes even more interesting. This code appears in a StackOverflow question from approximately 10 years ago concerning an issue about downloading an image over HTTP (https://stackoverflow.com/questions/9389183/downloading-a-picture-with-http-get-only-downloads-a-small-part-of-it). It should be noted that there is no malicious intent with the content of that posting.\nThat it is now part of main.dll indicates it is a decoy for analysts in the hope the actual indicators wont be blocked.\nFigure 7. Information gathering by IcedID.\nAs can be seen in Figure 7, once running, the malware uses several Windows command-line tools to obtain information about the local environment. These include capturing the local IP address (ipconfig), enumerating domain trusts (nltest), and capturing a list of domain administrators (net group), among others.\nThe sample then tries to communicate outbound to a command and control (C2) server. There are multiple addresses the malware can connect to in the event one of the destinations becomes unavailable.\nFigure 8. Network communication.\nFigure 9. HTTP GET request.\nIf a connection to a C2 server has been made, the malware then moves to ensure persistence. It installs a copy of itself in the users temp directory, %APPDATA%\\local\\temp.\nFigure 10. Dropping Arur.exe into the Temp directory."
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0x69ef5f1e",
            "title": "Conclusion",
            "text": "Threat actors that are knowledgeable of their targets are able to increase their chances of installing an implant within an organization. Based on our observations, the efforts used in this IcedID attack highlight the groups methodical effort, as evidenced by their research of Ukraine's retail fuel industry. Additionally, the use of uncommon deployment methods (zipped ISO file) to establish a footholdand ultimately gain persistence within an organizationreveals how crafty the threat actors are able to be to obtain unauthorized access."
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0x5a86e7b0",
            "title": "Fortinet Protections",
            "text": "All IcedID samples mentioned in this blog are detected by the following (AV) signatures:\nW32/Kryptik.HOTN!tr\nW64/Kryptik.CXY!tr\nW64/Kryptik.CXY!tr\nW64/Kryptik.CXY!tr\nLNK/IceID.AW!tr\nW64/Kryptik.CXY!tr\nAll network based URIs are blocked by the WebFiltering client.\nFortinet has multiple solutions designed to help train users to understand and detect phishing threats:\nThe FortiPhish Phishing Simulation Service uses real-world simulations to help organizations test user awareness and vigilance to phishing threats and to train and reinforce proper practices when users encounter targeted phishing attacks.\nIn addition to these protections, we suggest that organizations also have their end users go through our FREE NSE training: NSE 1 Information Security Awareness. It includes a module on Internet threats that is designed to help end users learn how to identify and protect themselves from various types of phishing attacks."
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0xe0d1ab10",
            "title": "IOCs",
            "text": "",
            "table": "0;1\nFilename;SHA256\ninvoice_15.zip;83bd20009107e1f60479016046b80d473436d3883ad6989e5d42bc08e142b5bb\ninvoice_15.iso;3542d5179100a7644e0a747139d775dbc8d914245292209bc9038ad2413b3213\ndocument.lnk;a17e32b43f96c8db69c979865a8732f3784c7c42714197091866473bcfac8250\nmain.dll;698a0348c4bb8fffc806a1f915592b20193229568647807e88a39d2ab81cb4c2\nArur.exe;283d5eea1f9fc34e351deacc25006fc1997566932fae44db4597c84f1f1f3a30\n"
        }
    },
    {
        "report": {
            "id": "report_0x7d2de808",
            "date": "20220328",
            "title": "Spoofed Invoice Used to Drop IcedID",
            "url": "https://www.fortinet.com/blog/threat-research/spoofed-invoice-drops-iced-id"
        },
        "chapter": {
            "id": "chapter_0x745cef73",
            "title": "Network IOCs:",
            "text": "Learn more about Fortinets FortiGuard Labs threat research and intelligence organization and the FortiGuard Security Subscriptions and Services portfolio.",
            "table": "0\n160[.]153[.]32[.]99\n160[.]90[.]198[.]40\nyourgroceries[.]top\nssddds1ssd2[.]com\nip-160-153-32-99[.]ip[.]secureserver[.]net\n"
        }
    }
]