{
    "id": "<report_0x77d738fe>",
    "url": "https://www.rewterz.com/rewterz-news/rewterz-threat-update-russian-state-sponsored-and-criminal-cyber-threats-to-critical-infrastructure-russian-ukrainian-cyber-warfare",
    "title": "Rewterz Threat Update Russian State-Sponsored and Criminal Cyber Threats to Critical Infrastructure Russian-Ukrainian Cyber Warfare",
    "meta": [
        {
            "id": "<chapter_0xe71aa107>",
            "title": "Rewterz Threat Update Russian State-Sponsored and Criminal Cyber Threats to Critical Infrastructure Russian-Ukrainian Cyber Warfare",
            "title_level": 1,
            "sentences": [
                {
                    "id": "<sentence_0xa2ed1dc5>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "April 27, 2022",
                    "html": "\nApril 27, 2022\n"
                },
                {
                    "id": "<sentence_0x576f2954>",
                    "is_empty": true,
                    "have_tags": true,
                    "tags": {
                        "<img_0x5d36bff9>": "https://www.rewterz.com/wp-content/uploads/2020/03/logo_color_small.png"
                    },
                    "text": "",
                    "html": "<img src=\"https://www.rewterz.com/wp-content/uploads/2020/03/logo_color_small.png\"/>"
                },
                {
                    "id": "<sentence_0x697e0d86>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Severity",
                    "html": "<p>Severity</p>"
                },
                {
                    "id": "<sentence_0xb76b6249>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Analysis Summary",
                    "html": "<p>Analysis Summary</p>"
                },
                {
                    "id": "<sentence_0x2bfbfddf>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "APT29",
                    "html": "<p>APT29</p>"
                },
                {
                    "id": "<sentence_0x895598de>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "APT28",
                    "html": "<p>APT28</p>"
                },
                {
                    "id": "<sentence_0xd394b4ca>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Gamaredon",
                    "html": "<p>Gamaredon</p>"
                },
                {
                    "id": "<sentence_0xfb08b5ad>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Conti Ransomware",
                    "html": "<p>Conti Ransomware</p>"
                },
                {
                    "id": "<sentence_0x8c7d2548>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "SmokeLoader",
                    "html": "<p>SmokeLoader</p>"
                },
                {
                    "id": "<sentence_0xe08f6a91>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Impact",
                    "html": "<p>Impact</p>"
                },
                {
                    "id": "<sentence_0xb450955a>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Remediation",
                    "html": "<p>Remediation</p>"
                }
            ]
        }
    ],
    "chapters": [
        {
            "id": "<chapter_0x31888a57>",
            "title": "Rewterz Threat Update Russian State-Sponsored and Criminal Cyber Threats to Critical Infrastructure Russian-Ukrainian Cyber Warfare",
            "title_level": 1,
            "sentences": []
        },
        {
            "id": "<chapter_0xdab63867>",
            "title": "Severity",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0x30d6ddaa>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "High",
                    "html": "<p>High</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xc994c6df>",
            "title": "Analysis Summary",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0x7a73c418>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "The cybersecurity authorities of the United States, Canada, Australia, United Kingdom, and New Zealand have released a joint CSA (Cybersecurity Advisory). The advisory is against Russias continuous cyber attacks against Ukraine in an attempt to completely invade it. This has also opened up doors for Russian cybercriminals to attack what they deem Enemies of Russia. Countries allying with Ukraine and sanctioning the actions by Russia are at high risk of attacks too. These attacks also include DDoS, Ransomware, and deployment of malicious software for information theft. Cyber threat actors from the following Russian government and military organizations have conducted malicious cyber operations against IT and/or OT networks:",
                    "html": "<p>The cybersecurity authorities of the United States, Canada, Australia, United Kingdom, and New Zealand have released a joint CSA (Cybersecurity Advisory). The advisory is against Russia’s continuous cyber attacks against Ukraine in an attempt to completely invade it. This has also opened up doors for Russian cybercriminals to attack what they deem “Enemies” of Russia. Countries allying with Ukraine and sanctioning the actions by Russia are at high risk of attacks too. These attacks also include DDoS, Ransomware, and deployment of malicious software for information theft. Cyber threat actors from the following Russian government and military organizations have conducted malicious cyber operations against IT and/or OT networks:</p>"
                },
                {
                    "id": "<sentence_0xa0adc552>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "The Russian Federal Security Service (FSB), including FSBs Center 16 and Center 18<crlf>Russian Foreign Intelligence Service (SVR)<crlf>Russian General Staff Main Intelligence Directorate (GRU), 85th Main Special Service Center (GTsSS)<crlf>GRUs Main Center for Special Technologies (GTsST)<crlf>Russian Ministry of Defense, Central Scientific Institute of Chemistry and Mechanics (TsNIIKhM)",
                    "html": "<ul><li>The Russian Federal Security Service (FSB), including FSB’s Center 16 and Center 18</li><li>Russian Foreign Intelligence Service (SVR)</li><li>Russian General Staff Main Intelligence Directorate (GRU), 85th Main Special Service Center (GTsSS)</li><li>GRU’s Main Center for Special Technologies (GTsST)</li><li>Russian Ministry of Defense, Central Scientific Institute of Chemistry and Mechanics (TsNIIKhM)</li></ul>"
                },
                {
                    "id": "<sentence_0x676542c0>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Some of the Threat actors to look out for are:",
                    "html": "<p>Some of the Threat actors to look out for are:</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x57294c82>",
            "title": "APT29",
            "title_level": 4,
            "sentences": [
                {
                    "id": "<sentence_0x38b3de30>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "APT29 is linked to Russias Foreign Intelligence Service (SVR). They have been targeting government networks in Europe and NATO member nations, research institutes, and think tanks since at least 2008. APT29 focuses on a single target, launching a payload in the first stage that investigates the area while establishing persistence. Also, the notorious Solar Wind attacks in 2020 were carried out by this group. In 2014, the APT29 group attacked commercial and government enterprises in Germany, Uzbekistan, South Korea, and the United States, including the US State Department and the White House.",
                    "html": "<p>APT29 is linked to Russia’s Foreign Intelligence Service (SVR). They have been targeting government networks in Europe and NATO member nations, research institutes, and think tanks since at least 2008. APT29 focuses on a single target, launching a payload in the first stage that investigates the area while establishing persistence. Also, the notorious Solar Wind attacks in 2020 were carried out by this group. In 2014, the APT29 group attacked commercial and government enterprises in Germany, Uzbekistan, South Korea, and the United States, including the US State Department and the White House.</p>"
                },
                {
                    "id": "<sentence_0x7ba9f059>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "They have also attacked many vaccine manufacturers in an attempt to undermine the Coronavirus pandemic response process. APT29 is also known as Nobelium, Dukes, Cozy Duke, EuroAPT, CozyBear, CozyCar, Office Monkeys, SeaDuke, Hammer Toss, Iron Hemlock, and Grizzly Steppe.",
                    "html": "<p>They have also attacked many vaccine manufacturers in an attempt to undermine the Coronavirus pandemic response process. APT29 is also known as Nobelium, Dukes, Cozy Duke, EuroAPT, CozyBear, CozyCar, Office Monkeys, SeaDuke, Hammer Toss, Iron Hemlock, and Grizzly Steppe.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x653f73db>",
            "title": "APT28",
            "title_level": 4,
            "sentences": [
                {
                    "id": "<sentence_0x1891aa30>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "APT28 is one of Russias longest-running APTs and its operations date back to at least 2007. The group supports Russia in their strategic operations against the U.S, countries of the former Soviet Union, Europe, and now Asia. These attacks mostly involve cyber crimes against the defense and military of targeted countries. To support Russias national interests, APT28 compromises the targeted countrys operation, steals their data, and then leaks it to their government.",
                    "html": "<p>APT28 is one of Russia’s longest-running APTs and its operations date back to at least 2007. The group supports Russia in their strategic operations against the U.S, countries of the former Soviet Union, Europe, and now Asia. These attacks mostly involve cyber crimes against the defense and military of targeted countries. To support Russia’s national interests, APT28 compromises the targeted country’s operation, steals their data, and then leaks it to their government. </p>"
                },
                {
                    "id": "<sentence_0x85f6ecb2>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Going by the aliases Fancy Bear, Pawn Storm, Tsar Team, STRONTIUM, and Sofacy Group, APT28 performs their attacks using a spoofed website and phishing emails containing malicious links.",
                    "html": "<p>Going by the aliases Fancy Bear, Pawn Storm, Tsar Team, STRONTIUM, and Sofacy Group, APT28 performs their attacks using a spoofed website and phishing emails containing malicious links. </p>"
                },
                {
                    "id": "<sentence_0x1dfe5897>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Recently, APT 28 (allegedly) has attacked Eastern European countries using Empire and Invoke-Obfuscation. The MSHTML Remote Code Execution vulnerability, CVE-2021-40444, is being used by their threat actors.",
                    "html": "<p>Recently, APT 28 (allegedly) has attacked Eastern European countries using Empire and Invoke-Obfuscation. The MSHTML Remote Code Execution vulnerability, CVE-2021-40444, is being used by their threat actors.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xfd2fb4c5>",
            "title": "Gamaredon",
            "title_level": 4,
            "sentences": [
                {
                    "id": "<sentence_0x396d17d5>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Gamaredon is a Russia-backed advanced persistent threat (APT) that has been operating since at least 2013. The main goal of this APT is to use the malicious document to gain control of the target machine. The exploit document uses the template injection technique to infect the victims computer with further malware. When the document is opened, it connects to the hackers server and downloads the payload file. Gamaredons tools are simple and designed to collect sensitive information from hacked systems and propagate it further. Its information-gathering efforts are nearly comparable to those of a second-tier APT, whose primary purpose is to collect and disseminate information with their units.",
                    "html": "<p>Gamaredon is a Russia-backed advanced persistent threat (APT) that has been operating since at least 2013. The main goal of this APT is to use the malicious document to gain control of the target machine. The exploit document uses the template injection technique to infect the victim’s computer with further malware. When the document is opened, it connects to the hacker’s server and downloads the payload file. Gamaredon’s tools are simple and designed to collect sensitive information from hacked systems and propagate it further. Its information-gathering efforts are nearly comparable to those of a second-tier APT, whose primary purpose is to collect and disseminate information with their units.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x1bfe9395>",
            "title": "Conti Ransomware",
            "title_level": 4,
            "sentences": [
                {
                    "id": "<sentence_0xbc2d0f1f>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Conti ransomware was discovered in December 2019 and is delivered via TrickBot. Its been utilized against large companies and government institutions across the world, especially in North America. Conti steals important files and information from targeted networks and threatens to disseminate it unless the ransom is paid. Conti ransomware enhances performance by utilizing up to 32 simultaneous encryption operations, and is very likely directly controlled by its controllers. This ransomware can target network-based resources while ignoring local files. This feature has the noticeable impact of being able to create targeted harm in an environment in a way that might hinder incident response actions.",
                    "html": "<p>Conti ransomware was discovered in December 2019 and is delivered via TrickBot. It’s been utilized against large companies and government institutions across the world, especially in North America. Conti steals important files and information from targeted networks and threatens to disseminate it unless the ransom is paid. Conti ransomware enhances performance by utilizing “up to 32 simultaneous encryption operations,” and is very likely directly controlled by its controllers. This ransomware can target network-based resources while ignoring local files. This feature has the noticeable impact of being able to create targeted harm in an environment in a way that might hinder incident response actions.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0x350eaea4>",
            "title": "SmokeLoader",
            "title_level": 4,
            "sentences": [
                {
                    "id": "<sentence_0xc31c9095>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "SmokeLoader a malicious bot application can be used to load additional malware. SmokeLoader has been spotted in the wild since 2011, carrying a variety of payloads. This malware is mostly used to load additional malicious software, which is often obtained from a third-party source. SmokeLoader can load its modules allowing it to do several activities without the use of additional components. To date, the supplier of Smokeloader, who goes by the alias SmokeLdr, is still active in delivering this malware as a service. It is well-known for using deception and self-defense. This malware can be spread in several ways and is widely linked to criminal activity. To hide its C2 activity, this malware sends queries to popular websites like microsoft.com, bing.com, adobe.com, and others.",
                    "html": "<p>SmokeLoader – a malicious bot application – can be used to load additional malware. SmokeLoader has been spotted in the wild since 2011, carrying a variety of payloads. This malware is mostly used to load additional malicious software, which is often obtained from a third-party source. SmokeLoader can load its modules allowing it to do several activities without the use of additional components. To date, the supplier of Smokeloader, who goes by the alias SmokeLdr, is still active in delivering this malware as a service. It is well-known for using deception and self-defense. This malware can be spread in several ways and is widely linked to criminal activity. To hide its C2 activity, this malware sends queries to popular websites like microsoft.com, bing.com, adobe.com, and others.</p>"
                }
            ]
        },
        {
            "id": "<chapter_0xb2738aaf>",
            "title": "Impact",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0x312d2db4>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Information Theft and Cyber Espionage<crlf>System Compromise<crlf>Exposure of Sensitive Data<crlf>Unauthorized Access",
                    "html": "<ul><li>Information Theft and Cyber Espionage</li><li>System Compromise</li><li>Exposure of Sensitive Data</li><li>Unauthorized Access</li></ul>"
                }
            ]
        },
        {
            "id": "<chapter_0xb94c9ae8>",
            "title": "Remediation",
            "title_level": 2,
            "sentences": [
                {
                    "id": "<sentence_0x22052937>",
                    "is_empty": false,
                    "have_tags": false,
                    "tags": {},
                    "text": "Logging Log your eCommerce environments network activity and web server activity.<crlf>Passwords Ensure that general security policies are employed including: implementing strong passwords, correct configurations, and proper administration security policies.<crlf>Admin Access limit access to administrative accounts and portals to only relevant personnel and make sure they are not publicly accessible.<crlf>WAF Web defacement must be stopped at the web application level. Therefore, set up a Web Application Firewall with rules to block suspicious and malicious requests.<crlf>Patch Patch and upgrade any platforms and software timely and make it into a standard security policy. Prioritize patching known exploited vulnerabilities and zero-days.<crlf>Secure Coding Along with network and system hardening, code hardening should be implemented within the organization so that their websites and software are secure. Use testing tools to detect any vulnerabilities in the deployed codes.<crlf>2FA Enable two-factor authentication.<crlf>Antivirus Enable antivirus and anti-malware software and update signature definitions in a timely manner. Using a multi-layered protection is necessary to secure vulnerable assets",
                    "html": "<ul><li>Logging – Log your eCommerce environment’s network activity and web server activity.</li><li>Passwords – Ensure that general security policies are employed including: implementing strong passwords, correct configurations, and proper administration security policies.</li><li>Admin Access – limit access to administrative accounts and portals to only relevant personnel and make sure they are not publicly accessible.</li><li>WAF – Web defacement must be stopped at the web application level. Therefore, set up a Web Application Firewall with rules to block suspicious and malicious requests.</li><li>Patch – Patch and upgrade any platforms and software timely and make it into a standard security policy. Prioritize patching known exploited vulnerabilities and zero-days.</li><li>Secure Coding – Along with network and system hardening, code hardening should be implemented within the organization so that their websites and software are secure. Use testing tools to detect any vulnerabilities in the deployed codes.</li><li>2FA – Enable two-factor authentication.</li><li>Antivirus – Enable antivirus and anti-malware software and update signature definitions in a timely manner. Using a multi-layered protection is necessary to secure vulnerable assets</li></ul>"
                }
            ]
        }
    ]
}