[
    {
        "report": {
            "id": "report_0x2e91c650",
            "date": "20220405",
            "title": "Inside Lightning Stealer. A New Info Stealer Targeting over 30 Browsers",
            "url": "https://blog.cyble.com/2022/04/05/inside-lightning-stealer"
        },
        "chapter": {
            "id": "chapter_0xb6fb0f77",
            "title": "Inside Lightning Stealer",
            "text": ""
        }
    },
    {
        "report": {
            "id": "report_0x2e91c650",
            "date": "20220405",
            "title": "Inside Lightning Stealer. A New Info Stealer Targeting over 30 Browsers",
            "url": "https://blog.cyble.com/2022/04/05/inside-lightning-stealer"
        },
        "chapter": {
            "id": "chapter_0x9d73775f",
            "title": "Technical Analysis",
            "text": "The methods in Main()function of the malware binary (SHA 256: a2a3b6db773b95fa27501f081b03daf2a29bfb800b4efa397cc4fc59ff755368) which is ultimately responsible for stealing data have been presented in a sequential manner as per to their execution. Refer to Figure 3.\nFigure 3: Main function\nThe malware first calls Input.GetLogGecko method. This method will return stolen passwords, cookies, and history from Firefox-based browsers upon execution.\nIt initially identifies the Firefox-based browsers present in a system bypassing the respective browsers path in the AppData folder to the Directory.Exists() method. If this returns as True, those paths will be added to a new list for stealing data. The figure below shows the Firefox-based browsers targeted by the malware.\nFigure 4: Firefox-based browsers targeted by malware\nFirefox-based browsers store user data in a Profiles folder under the AppData\\Browser_name directory. Lightning Stealer checks this directory along with the file names mentioned below:\nkey4.db: Stores the encryption keys and master password for logins.json.\nlogins.json: These files store the usernames and passwords.\nplaces.sqlite: This file stores the user search history, downloads, and bookmarks data.\nIt steals the browsers data only if the above files are present.\nIt first steals the data from the login.json file and looks for mozglue.dll and nss3.dll, which will be used to decrypt the login.json file. Figure 5 shows the credential-stealing functionality for Firefox-based browsers.\nFigure 5: Stealing login credentials from Firefox based browsers\nThen malware steals the cookies data from moz_cookies table in cookies.sqlite file and stores the data in the following format (refer Figure 6) :\nDomain =\nName =\nValue =\nPath =\nExpires =\nIsSecure =\nFigure 6: Cookie stealing functionality on Firefox-based browsers\nSimilarly, the malware steals the browsers history from the moz_places table in the places.sqlite file and extracts the data in the following format:\nUrl =\nTitle =\nVisits =\nTime =\nThe figure below shows the browsers history stealing functionality.\nFigure 7: Steals history on Firefox-based browsers\nAfter stealing data from Firefox-based browsers, the malware targets Chromium-based browsers. Figure 8 shows the Chromium-based browsers targeted by the Lightning stealer.\nFigure 8: Chromium-based browsers targeted by Lightning Stealer\nThe sensitive user data, such as login credentials and cookies, stored in Chrome-based browsers are present in an encrypted form. The malware enumerates and gets the name of all files present in the Browser-name\\User Data\\ folder and checks for the Local State file, which stores the encrypted keys used by Chrome to decrypt the login data.\nIf this file is present, the malware uses the DPAPI()functionto decrypt the encryption keys in the Local State file by calling Dpapi.CryptUnprotectData() function as can be seen in figure below.\nFigure 9: Use of DPAPI\nChromium browsers store the login data in the Login Data file, a .SQLite file. The malware steals the data from the logins table present in this file and extracts the data in the following format:\nDomain =\nLogin =\nPassword =\nFigure 10: Stealing Login credentials from Chromium-based browsers\nThen malware steals cookies from cookies table present Cookies file and stores the data in following format:\nDomain =\nName =\nPath =\nExpires =\nIsSecure = isSecure,\nValue = value\nFigure 11: Stealing cookies from Chromium-based browsers\nIn a similar manner, the malware steals the data from the following .sqlite files:\ncredit cards data from the logins table in the Login Data file.\nFilter Data in the format:\nNumber =\nYear =\nMonth =\nName =\nSearch history from the URLs table in the History file.\nFilter Data in format:\nUrl =\nTitle =\nVisits =\nTime =\nAutofill data from autofill table in Web data file.\nFilter Data in format:\nName =\nValue =\nFigure 12: Stealing Credit Cards, History, and Autofill data from Chromium-based browsers\nThis stealer has the capability to steal data from crypto wallets present in the victims system. The wallets targeted by the stealer can be seen in the figure below. The malware targets the wallet files specific to the crypto applications mentioned in Figure 13. The malware then converts the wallet files content into Base64 and saves them into a list.\nFigure 13: Targeted Crypto wallets\nThe malware then proceeds to steal the victims system info. Figure 14 shows the system info gathered by malware.\nFigure 14: Stealing System Info\nThis malware also steals the .txt and .doc files present in the Desktop of the victims system. The malware reads the content of the file and encodes it using Base64. Then it saves the encoded data and file names on a list.\nFigure 15: Stealing files from victims desktop\nAfter this, the malware checks for the Telegram Desktop\\tdata file in the ApplicationData folder. Instead of copying the file to a different directory for exfiltration, it loads its content in memory, encodes it, and saves it to a list.\nFigure 16: Stealing Telegram data\nThe Lightning stealer steals the Discord token from the following directory:\ndiscord\\\\Local Storage\\\\leveldb\nIt retrieves a list of all files present in this directory and then starts stealing data from them.\nFigure 17: Stealing Discord token\nThe malware steals data from Steam, a video game digital distribution service. The stealer identifies the Steam installation path by checking the registry key value at HKEY_LOCAL_MACHINE\\Software\\Valve\\Steam.\nThe malware steals data from all the files present under the config folder.\nFigure 18: Stealing user data from Steam\nAfter this, the malware takes a screenshot of the victims screen and saves it in the AppData\\Roaming\\ folder named 1.png. Then, it converts the screenshot into Base64 encoded strings and saves it to a list.\nFigure 19: Taking a screenshot of the victims system\nThe malware stores all the stolen data in the lists shown in the figure below.\nFigure 20: Storing stolen data in lists\nThen it creates a file named 444.txt in the AppData\\Roaming\\ folder. Before writing content to this file, it converts the stolen data into JSON strings using JsonSerializer.Serialize() method.\nFigure 21: Storing data as JSON strings\nAfter this, the malware exfiltrates the data to the following domain:\nhxxp[:]//panels[.]xyz/Stealer/TSave\nThe body of the request is sent in JSON format, as can be seen in the figure below.\nFigure 22: Data exfiltration"
        }
    },
    {
        "report": {
            "id": "report_0x2e91c650",
            "date": "20220405",
            "title": "Inside Lightning Stealer. A New Info Stealer Targeting over 30 Browsers",
            "url": "https://blog.cyble.com/2022/04/05/inside-lightning-stealer"
        },
        "chapter": {
            "id": "chapter_0xc54a24ea",
            "title": "Conclusion",
            "text": "Info Stealers are adopting new techniques to become more evasive. As the information stolen by such malware is sensitive, organizations should follow good security practices. In the past, Cyble Research Labs has observed data breaches of large organizations because of such threats. We have also witnessed ransomware groups leveraging Info Stealers to gain initial network access and, eventually, exfiltrating sensitive data. Lightning Stealer is an emerging Info Stealer, and we may see variants of it emerge in the future."
        }
    },
    {
        "report": {
            "id": "report_0x2e91c650",
            "date": "20220405",
            "title": "Inside Lightning Stealer. A New Info Stealer Targeting over 30 Browsers",
            "url": "https://blog.cyble.com/2022/04/05/inside-lightning-stealer"
        },
        "chapter": {
            "id": "chapter_0xf78f0660",
            "title": "Recommendations",
            "text": "Avoid downloading pirated software from warez/torrent websites. The Hack Tool present on sites such as YouTube, torrent sites, etc., mainly contains such malware.\nUse strong passwords and enforce multi-factor authentication wherever possible.\nTurn on the automatic software update feature on your computer, mobile, and other connected devices.\nUse a reputed anti-virus and internet security software package on your connected devices, including PC, laptop, and mobile.\nRefrain from opening untrusted links and email attachments without first verifying their authenticity.\nEducate employees in terms of protecting themselves from threats like phishings/untrusted URLs.\nBlock URLs that could be used to spread the malware, e.g., Torrent/Warez.\nMonitor the beacon on the network level to block data exfiltration by malware or TAs.\nEnable Data Loss Prevention (DLP) Solution on the employees systems."
        }
    },
    {
        "report": {
            "id": "report_0x2e91c650",
            "date": "20220405",
            "title": "Inside Lightning Stealer. A New Info Stealer Targeting over 30 Browsers",
            "url": "https://blog.cyble.com/2022/04/05/inside-lightning-stealer"
        },
        "chapter": {
            "id": "chapter_0x8599dd28",
            "title": "MITRE ATT&CK Techniques",
            "text": "",
            "table": "0;1;2\nTactic;Technique ID;Technique Name\nExecution;T1204;User Execution\nCredential Access;T1555  T1539  T1552  T1528;Credentials from Password Stores Steal Web Session Cookie Unsecured Credentials Steal Application Access Token\nCollection;T1113;Screen Capture\nDiscovery;T1518  T1124  T1007;Software Discovery System Time Discovery System Service Discovery\nCommand and Control;T1071;Application Layer Protocol\nExfiltration;T1041;Exfiltration Over C2 Channel\n"
        }
    },
    {
        "report": {
            "id": "report_0x2e91c650",
            "date": "20220405",
            "title": "Inside Lightning Stealer. A New Info Stealer Targeting over 30 Browsers",
            "url": "https://blog.cyble.com/2022/04/05/inside-lightning-stealer"
        },
        "chapter": {
            "id": "chapter_0x7b0e00fd",
            "title": "Indicators of Compromise (IoCs):",
            "text": "",
            "table": "0;1;2\nIndicators;Indicator type;Description\nhxxps[:]//panels[.]xyz;URL;C2 URL\n1b922b6d15085da82e20fee0789a6617 231a8e1a06d1673c8922d149af9d8f156dcbe228 a2a3b6db773b95fa27501f081b03daf2a29bfb800b4efa397cc4fc59ff755368;Md5 SHA-1 SHA-256;Stealer Payload\n473781fe7d820ef805d1aa79ace86816 b7a42714b4e5dd7cfb6a2c8d7eb30d8bcce9a7ba 6e016bcbead2dddb80dd4a592b1f3c042c52dc8a26ee37e0943f1a8c433e4c5f;Md5 SHA-1 SHA-256;Stealer Payload\n"
        }
    }
]