[
    {
        "report": {
            "id": "report_0xf7e3ef3f",
            "date": "20220328",
            "title": "BitRAT Disguised as Officer Installer Being Distributed",
            "url": "https://asec.ahnlab.com/en/33024"
        },
        "chapter": {
            "id": "chapter_0xa52dc94a",
            "title": "BitRAT Disguised as Officer Installer Being Distributed",
            "text": "The ASEC analysis team previously uploaded a post about BitRAT that was distributed under the disguise of Windows OS license verification tool. The BitRAT is now being distributed as Office Installer with different files, preying upon potential victims.\nBitRAT Disguised as Windows Product Key Verification Tool Being Distributed\nThe following image shows a post that contains the malware. It is titled, [New][Cheap]Office 2021 Installer + Permanent License Verification.\nFigure 1. Post disguised as download of Windows license verification tool 1\nFigure 2. Post disguised as download of Windows license verification tool 2\nThe downloaded file is a compressed file named Program.zip, just like the one introduced in the previous blog post (see Figure 3 and Figure 4). As per the post description, the password of this compressed file is 1234. The compressed file contains Office installer named OInstall.exe.\nFigure 3. Downloaded compressed file\nFigure 4. Files included in the compressed file\nThe pop-up the victim gets is that of the Office downloader (see Figure 5), but the actual downloader installs it in the startup folder (see Figure 6). Normally, the first file that is installed is a downloader of the same kind, and the downloader run this way ultimately installs BitRAT into the path %TEMP% as Software_Reporter_Tool.exe.\nFigure 5. Office downloader pop-up the victims get\nFigure 6. Actual malware (BitRAT downloader) secretly downloaded\nThe following lists features of BitRAT.\n1. Network Communication Method\nEncrypted communication using TLS 1.2\nCommunication using Tor\n2. Basic Control\nProcess manager\nService manager\nFile manager\nWindows manager\nSoftware manager\n3. Information Theft\nKeylogging\nClipboard logging\nWebcam logging\nAudio logging\nApplication (e.g. Web browsers) account credential theft\n4. Remote Control\nRemote desktop\nhVNC (Hidden Desktop)\n5. Proxy\nSOCKS5 Proxy: port forwarding feature using UPnP\nReverse Proxy: SOCKS4 Proxy\n6. Coin Mining\nXMRig CoinMiner\n7. etc.\nDDoS attack\nUAC Bypass\nWindows Defender deactivation\nAs shown in the examples above, the malware is being distributed actively via file-sharing websites such as Korean webhards. As such, caution is advised when running executables downloaded from a file-sharing website. It is recommended for the users to download products from the official websites of developers.\nAhnLabs anti-malware software, V3, detects and blocks the malware above using the aliases below.\n[File Detection]\nDownloader/Win.BitRAT.C5018635 (2022.03.22.03)\nDownloader/Win.BitRAT.R479001 (2022.03.22.03)\nBackdoor/Win.BitRAT.C5023733 (2022.03.22.03)\n[Behavior Detection]\nMalware/MDP.Download.M1197\n[IOC]\nDownloader malware MD5\n8efb366f0adeeb32e66ea03eff4f50f8\n56fbf1d1f2737a2d3c05b2dbc7bb0ca6\n72869b470b5fe354db412283b4172a47\n08634ba1bdf3d4594887a9a7a44c7ab1\nBitRAT MD5\nd632849a9033f24257439988533d31f2\nSubscribe to AhnLabs next-generation threat intelligence platform AhnLab TIP to check related IOC and detailed analysis information.\nCategories:Malware Information, Others"
        }
    },
    {
        "report": {
            "id": "report_0xf7e3ef3f",
            "date": "20220328",
            "title": "BitRAT Disguised as Officer Installer Being Distributed",
            "url": "https://asec.ahnlab.com/en/33024"
        },
        "chapter": {
            "id": "chapter_0xcb86edcd",
            "title": "BitRAT Disguised as Officer Installer Being Distributed",
            "text": "Posted on\nMarch 28, 2022"
        }
    }
]