[
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0xae89673b",
            "title": "#Phishkit_1",
            "text": "A vaga associada ao #Phiskitkit_1 nomenclatura para categorizar esta campanha durante o artigo distribuda massivamente atravs de SMS maliciosas (smishing). Mais detalhes sobre este tipo de esquema e tcnicas associadas podem ser consultadas nas seguintes publicaes:\nPhishing bancrio as a service em Portugal com novo servidor C2\nTaking the bait: The modus operandi of massive social engineering waves impacting banks in Portugal\nNeste caso em especfico, a URL partilhada no corpo da SMS remete a vitima para a landing-page da campanha.\nhxxps://nbseguranca.]sbs/\n45.9.190.]98\nPara tornar o esquema o mais prximo possvel do sistema legtimo, os criminosos utilizam um certificado digital no domnio assinado pela entidade: Lets Encrypt, uma CA que no deve ser confivel quando acedemos sistemas sensveis e crticos, incluindo portais homebanking.\nFigura 1: Certificado SSL obtido via Lets Encrypt CA.\nAps aceder landing-page inicial, apresentada uma barra de progresso de validao de forma a motivar a vtima a permanecer na pgina.\nFigura 2: Pgina inicial da campanha com uma barra de progresso de forma a iludir as vtimas a permanecer na pgina.\nEm detalhe, esta pea de teatro conseguida atravs de umas linhas de cdigo em JavaScript, como pode ser observado em seguida.\nFigura 3: Cdigo JavaScript responsvel por preencher a barra de progresso apresentada na Figura 2 e no final apresentar o primeiro formulrio que solicita dados sensiveis.\nAps a barra de progresso terminar o processo de loading, apresentado o primeiro formulrio onde so solicitados os primeiros detalhes vitima, incluindo:\n-> Nome\n-> IBAN\n-> Montante para Cancelamento\nFigura 4: Landing-page onde os primeiros detalhes so solicitados vitima.\nQuando a informao solicitada corretamente preenchida, o click no boto Continuar ir exibir uma pgina de espera at que alguma interao em backoffice por parte dos operadores seja consumada. Um modus operandi bem conhecido das anlise j partilhadas neste blog.\nFigura 5: Pgina de Verificao de dados apresentada enquanto no existir interao em background por parte dos operadores do esquema."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0xf2551c36",
            "title": "#Phishkit_2",
            "text": "Um outro phishkit est tambm a ser distribudo por SMS e email.\nhttps://s.id/NovoB\nhttps://adventurerides.travel/\nhttps://curiosityjump.com/\nhttps://drupal.nettrackers.in/\nOs domnios partilhados acima tambm possuem certificado SSL Lets Encrypt. A landing-page inicial muito similar ao homebanking oficial.\nFigura 9: Landing-page inicial da campanha #phishkit_2.\nSem entrar em detalhes tcnicos sobre as pginas seguintes, uma vez que o modus operandi j foi escrutinado em publicaes anterior, ao introduzir o nmero de adeso a vtima direcionada para uma segunda pgina onde solicitado o PIN de acesso, e posteriormente, uma pgina de loading ento apresentada.\nComo observado no esquema anteriormente descrito, esta precisamente a janela de oportunidade dos criminosos. Em backoffice, eles coorderam toda a operao solicitando detalhes adicionais s vtimas por etapas.\nFigura 10: Pgina de solicitao de PIN e loading exato momento em que os criminosos coorderam que tipos de dados sero solicitados em seguida."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0x7bf8c794",
            "title": "No More Fun o.O",
            "text": "O cdigo fonte do backoffice geralmente um stio interessante para anlise. Para alm de diversas lacunas de codificao facilmente perceptveis, o local perfeito para a abertura caa do low hanging fruit experts percebero no imediato o uso desta to conhecida expresso.\nFigura 13: Endpoint responsvel pelo drop da base de dados.\nUm endpoint responsvel por eliminar a base de dados do sistema foi identificado. Os simpticos desenvolvedores a facilitarem o trabalho dos experts da rea."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0x414a9c87",
            "title": "Indicadores de Compromisso (IoCs)",
            "text": "https://s.id/NovoB\nhttps://adventurerides.travel\nhttps://curiosityjump.com\nhttps://drupal.nettrackers.in\nhxxps://nbseguranca.]sbs\n45.9.190.]98\nPedro Tavares\nPedro Tavares is a professional in the field of information security working as an Ethical Hacker/Pentester, Malware Researcher and also a Security Evangelist. He is also a founding member at CSIRT.UBI and Editor-in-Chief of the security computer blog seguranca-informatica.pt.\nIn recent years he has invested in the field of information security, exploring and analyzing a wide range of topics, such as pentesting (Kali Linux), malware, exploitation, hacking, IoT and security in Active Directory networks. He is also Freelance Writer (Infosec. Resources Institute and Cyber Defense Magazine) and developer of the 0xSI_f33d a feed that compiles phishing and malware campaigns targeting Portuguese citizens.\nRead more here."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0x14a6cce0",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado",
            "text": "Phishing bancrio? Sim mesmo real, e com callcenter renovado.\nPhishing bancrio um dos mais proeminentes esquemas disseminados em Portugal e com maior retorno para os cibercriminosos. Algumas das variveis que contribuem para a disseminao massiva deste tipo de scams a escassa literacia digital por parte dos utilizadores; que diga-se, tiveram o primeiro contacto com esta veloz transformao digital j numa fase um tudo nada tardia.\nNesta analise so apresentados dois diferentes tipos de phishkit utilizados por cibercriminosos de origem brasileira em Portugal. As landing-pages so similares aos sistemas homebanking da organizao alvo, mas os backoffice de controlo so recentes desenvolvimentos."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0xc120a4e8",
            "title": "Callcenter renovado Por trs da cena",
            "text": "Sempre que uma nova vtima tropea na armadilha, os sinos tocam. No de todo uma brincadeira, no backoffice usado pelos criminosos para controlar as operaes uma campainha toca sempre que um novo cliente regsitado na base de dados.\nFigura 6: Backoffice utilizado pelos criminosos na campanha denominada por #phishkit_1.\nAqui, possvel controlar que tipo de detalhes so solicitado por etapas, incluindo posies do carto matriz, cdigos de SMS (tokens), upload do carto matriz, etc. As duas imagens abaixo apresentam parte do processo malicioso."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0xd1a29450",
            "title": "Solicitao de posies do carto matriz",
            "text": "Figura 7: Detalhes do carto matriz solicitados vitima via backoffice."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0x28a33006",
            "title": "Solicitao do upload do carto matriz",
            "text": "Figura 8: Solicitao do carregamento do carto matriz."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0xcab70f81",
            "title": "A nova empreitada: Callcenter A operao em segundo plano",
            "text": "O backoffice identififcado durante a anlise parece ainda em desenvolvimento, e foram muitos os detalhes que direcionam nesse sentido. Para alm de algumas funcionalidades ainda no estarem completamente disponveis, a propria API utilizada no backoffice para envio dos detalhes para um outro servidor / n centralizado algures na Internet possua indicadores e artefactos de teste.\nFigura 11: Backoffice referente ao #phishkit_2.\nAlguns dos detalhes referentes API podem ser observados na Figura 12 abaixo, com o parametro novobancopoc (prova de conceito) bem identificado.\nFigura 12: Detalhes associados API referente ao #phishkit_2."
        }
    },
    {
        "report": {
            "id": "report_0x4f4c9cc9",
            "date": "20220407",
            "title": "Phishing bancrio? Sim mesmo real, e com callcenter renovado. #Phishkit_1",
            "url": "https://seguranca-informatica.pt/phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado/?utm_source=rss&utm_medium=rss&utm_campaign=phishing-bancario-sim-e-mesmo-real-e-com-callcenter-renovado"
        },
        "chapter": {
            "id": "chapter_0x32f76ab9",
            "title": "The fun is over, and now the world is safe again!",
            "text": "Aos utilizadores sugere-se uma vez mais, alguma sensibilidade e anlise quando confrontados com situaes desta natureza. Quanto s organizaes alvo neste tipo de investidas, sugere-se tambm algum controlo no tipo de acessos s contas dos utilizadores, nomeadamente atravs:\nControlo de acesso por endereo de IP; temos observado que alguns grupos criminosos realizam os acessos atravs de endereos de IP geo-localizados no Brasil, e em alguns casos, sem VPN e atravs dos endereos de IP residenciais de forma a evitar firewalls.\ncriao de honey-accounts, de forma a que os criminosos pensem estar a realizar a operao maliciosa numa conta legtima. Ao mesmo tempo este tipo de abordagem permite capturar indicadores do grupo malicioso, incluindo a sua geolocalizao, tipo de dispositivo de acesso etc.\nTodos os endereos foram adicionados ao 0xSI_f33d para que as organizaes possam proceder ao bloqueio dos endereos de IP/domnios de forma eficaz.\nEm caso de suspeita de campanhas de phishing ou malware partilhe a situao com as autoridades ou atravs do formulrio disponvel aqui, ou submeta a URL maliciosa/suspeita para o 0xSI_f33d."
        }
    }
]